[
  {
    "title": "National Pet Day",
    "slug": "national-pet-day",
    "date": "2025-10-05",
    "category": "Animals",
    "description": "Show your furry, feathered, or scaly friends some extra love on National Pet Day! This special day celebrates the unconditional love and joy that pets bring to our lives. Learn about pet care tips, discover fun activities to do with your pet, and consider supporting local animal shelters. Whether you have a dog, cat, bird, or any other companion, today is all about appreciating the special bond between humans and animals.",
    "tags": [
      "pets",
      "animals",
      "October",
      "love",
      "care",
      "companionship",
      "shelters"
    ],
    "image": "happy-pets-together.jpg",
    "relatedDays": [
      "national-dog-day",
      "national-cat-day",
      "national-adopt-a-pet-day"
    ],
    "howToCelebrate": "Spend extra quality time with your pet - take them for a longer walk, play their favorite games, or give them extra cuddles. Treat your pet to something special like a new toy or their favorite treats. Take photos and share them on social media with #NationalPetDay. Volunteer at a local animal shelter or donate pet supplies. Consider adopting a pet if you're ready for the commitment.",
    "funFacts": [
      "70% of American households own at least one pet",
      "Pet owners visit the doctor 30% less often than non-pet owners",
      "Dogs have been domesticated for over 15,000 years",
      "Cats spend 70% of their lives sleeping",
      "Petting a dog or cat can lower your blood pressure and reduce stress"
    ]
  },
  {
    "title": "National Dog Day",
    "slug": "national-dog-day",
    "date": "2025-08-26",
    "category": "Animals",
    "description": "Celebrate our loyal canine companions on National Dog Day! This special day honors the unconditional love, loyalty, and joy that dogs bring to our lives. From rescue dogs to purebreds, working dogs to family pets, join millions of dog lovers worldwide in celebrating these amazing animals who make our world a better place.",
    "tags": [
      "dogs",
      "pets",
      "August",
      "loyalty",
      "companionship",
      "animals",
      "love"
    ],
    "image": "happy-dogs-playing.jpg",
    "relatedDays": [
      "national-pet-day",
      "national-adopt-a-dog-day",
      "national-puppy-day"
    ],
    "howToCelebrate": "Spend extra time playing with your dog - take them for a long walk, play fetch, or give them their favorite treats. Visit a local dog park to let your pup socialize with other dogs. Consider adopting a rescue dog from a local shelter. Donate to animal rescue organizations or volunteer at a local animal shelter. Share photos of your dog on social media with #NationalDogDay.",
    "funFacts": [
      "Dogs have been human companions for over 15,000 years",
      "A dog's sense of smell is 10,000 to 100,000 times more sensitive than humans",
      "Dogs can learn over 150 words and gestures",
      "The average dog lives 10-13 years, depending on breed",
      "Dogs can detect diseases like cancer and diabetes through smell"
    ]
  },
  {
    "title": "National Cat Day",
    "slug": "national-cat-day",
    "date": "2025-10-29",
    "category": "Animals",
    "description": "Paws and celebrate our feline friends on National Cat Day! These independent, graceful, and sometimes mysterious creatures bring joy, comfort, and entertainment to millions of households. From playful kittens to wise senior cats, honor the special bond between humans and cats while supporting cat rescue and adoption efforts.",
    "tags": [
      "cats",
      "pets",
      "October",
      "feline",
      "adoption",
      "rescue",
      "companionship"
    ],
    "image": "national-cat-day-optimized.webp",
    "relatedDays": [
      "national-pet-day",
      "national-kitten-day",
      "national-black-cat-day"
    ],
    "howToCelebrate": "Spend quality time with your cat - play with their favorite toys, give them extra cuddles, or treat them to a special meal. Consider adopting a cat from a local shelter or rescue organization. Donate cat food, toys, or supplies to animal shelters. Share photos of your cat on social media with #NationalCatDay. Learn about cat behavior and how to provide the best care for your feline friend.",
    "funFacts": [
      "Cats spend 70% of their lives sleeping - that's 13-16 hours per day",
      "A group of cats is called a 'clowder' or a 'glaring'",
      "Cats can rotate their ears 180 degrees independently",
      "A cat's purr has healing properties and can help reduce stress in humans",
      "Cats have been domesticated for over 4,000 years"
    ]
  },
  {
    "title": "National Bird Day",
    "slug": "national-bird-day",
    "date": "2025-01-05",
    "category": "Animals",
    "description": "Spread your wings and celebrate our feathered friends on National Bird Day! This special day honors the beauty, diversity, and importance of birds in our ecosystems. From backyard songbirds to majestic eagles, learn about bird conservation, enjoy birdwatching, and appreciate the vital role birds play in maintaining the balance of nature.",
    "tags": [
      "birds",
      "animals",
      "January",
      "conservation",
      "nature",
      "birdwatching",
      "wildlife"
    ],
    "image": "colorful-birds-in-nature.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "world-migratory-bird-day",
      "national-audubon-day"
    ],
    "howToCelebrate": "Go birdwatching in your local park or nature area with binoculars and a field guide. Set up bird feeders in your yard to attract local species. Learn about bird conservation efforts and support organizations that protect bird habitats. Take photos of birds you spot and share them on social media. Visit a local aviary or bird sanctuary to see exotic species up close.",
    "funFacts": [
      "There are over 10,000 species of birds worldwide",
      "Birds are the only animals with feathers",
      "The smallest bird is the bee hummingbird, weighing less than a penny",
      "Birds can see ultraviolet light, which humans cannot",
      "The oldest known bird fossil is 150 million years old"
    ]
  },
  {
    "title": "National Fish Day",
    "slug": "national-fish-day",
    "date": "2025-08-04",
    "category": "Animals",
    "description": "Dive deep and celebrate the fascinating world of fish on National Fish Day! From tropical reef fish to deep-sea creatures, fish make up the largest group of vertebrates on Earth. Learn about marine conservation, discover different fish species, and appreciate the vital role fish play in aquatic ecosystems and human nutrition.",
    "tags": [
      "fish",
      "marine",
      "August",
      "ocean",
      "conservation",
      "aquatic",
      "wildlife"
    ],
    "image": "colorful-tropical-fish.jpg",
    "relatedDays": [
      "national-ocean-day",
      "world-oceans-day",
      "national-seafood-day"
    ],
    "howToCelebrate": "Visit an aquarium to see different fish species up close. Go fishing (catch and release) to experience fish in their natural habitat. Learn about sustainable fishing practices and marine conservation. Try cooking different types of fish for dinner. Support organizations that protect marine ecosystems and fish habitats.",
    "funFacts": [
      "There are over 34,000 species of fish in the world",
      "Fish have been on Earth for over 500 million years",
      "Some fish can change their gender during their lifetime",
      "The smallest fish is the Paedocypris, measuring just 7.9mm",
      "Fish provide protein for over 3 billion people worldwide"
    ]
  },
  {
    "title": "National Pet Adoption Day",
    "slug": "national-pet-adoption-day",
    "date": "2025-04-30",
    "category": "Animals",
    "description": "Open your heart and home to a furry friend on National Pet Adoption Day! This special day encourages people to consider adopting pets from shelters and rescue organizations. Whether you're looking for a dog, cat, or other companion animal, adoption saves lives and brings immeasurable joy to both pets and their new families.",
    "tags": [
      "adoption",
      "pets",
      "April",
      "rescue",
      "shelters",
      "companionship",
      "love"
    ],
    "image": "happy-adopted-pet.jpg",
    "relatedDays": [
      "national-pet-day",
      "national-dog-day",
      "national-cat-day"
    ],
    "howToCelebrate": "Visit local animal shelters and rescue organizations to meet adoptable pets. Consider adopting a pet if you're ready for the commitment. Volunteer at animal shelters or foster a pet temporarily. Donate supplies, food, or money to local rescue organizations. Share adoption success stories on social media to encourage others.",
    "funFacts": [
      "Over 6 million pets enter animal shelters each year in the US",
      "Adopting a pet can reduce stress and improve mental health",
      "Mixed-breed pets often live longer than purebred pets",
      "Senior pets are often the most grateful and loving companions",
      "Adoption fees are typically much less than purchasing from breeders"
    ]
  },
  {
    "title": "National Wildlife Day",
    "slug": "national-wildlife-day",
    "date": "2025-09-04",
    "category": "Animals",
    "description": "Celebrate the incredible diversity of wild animals on National Wildlife Day! This special day raises awareness about wildlife conservation and the importance of protecting natural habitats. From majestic elephants to tiny hummingbirds, learn about different species, their ecosystems, and how we can help preserve wildlife for future generations.",
    "tags": [
      "wildlife",
      "conservation",
      "September",
      "animals",
      "nature",
      "habitat",
      "preservation"
    ],
    "image": "wild-animals-in-nature.jpg",
    "relatedDays": [
      "national-bird-day",
      "national-fish-day",
      "world-environment-day"
    ],
    "howToCelebrate": "Visit a wildlife sanctuary, zoo, or nature reserve. Learn about endangered species and conservation efforts. Support wildlife conservation organizations through donations or volunteering. Create a wildlife-friendly garden with native plants. Share information about wildlife conservation on social media.",
    "funFacts": [
      "There are over 8.7 million species of wildlife on Earth",
      "Wildlife tourism generates over $120 billion annually",
      "Habitat loss is the biggest threat to wildlife",
      "Conservation efforts have saved many species from extinction",
      "Wildlife plays a crucial role in maintaining ecosystem balance"
    ]
  },
  {
    "title": "National Elephant Day",
    "slug": "national-elephant-day",
    "date": "2025-04-16",
    "category": "Animals",
    "description": "Celebrate the gentle giants of the animal kingdom on National Elephant Day! These magnificent creatures are known for their intelligence, memory, and strong family bonds. Learn about elephant conservation, their importance to ecosystems, and the threats they face. Support efforts to protect these incredible animals for future generations.",
    "tags": [
      "elephants",
      "wildlife",
      "April",
      "conservation",
      "intelligence",
      "endangered",
      "majestic"
    ],
    "image": "majestic-elephants-in-nature.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "world-elephant-day",
      "national-zoo-day"
    ],
    "howToCelebrate": "Visit a zoo or wildlife sanctuary to see elephants up close. Learn about elephant conservation efforts and support organizations that protect them. Watch documentaries about elephant behavior and intelligence. Share information about elephant conservation on social media. Avoid products that contribute to elephant habitat destruction.",
    "funFacts": [
      "Elephants are the largest land animals on Earth",
      "Elephants can live up to 70 years in the wild",
      "Elephants have excellent memories and can remember locations for decades",
      "Elephants communicate through infrasound that can travel miles",
      "African elephants are listed as endangered, Asian elephants as critically endangered"
    ]
  },
  {
    "title": "National Rabbit Day",
    "slug": "national-rabbit-day",
    "date": "2025-09-27",
    "category": "Animals",
    "description": "Hop into the adorable world of rabbits on National Rabbit Day! These gentle, intelligent creatures make wonderful companions and are beloved for their soft fur, twitching noses, and playful personalities. Learn about rabbit care, discover different breeds, and appreciate these amazing animals that have captured hearts worldwide with their charm and grace.",
    "tags": [
      "rabbits",
      "pets",
      "September",
      "cute",
      "gentle",
      "companions",
      "adorable"
    ],
    "image": "cute-rabbits-playing.jpg",
    "relatedDays": [
      "national-pet-day",
      "national-wildlife-day",
      "national-bunny-day"
    ],
    "howToCelebrate": "Visit a local animal shelter to meet adoptable rabbits. Learn about proper rabbit care, including diet, housing, and exercise needs. Support rabbit rescue organizations through donations or volunteering. Share photos of rabbits and rabbit care tips on social media. Consider adopting a rabbit if you're prepared for the long-term commitment.",
    "funFacts": [
      "Rabbits can live 8-12 years with proper care",
      "A rabbit's teeth never stop growing throughout their lifetime",
      "Rabbits are social animals and do better in pairs",
      "Baby rabbits are called kits and are born blind and deaf",
      "Rabbits can jump up to 3 feet high and run up to 35 mph"
    ]
  },
  {
    "title": "National Horse Day",
    "slug": "national-horse-day",
    "date": "2025-12-13",
    "category": "Animals",
    "description": "Gallop into the majestic world of horses on National Horse Day! These magnificent animals have been human companions for thousands of years, serving as working partners, athletes, and beloved friends. From wild mustangs to gentle therapy horses, celebrate the beauty, strength, and intelligence of these incredible creatures that continue to capture our hearts.",
    "tags": [
      "horses",
      "equine",
      "December",
      "majestic",
      "companions",
      "strength",
      "beauty"
    ],
    "image": "beautiful-horses-running.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "national-pet-day",
      "national-cowboy-day"
    ],
    "howToCelebrate": "Visit a local stable, ranch, or equestrian center to see horses up close. Learn about different horse breeds and their unique characteristics. Support horse rescue organizations and sanctuaries. Take horseback riding lessons or go on a trail ride. Share photos and facts about horses on social media to raise awareness.",
    "funFacts": [
      "Horses can sleep both lying down and standing up",
      "A horse's heart weighs about 8-10 pounds and pumps 8 gallons of blood per minute",
      "Horses have excellent memories and can recognize human friends after years of separation",
      "The oldest horse on record lived to be 62 years old",
      "Horses have nearly 360-degree vision due to the position of their eyes"
    ]
  },
  {
    "title": "National Turtle Day",
    "slug": "national-turtle-day",
    "date": "2025-05-23",
    "category": "Animals",
    "description": "Slow down and appreciate the ancient wisdom of turtles on National Turtle Day! These remarkable reptiles have been around for over 200 million years and play important roles in their ecosystems. From sea turtles to box turtles, learn about different species, their conservation needs, and the vital role they play in maintaining environmental balance.",
    "tags": [
      "turtles",
      "reptiles",
      "May",
      "conservation",
      "ancient",
      "ecosystems",
      "wildlife"
    ],
    "image": "turtles-in-natural-habitat.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "world-environment-day",
      "national-reptile-day"
    ],
    "howToCelebrate": "Visit a local aquarium or zoo to see different turtle species. Support turtle conservation organizations through donations or volunteering. Learn about threats facing turtle populations and how to help protect them. Participate in beach cleanups to protect sea turtle nesting sites. Share turtle conservation facts on social media.",
    "funFacts": [
      "Turtles have been on Earth for over 200 million years",
      "A turtle's shell is made up of over 50 bones",
      "Some sea turtles can live over 100 years",
      "Turtles are found on every continent except Antarctica",
      "The temperature of turtle eggs determines the gender of the babies"
    ]
  },
  {
    "title": "National Butterfly Day",
    "slug": "national-butterfly-day",
    "date": "2025-06-14",
    "category": "Animals",
    "description": "Flutter into the beautiful world of butterflies on National Butterfly Day! These delicate creatures are not only stunning to behold but also play crucial roles as pollinators in our ecosystems. From monarchs to swallowtails, discover the incredible diversity of butterflies, their life cycles, and the importance of protecting their habitats.",
    "tags": [
      "butterflies",
      "insects",
      "June",
      "pollinators",
      "beautiful",
      "metamorphosis",
      "nature"
    ],
    "image": "colorful-butterflies-in-garden.jpg",
    "relatedDays": [
      "national-pollinator-week",
      "national-gardening-day",
      "world-environment-day"
    ],
    "howToCelebrate": "Visit butterfly gardens, conservatories, or natural areas where butterflies can be observed. Plant butterfly-friendly flowers and plants in your garden. Learn about butterfly life cycles and metamorphosis. Support butterfly conservation efforts and habitat restoration projects. Take photos of butterflies and share them on social media.",
    "funFacts": [
      "There are about 17,500 butterfly species worldwide",
      "Butterflies taste with their feet and smell with their antennae",
      "The monarch butterfly migration can span up to 3,000 miles",
      "Butterflies can see ultraviolet light that humans cannot",
      "A butterfly's wings are completely transparent - the colors come from tiny scales"
    ]
  },
  {
    "title": "National Penguin Day",
    "slug": "national-penguin-day",
    "date": "2025-01-20",
    "category": "Animals",
    "description": "Waddle into the wonderful world of penguins on National Penguin Day! These charming, flightless birds have captured hearts with their adorable appearance and fascinating behaviors. From emperor penguins braving Antarctic storms to playful penguins sliding on ice, learn about different penguin species, their habitats, and conservation efforts to protect these remarkable creatures.",
    "tags": [
      "penguins",
      "birds",
      "January",
      "antarctica",
      "conservation",
      "adorable",
      "marine"
    ],
    "image": "adorable-penguins-ice.jpg",
    "relatedDays": [
      "national-bird-day",
      "world-wildlife-day",
      "national-zoo-day"
    ],
    "howToCelebrate": "Visit a zoo or aquarium to see penguins up close. Watch penguin documentaries to learn about their behaviors and habitats. Support penguin conservation organizations and research programs. Learn about climate change impacts on penguin populations. Share penguin facts and photos on social media to raise awareness.",
    "funFacts": [
      "There are 18 different species of penguins worldwide",
      "Emperor penguins can dive up to 1,800 feet deep",
      "Penguins can drink saltwater because they have special glands that filter out salt",
      "A group of penguins is called a colony, rookery, or waddle",
      "Penguins' black and white coloring provides camouflage while swimming"
    ]
  },
  {
    "title": "National Bee Day",
    "slug": "national-bee-day",
    "date": "2025-08-19",
    "category": "Animals",
    "description": "Buzz into the essential world of bees on National Bee Day! These incredible insects are vital pollinators that help produce the food we eat and maintain healthy ecosystems. From honeybees to bumblebees, learn about different bee species, their important role in agriculture, and what we can do to protect these crucial creatures from declining populations.",
    "tags": [
      "bees",
      "pollinators",
      "August",
      "insects",
      "honey",
      "conservation",
      "ecosystems"
    ],
    "image": "bees-pollinating-flowers.jpg",
    "relatedDays": [
      "national-pollinator-week",
      "world-bee-day",
      "national-honey-day"
    ],
    "howToCelebrate": "Plant bee-friendly flowers and plants in your garden. Support local beekeepers by buying local honey. Learn about the importance of bees in food production. Avoid using pesticides that harm bee populations. Share information about bee conservation and the pollinator crisis on social media.",
    "funFacts": [
      "Bees pollinate about one-third of everything we eat",
      "A single bee colony can contain up to 80,000 bees",
      "Bees communicate through a 'waggle dance' to share location information",
      "Honey never spoils - archaeologists have found edible honey in ancient tombs",
      "Bee populations have declined by 40% over the past decade"
    ]
  },
  {
    "title": "National Koala Day",
    "slug": "national-koala-day",
    "date": "2025-05-03",
    "category": "Animals",
    "description": "Cuddle up to the adorable world of koalas on National Koala Day! These iconic Australian marsupials are beloved for their cute appearance and sleepy nature. Learn about koala conservation efforts, their unique eucalyptus diet, and the challenges they face from habitat loss and climate change. Help protect these precious creatures for future generations.",
    "tags": [
      "koalas",
      "marsupials",
      "May",
      "australia",
      "conservation",
      "eucalyptus",
      "endangered"
    ],
    "image": "cute-koala-eucalyptus.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "world-wildlife-day",
      "australian-wildlife-day"
    ],
    "howToCelebrate": "Learn about koala behavior, diet, and habitat needs. Support koala conservation organizations and wildlife sanctuaries. Adopt a koala through conservation programs. Share koala facts and conservation information on social media. Visit zoos or wildlife parks that care for koalas.",
    "funFacts": [
      "Koalas sleep 18-22 hours per day to conserve energy",
      "Baby koalas are called joeys and are only 2cm long at birth",
      "Koalas have fingerprints that are remarkably similar to human fingerprints",
      "They get most of their water from eucalyptus leaves",
      "Koala populations have declined by 30% in the past 20 years"
    ]
  },
  {
    "title": "National Shark Day",
    "slug": "national-shark-day",
    "date": "2025-07-14",
    "category": "Animals",
    "description": "Dive into the fascinating world of sharks on National Shark Day! These apex predators are essential to ocean ecosystems and have been swimming in our seas for over 400 million years. Learn about different shark species, their importance to marine environments, and conservation efforts to protect these magnificent but often misunderstood creatures.",
    "tags": [
      "sharks",
      "marine-life",
      "July",
      "ocean",
      "predators",
      "conservation",
      "misunderstood"
    ],
    "image": "sharks-ocean-habitat.jpg",
    "relatedDays": [
      "world-oceans-day",
      "national-fish-day",
      "marine-conservation-day"
    ],
    "howToCelebrate": "Visit aquariums to see sharks up close and learn about their behavior. Watch shark documentaries to understand their role in ocean ecosystems. Support shark conservation organizations and marine protection efforts. Learn to distinguish facts from myths about sharks. Share shark conservation awareness on social media.",
    "funFacts": [
      "Sharks have been around for over 400 million years",
      "There are over 500 species of sharks worldwide",
      "Sharks can detect electrical fields from other animals",
      "Most sharks are not dangerous to humans",
      "Shark populations have declined by 70% over the past 50 years"
    ]
  },
  {
    "title": "National Squirrel Day",
    "slug": "national-squirrel-day",
    "date": "2025-01-21",
    "category": "Animals",
    "description": "Go nuts for squirrels on National Squirrel Day! These acrobatic rodents are common sights in parks and backyards, entertaining us with their playful antics and impressive climbing abilities. From gathering nuts to building nests, learn about squirrel behavior, different species, and how these clever creatures adapt to urban environments.",
    "tags": [
      "squirrels",
      "rodents",
      "January",
      "urban-wildlife",
      "acrobatic",
      "nuts",
      "playful"
    ],
    "image": "squirrels-in-park.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "national-bird-day",
      "urban-wildlife-day"
    ],
    "howToCelebrate": "Observe squirrels in your local parks or backyard. Learn about different squirrel species and their behaviors. Create squirrel-friendly spaces with appropriate food and shelter. Take photos of squirrels and share them on social media. Support urban wildlife conservation efforts.",
    "funFacts": [
      "Squirrels can jump 10 times their body length",
      "They bury thousands of nuts each year and remember most locations",
      "Squirrels' teeth never stop growing throughout their lives",
      "There are over 200 species of squirrels worldwide",
      "Squirrels can rotate their ankles 180 degrees to climb down trees headfirst"
    ]
  },
  {
    "title": "National Dolphin Day",
    "slug": "national-dolphin-day",
    "date": "2025-04-14",
    "category": "Animals",
    "description": "Splash into the intelligent world of dolphins on National Dolphin Day! These remarkable marine mammals are known for their intelligence, playful nature, and complex social behaviors. From their sophisticated communication skills to their problem-solving abilities, dolphins continue to amaze scientists and ocean lovers alike with their incredible capabilities.",
    "tags": [
      "dolphins",
      "marine-mammals",
      "April",
      "intelligent",
      "ocean",
      "playful",
      "social"
    ],
    "image": "dolphins-playing-ocean.jpg",
    "relatedDays": [
      "world-oceans-day",
      "national-marine-life-day",
      "whale-watching-day"
    ],
    "howToCelebrate": "Visit marine parks or aquariums to observe dolphins. Learn about dolphin intelligence and communication methods. Support marine conservation organizations protecting dolphin habitats. Watch documentaries about dolphin behavior and social structures. Share dolphin facts and conservation messages on social media.",
    "funFacts": [
      "Dolphins have names for each other using unique whistle signatures",
      "They can recognize themselves in mirrors, showing self-awareness",
      "Dolphins use echolocation to navigate and hunt",
      "They live in complex social groups called pods",
      "Dolphins have been observed using tools and teaching skills to their young"
    ]
  },
  {
    "title": "National Panda Day",
    "slug": "national-panda-day",
    "date": "2025-03-16",
    "category": "Animals",
    "description": "Celebrate the adorable giant pandas on National Panda Day! These beloved black and white bears are symbols of conservation success and gentle giants of the animal kingdom. Learn about panda conservation efforts, their unique bamboo diet, and the important role they play in raising awareness about endangered species worldwide.",
    "tags": [
      "pandas",
      "bears",
      "March",
      "endangered",
      "conservation",
      "bamboo",
      "china"
    ],
    "image": "giant-panda-bamboo.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "world-wildlife-day",
      "national-zoo-day"
    ],
    "howToCelebrate": "Visit a zoo with pandas or watch panda webcams online. Learn about panda conservation and habitat protection. Support organizations working to protect pandas and their habitats. Share panda facts and conservation information on social media. Watch documentaries about panda behavior and conservation efforts.",
    "funFacts": [
      "Giant pandas spend 10-16 hours a day eating bamboo",
      "Pandas have a pseudo-thumb that helps them grip bamboo",
      "Newborn pandas are only about the size of a stick of butter",
      "Pandas can eat 20-40 pounds of bamboo per day",
      "The panda population has increased by 17% in the past decade"
    ]
  },
  {
    "title": "National Hedgehog Day",
    "slug": "national-hedgehog-day",
    "date": "2025-02-02",
    "category": "Animals",
    "description": "Spike into the adorable world of hedgehogs on National Hedgehog Day! These spiky little creatures are beloved for their cute appearance and gentle nature. From their unique quills to their nocturnal habits, learn about hedgehog care, different species, and why these charming animals have captured hearts around the world.",
    "tags": [
      "hedgehogs",
      "pets",
      "February",
      "spiky",
      "nocturnal",
      "cute",
      "small"
    ],
    "image": "cute-hedgehog-closeup.jpg",
    "relatedDays": [
      "national-pet-day",
      "national-wildlife-day",
      "groundhog-day"
    ],
    "howToCelebrate": "Learn about hedgehog care and behavior. Visit a wildlife center or pet store that has hedgehogs. Support hedgehog conservation organizations. Share hedgehog facts and adorable photos on social media. Consider adopting a hedgehog if you're prepared for the commitment.",
    "funFacts": [
      "Hedgehogs have about 5,000-7,000 quills on their backs",
      "They can roll into a tight ball for protection",
      "Hedgehogs are immune to many snake venoms",
      "They can run up to 4 miles per hour",
      "Hedgehogs are excellent swimmers despite their small size"
    ]
  },
  {
    "title": "National Whale Day",
    "slug": "national-whale-day",
    "date": "2025-02-19",
    "category": "Animals",
    "description": "Dive deep into the majestic world of whales on National Whale Day! These magnificent marine mammals are among the largest animals on Earth and play crucial roles in ocean ecosystems. From humpback whales to blue whales, learn about different species, their behaviors, and the conservation efforts protecting these gentle giants.",
    "tags": [
      "whales",
      "marine-mammals",
      "February",
      "ocean",
      "conservation",
      "majestic",
      "migration"
    ],
    "image": "humpback-whale-ocean.jpg",
    "relatedDays": [
      "world-oceans-day",
      "national-marine-life-day",
      "whale-watching-day"
    ],
    "howToCelebrate": "Go whale watching or visit an aquarium with whale exhibits. Learn about whale conservation and ocean protection. Watch documentaries about whale behavior and migration. Support organizations working to protect whale habitats. Share whale facts and conservation information on social media.",
    "funFacts": [
      "Blue whales are the largest animals ever known to have lived on Earth",
      "Whales can communicate across hundreds of miles using sound",
      "Humpback whales are known for their complex songs",
      "Whales play a crucial role in ocean ecosystems",
      "Some whale species can live over 200 years"
    ]
  },
  {
    "title": "National Sloth Day",
    "slug": "national-sloth-day",
    "date": "2025-10-20",
    "category": "Animals",
    "description": "Take it slow and celebrate the adorable sloths on National Sloth Day! These gentle creatures are known for their slow movements and peaceful nature. From their unique upside-down lifestyle to their algae-covered fur, learn about sloth behavior, habitat, and why these laid-back animals have captured hearts worldwide.",
    "tags": [
      "sloths",
      "slow",
      "October",
      "gentle",
      "trees",
      "peaceful",
      "adorable"
    ],
    "image": "cute-sloth-tree.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "world-animal-day",
      "national-zoo-day"
    ],
    "howToCelebrate": "Visit a zoo or wildlife sanctuary with sloths. Learn about sloth conservation and habitat protection. Watch sloth videos and documentaries. Support organizations working to protect sloth habitats. Share sloth facts and adorable photos on social media.",
    "funFacts": [
      "Sloths only come down from trees once a week to go to the bathroom",
      "They move so slowly that algae grows on their fur",
      "Sloths can turn their heads 270 degrees",
      "They sleep 15-20 hours per day",
      "Sloths are excellent swimmers despite their slow movements"
    ]
  },
  {
    "title": "National Puppy Day",
    "slug": "national-puppy-day-celebration",
    "date": "2025-03-23",
    "category": "Animals & Pets",
    "description": "Celebrate the cutest companions on National Puppy Day! This day promotes puppy adoption from shelters and rescues while raising awareness about puppy mills. Whether you have a new puppy or remember your dog's puppy days, celebrate the joy puppies bring to American families.",
    "tags": [
      "puppies",
      "dogs",
      "March",
      "adoption",
      "pets",
      "rescue",
      "animals"
    ],
    "image": "cute-puppies-playing.jpg",
    "relatedDays": [
      "national-dog-day",
      "national-pet-adoption-day",
      "national-pet-day"
    ],
    "howToCelebrate": "Visit a local animal shelter and consider adopting. Donate to puppy rescue organizations. Share puppy photos on social media. Take your dog to a dog park. Support responsible breeders and fight puppy mills. Volunteer at animal shelters.",
    "funFacts": [
      "Over 6.3 million pets enter US animal shelters annually",
      "Puppies learn important social skills between 3-14 weeks",
      "The first year of a dog's life equals about 15 human years",
      "Puppies are born blind and deaf",
      "America is the country with the highest pet dog population"
    ]
  },
  {
    "title": "National Ferret Day",
    "slug": "national-ferret-day-pets",
    "date": "2025-04-02",
    "category": "Animals & Pets",
    "description": "Celebrate these playful pocket pets on National Ferret Day! Ferrets are becoming increasingly popular as companion animals in America. Learn about proper ferret care, adopt from shelters, and celebrate the unique personalities of these energetic, curious creatures.",
    "tags": [
      "ferrets",
      "pets",
      "April",
      "exotic-pets",
      "animals",
      "care",
      "adoption"
    ],
    "image": "playful-ferret-pet.jpg",
    "relatedDays": [
      "national-pet-day",
      "exotic-pet-day",
      "national-animal-welfare-day"
    ],
    "howToCelebrate": "Learn about ferret care and needs. Visit ferret shelters and rescues. Share ferret photos and videos. Support ferret welfare organizations. Educate others about ferrets as pets. Give your ferret special treats and playtime.",
    "funFacts": [
      "Ferrets sleep 14-18 hours per day",
      "They have been domesticated for over 2,500 years",
      "Ferrets can live 6-10 years with proper care",
      "Baby ferrets are called kits",
      "Ferrets are illegal in California and New York City"
    ]
  },
  {
    "title": "National Feral Cat Day",
    "slug": "national-feral-cat-day-awareness",
    "date": "2025-10-16",
    "category": "Animals & Pets",
    "description": "Support community cats on National Feral Cat Day! This day raises awareness about feral and stray cats and promotes TNR (Trap-Neuter-Return) programs. Help control cat populations humanely while caring for cats in American communities.",
    "tags": [
      "feral-cats",
      "cats",
      "October",
      "TNR",
      "animal-welfare",
      "community",
      "rescue"
    ],
    "image": "feral-community-cats.jpg",
    "relatedDays": [
      "national-cat-day",
      "world-animal-day",
      "national-pet-adoption-day"
    ],
    "howToCelebrate": "Support local TNR programs. Volunteer with feral cat colonies. Donate to organizations that help community cats. Build or donate cat shelters. Educate others about feral cat care. Foster kittens from feral litters.",
    "funFacts": [
      "There are an estimated 70 million feral cats in the US",
      "TNR is the most humane way to manage feral cat populations",
      "Feral cats are different from stray cats - ferals are unsocialized to humans",
      "Many communities have successful colony management programs",
      "Feral cats help control rodent populations"
    ]
  },
  {
    "title": "National Guide Dog Day",
    "slug": "national-guide-dog-day-service",
    "date": "2025-04-30",
    "category": "Animals & Pets",
    "description": "Honor the incredible service dogs that change lives on National Guide Dog Day! Guide dogs provide independence and mobility for blind and visually impaired Americans. Celebrate these highly trained working dogs and the organizations that train them.",
    "tags": [
      "guide-dogs",
      "service-dogs",
      "April",
      "working-dogs",
      "accessibility",
      "training",
      "heroes"
    ],
    "image": "guide-dog-working.jpg",
    "relatedDays": [
      "national-service-dog-day",
      "national-dog-day",
      "white-cane-day"
    ],
    "howToCelebrate": "Learn about guide dog training and organizations. Support guide dog charities. Never distract working guide dogs. Educate others about service dog etiquette. Thank guide dog trainers and puppy raisers. Share guide dog stories on social media.",
    "funFacts": [
      "It costs over $50,000 to train a guide dog",
      "Guide dogs work for about 8 years before retirement",
      "The first guide dog school in the US opened in 1929",
      "Labrador Retrievers and Golden Retrievers are most common breeds",
      "Guide dogs know over 50 commands"
    ]
  },
  {
    "title": "National Chicken Month",
    "slug": "national-chicken-month-september",
    "date": "2025-09-01",
    "category": "Animals & Pets",
    "description": "Celebrate America's favorite protein during National Chicken Month! September honors chickens as both food source and backyard pets. From farm to table to family pet, chickens play an important role in American life and agriculture.",
    "tags": [
      "chickens",
      "poultry",
      "September",
      "farming",
      "agriculture",
      "backyard",
      "pets"
    ],
    "image": "backyard-chickens-coop.jpg",
    "relatedDays": [
      "national-agriculture-day",
      "national-farmers-day",
      "national-pet-day"
    ],
    "howToCelebrate": "Visit a local farm or petting zoo. Learn about chicken breeds and care. Consider raising backyard chickens (if permitted). Support local farmers. Try new chicken recipes. Learn about sustainable farming practices.",
    "funFacts": [
      "Americans consume over 95 pounds of chicken per person annually",
      "There are more chickens than people in the world",
      "Chickens were domesticated over 8,000 years ago",
      "Backyard chicken keeping is growing in popularity in American cities",
      "Chickens are highly social and intelligent birds"
    ]
  },
  {
    "title": "National Mutt Day",
    "slug": "national-mutt-day-mixed-breed",
    "date": "2025-07-31",
    "category": "Animals & Pets",
    "description": "Celebrate mixed breed dogs on National Mutt Day! This day promotes adoption of mutts from shelters and celebrates the unique qualities of mixed breed dogs. Mutts make wonderful, often healthier pets and deserve loving homes just like purebreds.",
    "tags": [
      "mutts",
      "dogs",
      "July",
      "adoption",
      "mixed-breed",
      "rescue",
      "pets"
    ],
    "image": "happy-mutt-dog.jpg",
    "relatedDays": [
      "national-dog-day",
      "national-pet-adoption-day",
      "national-puppy-day"
    ],
    "howToCelebrate": "Adopt a mutt from a shelter. Share your mutt's story on social media. Donate to animal rescues. Volunteer at shelters. Celebrate your mutt with special treats. Support adoption campaigns and events.",
    "funFacts": [
      "About 75% of dogs in shelters are mutts",
      "Mixed breed dogs often have fewer genetic health problems",
      "Mutts come in endless unique combinations",
      "Many famous movie dogs were mutts",
      "Mutts often live longer than purebred dogs"
    ]
  },
  {
    "title": "National Wildlife Rehabilitation Day",
    "slug": "national-wildlife-rehabilitation-day-rescue",
    "date": "2025-03-15",
    "category": "Animals & Pets",
    "description": "Honor the heroes who rescue and rehabilitate injured wildlife on National Wildlife Rehabilitation Day! Wildlife rehabilitators across America care for thousands of sick, injured, and orphaned wild animals each year, giving them a second chance at life.",
    "tags": [
      "wildlife",
      "rehabilitation",
      "March",
      "rescue",
      "conservation",
      "animals",
      "care"
    ],
    "image": "wildlife-rehabilitation-care.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "world-animal-day",
      "earth-day"
    ],
    "howToCelebrate": "Support local wildlife rehabilitation centers. Volunteer or donate to wildlife rescues. Learn when and how to help injured wildlife. Never approach or handle wild animals - call professionals. Share wildlife rehabilitation stories on social media.",
    "funFacts": [
      "Over 5,000 licensed wildlife rehabilitators work in the US",
      "Most wildlife rehabilitation is done by volunteers",
      "Rehabilitators must be licensed and specially trained",
      "The goal is always to release animals back to the wild",
      "Many rehabilitators specialize in specific species"
    ]
  },
  {
    "title": "National K9 Veterans Day",
    "slug": "national-k9-veterans-day-military",
    "date": "2025-03-13",
    "category": "Animals & Pets",
    "description": "Honor military working dogs on National K9 Veterans Day! March 13th commemorates the date the Army K9 Corps was established in 1942. These brave dogs serve alongside American troops, saving countless lives through detection, patrol, and protection work.",
    "tags": [
      "k9",
      "military-dogs",
      "March",
      "veterans",
      "working-dogs",
      "service",
      "heroes"
    ],
    "image": "military-k9-working-dog.jpg",
    "relatedDays": [
      "veterans-day",
      "memorial-day",
      "national-dog-day"
    ],
    "howToCelebrate": "Learn about military working dogs and their handlers. Support organizations that help retired military dogs. Thank K9 veterans and their handlers. Donate to K9 veteran care programs. Visit military dog memorials. Share K9 hero stories on social media.",
    "funFacts": [
      "Over 1,600 military working dogs currently serve in the US military",
      "Dogs can detect explosives and drugs better than any technology",
      "German Shepherds and Belgian Malinois are most common military breeds",
      "Handlers and their dogs form incredibly strong bonds",
      "Retired military dogs can be adopted by their handlers or qualified civilians"
    ]
  },
  {
    "title": "National Kitten Day",
    "slug": "national-kitten-day-adorable",
    "date": "2025-07-10",
    "category": "Animals & Pets",
    "description": "Squee over kittens on National Kitten Day! These tiny furballs need homes. Shelters are overwhelmed during kitten season. This day promotes adoption and spaying/neutering to reduce overpopulation.",
    "tags": [
      "kittens",
      "cats",
      "July",
      "adoption",
      "cute",
      "pets",
      "awareness"
    ],
    "image": "national-kitten-day-cute.jpg",
    "relatedDays": [
      "national-cat-day",
      "adopt-a-shelter-cat-month",
      "national-pet-day"
    ],
    "howToCelebrate": "Adopt a kitten. Foster kittens. Donate to cat rescues. Share kitten photos. Spay/neuter your cats. Volunteer at shelters.",
    "funFacts": [
      "3.2 million cats enter shelters yearly",
      "Kitten season is spring and summer",
      "Kittens need special nutrition and care",
      "Most adorable phase is 6-12 weeks",
      "Spay/neuter prevents overpopulation"
    ]
  },
  {
    "title": "National Guinea Pig Appreciation Day",
    "slug": "national-guinea-pig-appreciation-day",
    "date": "2025-07-16",
    "category": "Animals & Pets",
    "description": "Wheek on Guinea Pig Appreciation Day! These adorable cavies make wonderful pets. They're social, vocal, and full of personality. Learn about proper guinea pig care and adoption.",
    "tags": [
      "guinea-pigs",
      "cavies",
      "July",
      "small-pets",
      "adoption",
      "care",
      "pets"
    ],
    "image": "guinea-pig-appreciation-day.jpg",
    "relatedDays": [
      "pocket-pet-day",
      "national-hamster-day",
      "national-pet-day"
    ],
    "howToCelebrate": "Spoil your guinea pig. Share guinea pig photos. Adopt guinea pigs. Learn proper care. Support guinea pig rescues. Appreciate these vocal pets.",
    "funFacts": [
      "Guinea pigs are social and need companions",
      "They 'wheek' when excited",
      "Guinea pigs need vitamin C daily",
      "They live 5-7 years",
      "Guinea pigs popcorn when happy"
    ]
  },
  {
    "title": "National Hamster Day",
    "slug": "national-hamster-day-small-pets",
    "date": "2025-04-12",
    "category": "Animals & Pets",
    "description": "Appreciate hamsters on their special day! These pocket-sized pets are popular with kids and adults. Learn about different hamster breeds and proper care for these nocturnal cuties.",
    "tags": [
      "hamsters",
      "small-pets",
      "April",
      "pets",
      "care",
      "rodents",
      "pocket-pets"
    ],
    "image": "national-hamster-day-cute.jpg",
    "relatedDays": [
      "pocket-pet-day",
      "guinea-pig-day",
      "national-pet-day"
    ],
    "howToCelebrate": "Give your hamster treats. Upgrade their habitat. Share hamster photos. Learn about hamster care. Support small animal rescues. Appreciate tiny pets.",
    "funFacts": [
      "Syrian hamsters are most popular",
      "Hamsters are nocturnal",
      "They store food in cheek pouches",
      "Hamsters live 2-3 years",
      "Dwarf hamsters stay smaller"
    ]
  },
  {
    "title": "National Reptile Awareness Day",
    "slug": "national-reptile-awareness-day-lizards",
    "date": "2025-10-21",
    "category": "Animals & Pets",
    "description": "Go cold-blooded on Reptile Awareness Day! Reptiles make fascinating pets but require specific care. From bearded dragons to ball pythons, learn about responsible reptile ownership.",
    "tags": [
      "reptiles",
      "lizards",
      "October",
      "exotic-pets",
      "snakes",
      "care",
      "education"
    ],
    "image": "reptile-awareness-day.jpg",
    "relatedDays": [
      "world-turtle-day",
      "snake-day",
      "exotic-pet-day"
    ],
    "howToCelebrate": "Visit reptile expos. Learn reptile care. Appreciate pet reptiles. Support reptile rescues. Educate about responsible ownership. Share reptile facts.",
    "funFacts": [
      "Over 4.5 million US households have reptiles",
      "Bearded dragons are most popular",
      "Reptiles need UVB lighting and heat",
      "Ball pythons live 20-30 years",
      "Proper care requires research and commitment"
    ]
  },
  {
    "title": "National Aquarium Day",
    "slug": "national-aquarium-day-fish-tanks",
    "date": "2025-06-14",
    "category": "Animals & Pets",
    "description": "Dive in on National Aquarium Day! Visit public aquariums or appreciate your home fish tank. Aquariums educate about marine life and inspire ocean conservation efforts worldwide.",
    "tags": [
      "aquariums",
      "fish",
      "June",
      "marine-life",
      "pets",
      "conservation",
      "education"
    ],
    "image": "national-aquarium-day.jpg",
    "relatedDays": [
      "world-ocean-day",
      "national-fish-day",
      "marine-conservation-day"
    ],
    "howToCelebrate": "Visit public aquariums. Care for aquarium fish. Learn about marine conservation. Support ocean protection. Share aquarium experiences. Appreciate aquatic life.",
    "funFacts": [
      "12.5 million US households have aquarium fish",
      "Fish keeping reduces stress",
      "Some aquarium fish live 10+ years",
      "Public aquariums educate millions annually",
      "Marine conservation starts with awareness"
    ]
  },
  {
    "title": "National Parakeet Day",
    "slug": "national-parakeet-day-budgies",
    "date": "2025-06-05",
    "category": "Animals & Pets",
    "description": "Tweet on Parakeet Day! Budgies are the most popular pet bird in America. These colorful, social birds can learn to talk and do tricks. Celebrate these feathered companions!",
    "tags": [
      "parakeets",
      "budgies",
      "June",
      "birds",
      "pets",
      "talking-birds",
      "care"
    ],
    "image": "national-parakeet-day.jpg",
    "relatedDays": [
      "bird-day",
      "parrot-day",
      "national-pet-day"
    ],
    "howToCelebrate": "Spoil your parakeet. Teach new tricks. Share parakeet videos. Learn bird care. Support avian rescues. Appreciate pet birds.",
    "funFacts": [
      "Parakeets can learn 100+ words",
      "They're the most popular pet bird",
      "Parakeets are highly social",
      "They can live 10-15 years",
      "Budgies need mental stimulation"
    ]
  },
  {
    "title": "National Parrot Day",
    "slug": "national-parrot-day-tropical-birds",
    "date": "2025-05-31",
    "category": "Animals & Pets",
    "description": "Squawk on National Parrot Day! These intelligent, colorful birds make amazing (but demanding) pets. This day raises awareness about parrot conservation and proper care for captive parrots.",
    "tags": [
      "parrots",
      "birds",
      "May",
      "exotic-pets",
      "conservation",
      "intelligent-pets",
      "tropical"
    ],
    "image": "national-parrot-day.jpg",
    "relatedDays": [
      "bird-day",
      "endangered-species-day",
      "national-pet-day"
    ],
    "howToCelebrate": "Appreciate parrots. Support parrot conservation. Learn parrot care. Visit parrot sanctuaries. Adopt don't buy. Share parrot education.",
    "funFacts": [
      "Many parrot species are endangered",
      "Parrots can live 50+ years",
      "African Greys have toddler-level intelligence",
      "Parrots bond strongly with owners",
      "Wild parrots need protection"
    ]
  },
  {
    "title": "National Alpaca Day",
    "slug": "national-alpaca-day-fiber-animals",
    "date": "2025-09-27",
    "category": "Animals & Pets",
    "description": "Visit alpacas on National Alpaca Day! These gentle fiber animals are gaining popularity in the US. Alpaca farms across America open for tours, showcasing these adorable camelids.",
    "tags": [
      "alpacas",
      "farm-animals",
      "September",
      "fiber",
      "gentle",
      "agricultural",
      "cute"
    ],
    "image": "national-alpaca-day.jpg",
    "relatedDays": [
      "llama-day",
      "farm-animals-day",
      "fiber-arts-day"
    ],
    "howToCelebrate": "Visit alpaca farms. Learn about alpacas. Buy alpaca products. Support alpaca farming. Appreciate these gentle animals. Take alpaca selfies.",
    "funFacts": [
      "Over 250,000 alpacas in North America",
      "Alpaca fiber is hypoallergenic",
      "They hum to communicate",
      "Alpacas are gentle and curious",
      "Alpaca farming is growing in popularity"
    ]
  },
  {
    "title": "National Llama Day",
    "slug": "national-llama-day-pack-animals",
    "date": "2025-12-09",
    "category": "Animals & Pets",
    "description": "Llove llamas on National Llama Day! These charismatic pack animals are larger cousins to alpacas. Llamas are used for packing, guarding, and therapy. Plus, they're hilariously photogenic!",
    "tags": [
      "llamas",
      "farm-animals",
      "December",
      "pack-animals",
      "quirky",
      "agricultural",
      "therapy"
    ],
    "image": "national-llama-day.jpg",
    "relatedDays": [
      "alpaca-day",
      "farm-animals-day",
      "therapy-animal-day"
    ],
    "howToCelebrate": "Visit llama farms. Go llama trekking. Learn about llamas. Support llama rescue. Enjoy llama memes. Appreciate llama personalities.",
    "funFacts": [
      "Llamas are excellent pack animals",
      "They guard sheep and other livestock",
      "Llamas can carry 25-30% of body weight",
      "They're used in therapy programs",
      "Llamas have quirky personalities"
    ]
  },
  {
    "title": "National Pygmy Goat Day",
    "slug": "national-pygmy-goat-day-miniature",
    "date": "2025-08-20",
    "category": "Animals & Pets",
    "description": "Go mini on Pygmy Goat Day! These pint-sized goats make entertaining pets. They're playful, social, and full of personality. Perfect for small farms and increasingly popular as pets.",
    "tags": [
      "pygmy-goats",
      "miniature",
      "August",
      "farm-animals",
      "pets",
      "playful",
      "cute"
    ],
    "image": "pygmy-goat-day.jpg",
    "relatedDays": [
      "farm-animals-day",
      "goat-yoga-day",
      "miniature-animals-day"
    ],
    "howToCelebrate": "Visit pygmy goats. Learn about goat care. Try goat yoga. Support goat rescues. Appreciate tiny goats. Share goat videos.",
    "funFacts": [
      "Pygmy goats grow to 16-23 inches tall",
      "They're incredibly playful and social",
      "Goat yoga is a real trend",
      "Pygmies are excellent escape artists",
      "They make great pets with proper care"
    ]
  },
  {
    "title": "National Miniature Horse Day",
    "slug": "national-miniature-horse-day-tiny",
    "date": "2025-09-15",
    "category": "Animals & Pets",
    "description": "Think small on Miniature Horse Day! These tiny horses stand under 34 inches tall. They're used as service animals, therapy horses, and beloved pets. They're horses, just pocket-sized!",
    "tags": [
      "miniature-horses",
      "horses",
      "September",
      "service-animals",
      "therapy",
      "pets",
      "tiny"
    ],
    "image": "miniature-horse-day.jpg",
    "relatedDays": [
      "national-horse-day",
      "service-animal-day",
      "therapy-animal-day"
    ],
    "howToCelebrate": "Visit miniature horse farms. Learn about mini horses. Support mini horse rescues. Appreciate these tiny equines. Share mini horse cuteness.",
    "funFacts": [
      "Some miniature horses work as service animals",
      "They can live 25-35 years",
      "Miniatures have all the strength of full-sized horses",
      "They're proportionate horses, not ponies",
      "Guide horse programs exist for the blind"
    ]
  },
  {
    "title": "National Donkey Day",
    "slug": "national-donkey-day-burros",
    "date": "2025-05-08",
    "category": "Animals & Pets",
    "description": "Hee-haw for donkeys on National Donkey Day! These intelligent, loyal animals deserve appreciation. Donkeys are used worldwide for work, companionship, and therapy. They're underrated amazing animals!",
    "tags": [
      "donkeys",
      "burros",
      "May",
      "farm-animals",
      "working-animals",
      "therapy",
      "appreciation"
    ],
    "image": "national-donkey-day.jpg",
    "relatedDays": [
      "mule-day",
      "farm-animals-day",
      "working-animal-day"
    ],
    "howToCelebrate": "Visit donkey sanctuaries. Learn about donkeys. Support donkey rescue. Appreciate working donkeys. Share donkey facts. Celebrate donkey intelligence.",
    "funFacts": [
      "Donkeys are incredibly intelligent",
      "They have excellent memories",
      "Donkeys guard livestock from predators",
      "They can live 25-30 years",
      "Donkeys are affectionate and loyal"
    ]
  },
  {
    "title": "National Barn Cat Day",
    "slug": "national-barn-cat-day-working-cats",
    "date": "2025-06-15",
    "category": "Animals & Pets",
    "description": "Appreciate working cats on Barn Cat Day! These feline mousers protect farms and barns from rodents. Barn cat adoption programs place cats who need outdoor homes with farms that need mousers.",
    "tags": [
      "barn-cats",
      "working-cats",
      "June",
      "farm-animals",
      "mousers",
      "adoption",
      "cats"
    ],
    "image": "barn-cat-day.jpg",
    "relatedDays": [
      "national-cat-day",
      "farm-animals-day",
      "working-animal-day"
    ],
    "howToCelebrate": "Adopt barn cats. Support barn cat programs. Care for working cats. Learn about barn cats. Appreciate feline mousers. Share barn cat stories.",
    "funFacts": [
      "Barn cats control rodent populations naturally",
      "They're often feral or semi-feral",
      "Barn cat programs match cats with farms",
      "They save farms money on pest control",
      "Proper care includes food, water, and shelter"
    ]
  },
  {
    "title": "National Therapy Animal Day",
    "slug": "national-therapy-animal-day-service",
    "date": "2025-04-30",
    "category": "Animals & Pets",
    "description": "Celebrate healing animals on Therapy Animal Day! Therapy animals provide comfort in hospitals, schools, and nursing homes. From dogs to miniature horses, these animals make incredible differences in lives.",
    "tags": [
      "therapy-animals",
      "service",
      "April",
      "healing",
      "comfort",
      "healthcare",
      "animals"
    ],
    "image": "therapy-animal-day.jpg",
    "relatedDays": [
      "service-dog-day",
      "national-pet-day",
      "animal-therapy-awareness"
    ],
    "howToCelebrate": "Thank therapy animal teams. Learn about animal therapy. Support therapy animal organizations. Appreciate healing power of animals. Share therapy animal stories.",
    "funFacts": [
      "Therapy animals reduce stress and anxiety",
      "Dogs are most common, but many species work as therapy animals",
      "Hospitals, schools, and nursing homes use therapy animals",
      "Animals must be certified for therapy work",
      "Research proves animal therapy benefits"
    ]
  },
  {
    "title": "National Foster a Pet Month",
    "slug": "national-foster-a-pet-month-june",
    "date": "2025-06-01",
    "category": "Animals & Pets",
    "description": "Foster saves lives during National Foster a Pet Month! Shelters need foster homes for puppies, kittens, sick, and shy animals. Fostering opens shelter space and gives animals loving temporary homes.",
    "tags": [
      "fostering",
      "rescue",
      "June",
      "shelter-pets",
      "adoption",
      "volunteer",
      "animals"
    ],
    "image": "foster-a-pet-month.jpg",
    "relatedDays": [
      "adopt-a-shelter-pet-day",
      "clear-the-shelters",
      "national-pet-day"
    ],
    "howToCelebrate": "Foster pets from shelters. Learn about fostering. Donate foster supplies. Share foster stories. Support rescue organizations. Consider adopting your foster!",
    "funFacts": [
      "Fostering saves lives by opening shelter space",
      "Foster families teach animals how to live in homes",
      "Kitten and puppy season overwhelms shelters",
      "Most rescues desperately need fosters",
      "Many people 'foster fail' and adopt their foster pets"
    ]
  },
  {
    "title": "National Black Cat Appreciation Day",
    "slug": "national-black-cat-appreciation-day-adoption",
    "date": "2025-08-17",
    "category": "Animals & Pets",
    "description": "Love black cats on Black Cat Appreciation Day! Black cats are often overlooked in shelters due to superstitions. These beautiful felines need extra adoption promotion and love.",
    "tags": [
      "black-cats",
      "cats",
      "August",
      "adoption",
      "superstitions",
      "shelter-cats",
      "awareness"
    ],
    "image": "black-cat-appreciation-day.jpg",
    "relatedDays": [
      "national-cat-day",
      "adopt-a-shelter-cat-month",
      "halloween"
    ],
    "howToCelebrate": "Adopt a black cat. Share black cat photos. Debunk black cat superstitions. Support black cat rescues. Celebrate black cat beauty. Fight adoption bias.",
    "funFacts": [
      "Black cats have lower adoption rates",
      "Superstitions hurt black cat adoption",
      "Black cats are just as loving as other cats",
      "Many shelters promote black cat adoptions",
      "Black cats are beautiful and photogenic"
    ]
  },
  {
    "title": "National Senior Pet Day",
    "slug": "national-senior-pet-day-older-animals",
    "date": "2025-11-11",
    "category": "Animals & Pets",
    "description": "Appreciate older pets on Senior Pet Day! Senior animals often wait longest in shelters. These calm, grateful companions make wonderful pets and deserve loving retirement homes.",
    "tags": [
      "senior-pets",
      "older-animals",
      "November",
      "adoption",
      "rescue",
      "geriatric-pets",
      "appreciation"
    ],
    "image": "national-senior-pet-day-older-animals-optimized.webp",
    "relatedDays": [
      "adopt-a-shelter-pet-day",
      "national-pet-day",
      "grey-muzzle-day"
    ],
    "howToCelebrate": "Adopt a senior pet. Care for aging pets. Support senior pet programs. Share senior pet benefits. Donate to senior animal care. Appreciate old friends.",
    "funFacts": [
      "Senior pets are often housetrained and calm",
      "They make grateful, loving companions",
      "Senior pets are overlooked in shelters",
      "Many have years of love left to give",
      "Adopting seniors saves lives"
    ]
  },
  {
    "title": "National Pet Obesity Awareness Day",
    "slug": "national-pet-obesity-awareness-day-health",
    "date": "2025-10-08",
    "category": "Animals & Pets",
    "description": "Fight fat pets on Pet Obesity Awareness Day! Over 50% of American pets are overweight. Obesity causes health problems and shortens pet lives. This day promotes healthy pet weight.",
    "tags": [
      "pet-obesity",
      "pet-health",
      "October",
      "awareness",
      "nutrition",
      "exercise",
      "wellness"
    ],
    "image": "pet-obesity-awareness-day.jpg",
    "relatedDays": [
      "national-pet-day",
      "veterinary-day",
      "pet-wellness-month"
    ],
    "howToCelebrate": "Check your pet's weight. Consult your vet about healthy weight. Increase pet exercise. Measure food portions. Cut back on treats. Share pet health tips.",
    "funFacts": [
      "Over 50% of US pets are overweight",
      "Obesity causes diabetes, arthritis, and other issues",
      "Most owners don't realize their pet is overweight",
      "Proper portions and exercise prevent obesity",
      "Healthy weight extends pet lifespan"
    ]
  },
  {
    "title": "National Squirrel Appreciation Day",
    "slug": "national-squirrel-appreciation-day-wildlife",
    "date": "2025-01-21",
    "category": "Animals & Pets",
    "description": "Go nuts for squirrels! January 21st celebrates these bushy-tailed backyard acrobats. Squirrels play important roles in forest ecosystems by planting trees - they forget where they bury many acorns!",
    "tags": [
      "squirrel",
      "wildlife",
      "January",
      "backyard",
      "nature",
      "cute",
      "appreciation"
    ],
    "image": "squirrel-backyard.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "backyard-bird-count",
      "nature-appreciation"
    ],
    "howToCelebrate": "Put out nuts for squirrels (unsalted!). Watch squirrel antics in your yard. Learn about different squirrel species. Share squirrel photos. Plant oak trees for future squirrel generations.",
    "funFacts": [
      "Squirrels plant thousands of trees by forgetting where they buried nuts",
      "They can fall from any height without getting hurt",
      "Squirrels can rotate their ankles 180 degrees",
      "Baby squirrels are called kittens or pups",
      "There are over 200 species of squirrels worldwide"
    ]
  },
  {
    "title": "National Horse Protection Day",
    "slug": "national-horse-protection-day-equine",
    "date": "2025-03-01",
    "category": "Animals & Pets",
    "description": "Protect America's horses! This day raises awareness about horse welfare, rescue, and protection. Support efforts to end horse abuse and promote responsible horse ownership and care.",
    "tags": [
      "horses",
      "equine",
      "March",
      "protection",
      "welfare",
      "rescue",
      "advocacy"
    ],
    "image": "horse-protection-rescue.jpg",
    "relatedDays": [
      "national-horse-day",
      "equine-therapy-day",
      "animal-welfare-week"
    ],
    "howToCelebrate": "Support horse rescue organizations. Learn about horse welfare issues. Volunteer at equine sanctuaries. Advocate for horse protection laws. Share horse rescue stories.",
    "funFacts": [
      "Thousands of horses are abandoned or abused annually in the US",
      "Horse rescues save and rehabilitate neglected horses",
      "Horses are highly intelligent and emotional animals",
      "The Wild Free-Roaming Horses Act protects wild mustangs",
      "Therapy horses help people with physical and emotional challenges"
    ]
  },
  {
    "title": "National Wildlife Refuges Day",
    "slug": "national-wildlife-refuges-day-conservation",
    "date": "2025-10-10",
    "category": "Animals & Pets",
    "description": "Explore America's wildlife refuges! This day celebrates the National Wildlife Refuge System protecting animals and habitats across the US. Visit refuges, spot wildlife, and support conservation of these vital ecosystems.",
    "tags": [
      "wildlife",
      "refuges",
      "October",
      "conservation",
      "nature",
      "habitats",
      "protection"
    ],
    "image": "wildlife-refuge-nature.jpg",
    "relatedDays": [
      "national-wildlife-day",
      "migratory-bird-day",
      "conservation-week"
    ],
    "howToCelebrate": "Visit a local wildlife refuge. Go birdwatching or wildlife viewing. Learn about refuge conservation programs. Volunteer at refuges. Support wildlife refuge funding.",
    "funFacts": [
      "The US has over 560 national wildlife refuges",
      "Refuges protect over 850 million acres",
      "Over 700 species of birds use refuges",
      "Refuges welcome over 50 million visitors annually",
      "Theodore Roosevelt created the first refuge in 1903"
    ]
  },
  {
    "title": "National Dress Up Your Pet Day",
    "slug": "national-dress-up-your-pet-day-fun-costumes",
    "date": "2025-01-14",
    "category": "Animals & Pets",
    "description": "Make your pet a fashion icon! Dress Up Your Pet Day is all about safe, fun pet costumes. From Halloween holdovers to special outfits, share photos of your fashionable furry friends (as long as they're comfortable!).",
    "tags": [
      "pets",
      "costumes",
      "January",
      "fun",
      "dogs",
      "cats",
      "photos"
    ],
    "image": "pet-costumes-dress-up.jpg",
    "relatedDays": [
      "halloween",
      "pet-photography-day",
      "national-pet-day"
    ],
    "howToCelebrate": "Dress your pet in a safe, comfortable costume. Take adorable photos. Share on social media. Make sure your pet is happy and comfortable. Try DIY pet costumes.",
    "funFacts": [
      "The pet costume industry is worth billions",
      "Halloween is the biggest pet costume occasion",
      "Always ensure costumes don't restrict movement or breathing",
      "Some pets love dressing up, others don't - respect their preferences",
      "Pet fashion shows are held nationwide"
    ]
  },
  {
    "title": "National Answer Your Cat's Questions Day",
    "slug": "national-answer-your-cats-questions-day-funny",
    "date": "2025-01-22",
    "category": "Animals & Pets",
    "description": "What's your cat thinking? This whimsical day imagines answering all those curious cat questions. Why can't I eat your food? Why do you leave every day? Have fun interpreting feline behavior and strengthening your cat bond!",
    "tags": [
      "cats",
      "humor",
      "January",
      "fun",
      "pets",
      "behavior",
      "quirky"
    ],
    "image": "cat-curious-questions.jpg",
    "relatedDays": [
      "national-cat-day",
      "answer-your-pets-questions",
      "cat-behavior-day"
    ],
    "howToCelebrate": "Imagine what your cat wants to know. Respond to their meows and looks. Spend quality time with your cat. Learn about cat body language. Share funny cat question scenarios online.",
    "funFacts": [
      "Cats vocalize primarily to communicate with humans",
      "Each cat has a unique meow vocabulary",
      "Slow blinking means 'I love you' in cat language",
      "Cats spend 70% of their lives sleeping",
      "They probably do wonder why we shower instead of licking ourselves"
    ]
  },
  {
    "title": "National Miniature Donkey Day",
    "slug": "national-miniature-donkey-day-cute",
    "date": "2025-05-02",
    "category": "Animals & Pets",
    "description": "Small and adorable! National Miniature Donkey Day celebrates these pint-sized equines. Standing under 36 inches tall, mini donkeys are gentle, intelligent, and make wonderful therapy animals and companions.",
    "tags": [
      "donkey",
      "miniature",
      "May",
      "cute",
      "farm-animals",
      "therapy",
      "equine"
    ],
    "image": "miniature-donkey-cute.jpg",
    "relatedDays": [
      "national-donkey-day",
      "farm-animal-day",
      "therapy-animal-awareness"
    ],
    "howToCelebrate": "Visit a farm with miniature donkeys. Learn about their care and needs. Support donkey rescue organizations. Share cute mini donkey photos. Consider mini donkeys as therapy or farm animals.",
    "funFacts": [
      "Mini donkeys originated from Mediterranean islands",
      "They're typically 32-36 inches tall",
      "Mini donkeys are very social and bond strongly with owners",
      "They live 25-35 years with proper care",
      "They're used successfully as therapy animals"
    ]
  },
  {
    "title": "National Zoo Lovers Day",
    "slug": "national-zoo-lovers-day-april-8",
    "date": "2025-04-08",
    "category": "Animals & Pets",
    "description": "Visit the zoo! National Zoo Lovers Day celebrates zoos and their role in conservation, education, and animal care. Modern zoos protect endangered species and inspire love for wildlife.",
    "tags": [
      "zoo",
      "conservation",
      "April",
      "wildlife",
      "animals",
      "education",
      "family"
    ],
    "image": "zoo-animals-visit.jpg",
    "relatedDays": [
      "world-wildlife-day",
      "endangered-species-day",
      "conservation-day"
    ],
    "howToCelebrate": "Visit your local zoo. Learn about conservation programs. Support zoo memberships and donations. Take kids to see animals. Learn about endangered species breeding programs.",
    "funFacts": [
      "Accredited zoos contribute to species survival",
      "Many animals in zoos are endangered or extinct in the wild",
      "Zoos spend millions on conservation efforts",
      "Zoo births help preserve genetic diversity",
      "Educational programs reach millions of children annually"
    ]
  },
  {
    "title": "National Service Dog Month",
    "slug": "national-service-dog-month-september",
    "date": "2025-09-01",
    "category": "Animals & Pets",
    "description": "Honor working dogs! September celebrates service dogs who change lives daily. From guide dogs to PTSD support dogs, these highly trained animals provide independence and assistance.",
    "tags": [
      "service-dogs",
      "working-dogs",
      "September",
      "disability",
      "assistance",
      "training",
      "heroes"
    ],
    "image": "service-dog-working.jpg",
    "relatedDays": [
      "guide-dog-day",
      "therapy-dog-day",
      "working-dog-day"
    ],
    "howToCelebrate": "Learn about service dog training and laws. Don't pet working dogs without asking. Support service dog organizations. Share service dog stories. Donate to training programs.",
    "funFacts": [
      "Service dogs perform specific tasks for people with disabilities",
      "Training a service dog costs $20,000-$40,000",
      "They're protected by the Americans with Disabilities Act",
      "Never distract or pet a working service dog",
      "Service dogs dramatically improve quality of life"
    ]
  },
  {
    "title": "National Shelter Dog Month",
    "slug": "national-shelter-dog-month-august",
    "date": "2025-08-01",
    "category": "Animals & Pets",
    "description": "Adopt don't shop! August celebrates shelter dogs waiting for homes. Millions of amazing dogs need loving families. Visit shelters and rescue a best friend!",
    "tags": [
      "shelter-dogs",
      "adoption",
      "August",
      "rescue",
      "dogs",
      "animal-welfare",
      "pets"
    ],
    "image": "shelter-dog-adoption.jpg",
    "relatedDays": [
      "adopt-a-shelter-pet-day",
      "national-dog-day",
      "rescue-dog-day"
    ],
    "howToCelebrate": "Visit local animal shelters. Adopt or foster a dog. Donate supplies or money. Volunteer at shelters. Share adoptable dogs on social media. Spay/neuter your pets.",
    "funFacts": [
      "Over 3 million dogs enter shelters annually",
      "Shelter dogs make wonderful, loving pets",
      "Many shelter dogs are purebreds",
      "Adoption fees are much less than buying from breeders",
      "Rescue dogs seem to know they've been saved"
    ]
  },
  {
    "title": "National Adopt a Rescued Rabbit Month",
    "slug": "national-adopt-rescued-rabbit-month-february",
    "date": "2025-02-01",
    "category": "Animals & Pets",
    "description": "Hop to it! February is Adopt a Rescued Rabbit Month. Thousands of rabbits need homes. Learn about rabbit care and consider adopting these wonderful, intelligent pets.",
    "tags": [
      "rabbits",
      "adoption",
      "February",
      "rescue",
      "pets",
      "bunnies",
      "animal-welfare"
    ],
    "image": "rescued-rabbit-adoption.jpg",
    "relatedDays": [
      "national-rabbit-day",
      "adopt-a-shelter-pet",
      "bunny-day"
    ],
    "howToCelebrate": "Adopt or foster a rabbit. Volunteer at rabbit rescues. Donate supplies. Learn about proper rabbit care. Share adoptable rabbits. Educate about rabbits as pets.",
    "funFacts": [
      "Rabbits are the third most common pet",
      "They can live 8-12 years with proper care",
      "Rabbits are highly intelligent and social",
      "They need companions - pairs are best",
      "Many rabbits are abandoned after Easter"
    ]
  },
  {
    "title": "National Wildlife Federation Week",
    "slug": "national-wildlife-federation-week-nature-conservation",
    "date": "2025-03-16",
    "category": "Animals & Pets",
    "description": "Protect wildlife! This week celebrates the National Wildlife Federation's conservation work. Support wildlife conservation, create backyard habitats, and protect America's natural heritage.",
    "tags": [
      "wildlife",
      "conservation",
      "March",
      "nature",
      "habitats",
      "environment",
      "federation"
    ],
    "image": "wildlife-federation-conservation.jpg",
    "relatedDays": [
      "wildlife-day",
      "conservation-week",
      "nature-day"
    ],
    "howToCelebrate": "Create a backyard wildlife habitat. Support NWF programs. Learn about native wildlife. Plant native plants. Reduce pesticide use. Get your yard certified as a wildlife habitat.",
    "funFacts": [
      "NWF was founded in 1936",
      "They protect wildlife and habitats across America",
      "Backyard habitats provide food, water, and shelter",
      "Native plants support local wildlife",
      "Anyone can create a certified wildlife habitat"
    ]
  },
  {
    "title": "World Snake Day",
    "slug": "world-snake-day-july-16-reptile-awareness",
    "date": "2025-07-16",
    "category": "Animals & Pets",
    "description": "Slither into appreciation! World Snake Day celebrates these misunderstood reptiles. Learn about snake conservation, their ecological importance, and why most snakes are harmless and beneficial.",
    "tags": [
      "snakes",
      "reptiles",
      "July",
      "conservation",
      "wildlife",
      "education",
      "awareness"
    ],
    "image": "snake-awareness.jpg",
    "relatedDays": [
      "reptile-awareness",
      "wildlife-day",
      "conservation-day"
    ],
    "howToCelebrate": "Learn about local snake species. Visit reptile exhibits. Support snake conservation. Educate about snake myths. Appreciate their role in ecosystems. Never kill snakes unnecessarily.",
    "funFacts": [
      "Most snakes are harmless to humans",
      "Snakes control rodent populations naturally",
      "They're found on every continent except Antarctica",
      "Snake venom has medical applications",
      "Many snake species are threatened by habitat loss"
    ]
  }
]