[
  {
    "title": "World Heart Day",
    "slug": "world-heart-day",
    "date": "2026-09-29",
    "category": "Awareness",
    "description": "Take a moment to care for your heart on World Heart Day! This global awareness day focuses on cardiovascular health, encouraging people worldwide to make heart-healthy choices. Learn about prevention strategies, discover heart-healthy recipes, and join the movement to reduce cardiovascular disease through education, exercise, and lifestyle changes that can save lives.",
    "tags": [
      "health",
      "heart",
      "awareness",
      "September",
      "wellness",
      "prevention",
      "medical"
    ],
    "image": "heart-health-awareness.jpg",
    "relatedDays": [
      "national-cardiac-rehabilitation-week",
      "american-heart-month",
      "world-health-day"
    ],
    "howToCelebrate": "Schedule a health checkup or blood pressure screening. Take a 30-minute walk or engage in heart-pumping exercise. Cook a heart-healthy meal with lean proteins, vegetables, and whole grains. Learn CPR and basic life support techniques. Share heart health tips on social media to educate others. Donate to heart disease research organizations or volunteer at local health events.",
    "funFacts": [
      "Heart disease is the leading cause of death worldwide, claiming 17.9 million lives annually",
      "Your heart beats about 100,000 times per day, pumping 2,000 gallons of blood",
      "The heart has its own electrical system and can continue beating even when separated from the brain",
      "Regular exercise can reduce your risk of heart disease by up to 30%",
      "Laughing is actually good for your heart - it improves blood flow and reduces stress hormones"
    ]
  },
  {
    "title": "World Teachers' Day",
    "slug": "world-teachers-day",
    "date": "2026-10-05",
    "category": "Awareness",
    "description": "Honor the educators who shape our future on World Teachers' Day! This global celebration recognizes the invaluable contributions of teachers worldwide who dedicate their lives to educating, inspiring, and nurturing the next generation. Learn about the challenges teachers face, discover ways to support education, and take a moment to thank the teachers who made a difference in your life.",
    "tags": [
      "teachers",
      "education",
      "October",
      "appreciation",
      "learning",
      "school",
      "inspiration"
    ],
    "image": "teachers-in-classroom.jpg",
    "relatedDays": [
      "national-teacher-appreciation-week",
      "back-to-school-month",
      "world-book-day"
    ],
    "howToCelebrate": "Write a heartfelt thank-you note to a teacher who made a difference in your life. Share your appreciation on social media using #WorldTeachersDay. Donate school supplies to local classrooms or education charities. Volunteer to help with school activities or tutoring programs. Support teachers by advocating for better education funding and resources in your community.",
    "funFacts": [
      "Teachers work an average of 50 hours per week, often unpaid overtime",
      "A single teacher can impact over 3,000 students throughout their career",
      "Teachers spend an average of $500-1,000 of their own money on classroom supplies annually",
      "The first teacher training college was established in France in 1685",
      "Teachers make more decisions per hour than brain surgeons"
    ]
  },
  {
    "title": "National Mammography Day",
    "slug": "national-mammography-day",
    "date": "2026-10-17",
    "category": "Awareness",
    "description": "Take charge of your breast health on National Mammography Day! This important awareness day encourages women to schedule their annual mammograms and learn about early detection of breast cancer. Join the conversation about breast health, support those affected by breast cancer, and help spread awareness about the importance of regular screenings and self-examinations.",
    "tags": [
      "mammography",
      "breast-health",
      "October",
      "awareness",
      "cancer",
      "screening",
      "women"
    ],
    "image": "breast-health-awareness.jpg",
    "relatedDays": [
      "breast-cancer-awareness-month",
      "national-women-health-day",
      "world-cancer-day"
    ],
    "howToCelebrate": "Schedule your annual mammogram if you're due for one. Encourage the women in your life to prioritize their breast health screenings. Share educational information about breast cancer prevention and early detection on social media. Wear pink or a pink ribbon to show support for breast cancer awareness. Donate to breast cancer research organizations or volunteer at local health events.",
    "funFacts": [
      "Mammograms can detect breast cancer up to 3 years before it can be felt",
      "Women should start getting mammograms at age 40, or earlier if they have a family history",
      "Digital mammography is more accurate than traditional film mammography",
      "Breast cancer is the second most common cancer in women worldwide",
      "Early detection through mammography increases survival rates by 99%"
    ]
  },
  {
    "title": "World Health Day",
    "slug": "world-health-day",
    "date": "2026-04-07",
    "category": "Awareness",
    "description": "Prioritize your health and well-being on World Health Day! This global awareness day focuses on promoting healthy lifestyles, preventing diseases, and ensuring access to healthcare for all. Learn about current health challenges, discover ways to improve your physical and mental health, and join the global conversation about creating healthier communities worldwide.",
    "tags": [
      "health",
      "wellness",
      "April",
      "awareness",
      "prevention",
      "medical",
      "global"
    ],
    "image": "health-wellness-awareness.jpg",
    "relatedDays": [
      "national-nutrition-month",
      "mental-health-awareness-month",
      "world-heart-day"
    ],
    "howToCelebrate": "Schedule a health checkup or annual physical exam. Start a new healthy habit like regular exercise or better nutrition. Learn about a health condition you're not familiar with to increase awareness. Donate to health organizations or volunteer at local health events. Share health tips and resources on social media to help others prioritize their well-being.",
    "funFacts": [
      "World Health Day was established by the World Health Organization in 1950",
      "Each year focuses on a different health theme or priority area",
      "The WHO estimates that 80% of premature heart disease and stroke is preventable",
      "Regular physical activity can reduce the risk of chronic diseases by 30%",
      "Mental health conditions affect 1 in 4 people worldwide"
    ]
  },
  {
    "title": "National Stress Awareness Day",
    "slug": "national-stress-awareness-day",
    "date": "2026-04-16",
    "category": "Awareness",
    "description": "Take a deep breath and focus on your mental well-being on National Stress Awareness Day! This important awareness day highlights the impact of stress on our health and provides resources for stress management. Learn healthy coping strategies, practice relaxation techniques, and join the conversation about mental health and stress reduction in our fast-paced world.",
    "tags": [
      "stress",
      "mental-health",
      "April",
      "awareness",
      "wellness",
      "relaxation",
      "self-care"
    ],
    "image": "stress-relief-activities.jpg",
    "relatedDays": [
      "mental-health-awareness-month",
      "national-meditation-day",
      "world-mental-health-day"
    ],
    "howToCelebrate": "Practice stress-relief techniques like meditation, deep breathing, or yoga. Take a break from technology and spend time in nature. Engage in activities that bring you joy and relaxation. Learn about stress management techniques and share them with others. Support mental health organizations and advocate for better mental health resources in your community.",
    "funFacts": [
      "Chronic stress can lead to serious health problems including heart disease and depression",
      "Stress affects 77% of people regularly",
      "Exercise is one of the most effective ways to reduce stress",
      "Laughter can reduce stress hormones and boost immune function",
      "The American Institute of Stress was founded in 1978 to study stress"
    ]
  },
  {
    "title": "National Meditation Day",
    "slug": "national-meditation-day",
    "date": "2026-05-21",
    "category": "Awareness",
    "description": "Find your inner peace and celebrate mindfulness on National Meditation Day! This special day encourages people to explore the benefits of meditation for mental clarity, stress reduction, and overall well-being. Whether you're new to meditation or a seasoned practitioner, take time to quiet your mind and connect with your inner self.",
    "tags": [
      "meditation",
      "mindfulness",
      "May",
      "wellness",
      "mental-health",
      "peace",
      "relaxation"
    ],
    "image": "peaceful-meditation-scene.jpg",
    "relatedDays": [
      "national-stress-awareness-day",
      "mental-health-awareness-month",
      "national-yoga-day"
    ],
    "howToCelebrate": "Try a meditation session using apps, guided videos, or classes. Practice different meditation techniques like mindfulness, breathing exercises, or walking meditation. Create a peaceful meditation space in your home. Learn about the science behind meditation's benefits. Share meditation tips and experiences on social media.",
    "funFacts": [
      "Meditation has been practiced for over 5,000 years",
      "Just 10 minutes of meditation daily can improve focus and reduce stress",
      "Meditation can increase gray matter in the brain",
      "Regular meditation can lower blood pressure and heart rate",
      "There are over 100 different types of meditation practices"
    ]
  },
  {
    "title": "National Fitness Day",
    "slug": "national-fitness-day",
    "date": "2026-05-06",
    "category": "Awareness",
    "description": "Get moving and prioritize your physical health on National Fitness Day! This important day encourages people to embrace an active lifestyle and discover the benefits of regular exercise. Whether you prefer running, yoga, weightlifting, or dancing, find activities you enjoy and make fitness a fun part of your daily routine.",
    "tags": [
      "fitness",
      "exercise",
      "May",
      "health",
      "wellness",
      "active",
      "sports"
    ],
    "image": "people-exercising-outdoor.jpg",
    "relatedDays": [
      "national-yoga-day",
      "national-running-day",
      "national-sports-day"
    ],
    "howToCelebrate": "Try a new workout or fitness class you've never done before. Go for a walk, run, or bike ride outdoors. Set new fitness goals and create a workout plan. Share your fitness journey and tips on social media. Encourage friends and family to join you in physical activities.",
    "funFacts": [
      "Regular exercise can reduce the risk of heart disease by 30%",
      "Exercise releases endorphins that improve mood and reduce stress",
      "You can burn calories even while sleeping if you exercise regularly",
      "The average person takes about 7,500 steps per day",
      "Exercise can improve sleep quality and boost immune function"
    ]
  },
  {
    "title": "National Sleep Day",
    "slug": "national-sleep-day",
    "date": "2026-03-15",
    "category": "Awareness",
    "description": "Catch some quality Z's and prioritize your rest on National Sleep Day! This important awareness day highlights the crucial role sleep plays in our physical and mental health. Learn about healthy sleep habits, discover ways to improve your sleep quality, and recognize that good sleep is essential for overall well-being and daily performance.",
    "tags": [
      "sleep",
      "rest",
      "March",
      "health",
      "wellness",
      "recovery",
      "mental-health"
    ],
    "image": "peaceful-sleep-environment.jpg",
    "relatedDays": [
      "national-insomnia-awareness-day",
      "daylight-saving-time-begins",
      "national-nap-day"
    ],
    "howToCelebrate": "Create a relaxing bedtime routine and stick to a consistent sleep schedule. Make your bedroom a sleep-friendly environment with comfortable bedding and minimal distractions. Avoid screens before bedtime and try relaxation techniques. Learn about sleep hygiene and share tips with others. Take a well-deserved nap if you're feeling tired.",
    "funFacts": [
      "Adults need 7-9 hours of sleep per night for optimal health",
      "Sleep deprivation can impair judgment as much as alcohol consumption",
      "During sleep, your brain consolidates memories and processes information",
      "The record for longest period without sleep is 11 days",
      "Sleep is more important than food - you can survive longer without food than without sleep"
    ]
  },
  {
    "title": "National Nutrition Month",
    "slug": "national-nutrition-month",
    "date": "2026-03-01",
    "category": "Awareness",
    "description": "Nourish your body and mind throughout National Nutrition Month! This month-long awareness campaign promotes healthy eating habits and the importance of good nutrition for overall health. Learn about balanced diets, discover new healthy recipes, and make informed food choices that support your well-being and energy levels.",
    "tags": [
      "nutrition",
      "health",
      "March",
      "diet",
      "wellness",
      "healthy-eating",
      "education"
    ],
    "image": "healthy-nutritious-foods.jpg",
    "relatedDays": [
      "world-health-day",
      "national-fitness-day",
      "world-food-day"
    ],
    "howToCelebrate": "Plan and prepare healthy meals for the month. Learn about different nutrients and their benefits. Try new fruits and vegetables you've never had before. Consult with a nutritionist or dietitian. Share healthy recipes and nutrition tips on social media.",
    "funFacts": [
      "National Nutrition Month was established in 1973",
      "Proper nutrition can prevent 80% of heart disease and stroke",
      "The average American diet is high in processed foods",
      "Eating a variety of colors ensures diverse nutrients",
      "Good nutrition can improve mental health and cognitive function"
    ]
  },
  {
    "title": "National Mental Health Day",
    "slug": "national-mental-health-day",
    "date": "2026-10-10",
    "category": "Awareness",
    "description": "Prioritize your mental well-being on National Mental Health Day! This important awareness day focuses on mental health education, reducing stigma, and promoting resources for those struggling with mental health challenges. Learn about mental health, support others, and remember that seeking help is a sign of strength, not weakness.",
    "tags": [
      "mental-health",
      "wellness",
      "October",
      "awareness",
      "support",
      "therapy",
      "self-care"
    ],
    "image": "mental-health-support.jpg",
    "relatedDays": [
      "national-stress-awareness-day",
      "mental-health-awareness-month",
      "national-meditation-day"
    ],
    "howToCelebrate": "Learn about mental health resources and support services. Practice self-care activities like meditation, exercise, or hobbies. Check in with friends and family about their mental well-being. Share mental health resources and information on social media. Consider volunteering with mental health organizations.",
    "funFacts": [
      "1 in 5 adults experiences mental illness each year",
      "Mental health is just as important as physical health",
      "Early intervention can prevent mental health conditions from worsening",
      "Exercise is one of the most effective treatments for depression and anxiety",
      "Talking about mental health helps reduce stigma and encourages others to seek help"
    ]
  },
  {
    "title": "National Mindfulness Day",
    "slug": "national-mindfulness-day",
    "date": "2026-09-12",
    "category": "Awareness",
    "description": "Be present and celebrate the practice of mindfulness on National Mindfulness Day! Mindfulness involves being fully aware of the present moment without judgment. This powerful practice can reduce stress, improve focus, and enhance overall well-being. Learn techniques for staying present and cultivate a more mindful approach to daily life.",
    "tags": [
      "mindfulness",
      "present",
      "September",
      "awareness",
      "meditation",
      "wellness",
      "focus"
    ],
    "image": "peaceful-mindfulness-practice.jpg",
    "relatedDays": [
      "national-meditation-day",
      "national-stress-awareness-day",
      "national-yoga-day"
    ],
    "howToCelebrate": "Practice mindfulness meditation for 10-15 minutes. Try mindful eating by savoring each bite. Take a mindful walk, paying attention to your surroundings. Practice deep breathing exercises. Share mindfulness tips and experiences on social media.",
    "funFacts": [
      "Mindfulness can reduce anxiety by 60%",
      "Just 10 minutes of mindfulness daily can improve focus",
      "Mindfulness has been practiced for over 2,500 years",
      "Mindfulness can improve sleep quality",
      "Regular mindfulness practice can increase gray matter in the brain"
    ]
  },
  {
    "title": "National Digital Wellness Day",
    "slug": "national-digital-wellness-day",
    "date": "2026-05-15",
    "category": "Awareness",
    "description": "Take a step back from screens and focus on healthy technology habits on National Digital Wellness Day! In our increasingly connected world, it's important to maintain a balanced relationship with technology. Learn about digital wellness practices, discover ways to reduce screen time, and create healthier boundaries with your devices for better mental and physical well-being.",
    "tags": [
      "digital-wellness",
      "technology",
      "May",
      "mental-health",
      "balance",
      "screen-time",
      "awareness"
    ],
    "image": "digital-wellness-balance.jpg",
    "relatedDays": [
      "national-mental-health-day",
      "national-technology-day",
      "national-unplugging-day"
    ],
    "howToCelebrate": "Take regular breaks from screens throughout the day using the 20-20-20 rule. Set up phone-free zones in your home, especially bedrooms and dining areas. Practice mindful technology use by being intentional about when and why you use devices. Try a digital detox for a few hours or the whole day. Share digital wellness tips and resources on social media.",
    "funFacts": [
      "The average person checks their phone 96 times per day",
      "Blue light from screens can disrupt sleep patterns and circadian rhythms",
      "Taking regular breaks from screens can reduce eye strain and headaches",
      "Digital wellness practices can improve focus and productivity",
      "Excessive screen time has been linked to increased anxiety and depression"
    ]
  },
  {
    "title": "National Literacy Awareness Day",
    "slug": "national-literacy-awareness-day",
    "date": "2026-09-08",
    "category": "Awareness",
    "description": "Celebrate the power of reading and writing on National Literacy Awareness Day! Literacy is fundamental to personal growth, education, and social development. This important day raises awareness about literacy challenges worldwide and encourages support for reading programs, libraries, and educational initiatives that help people develop essential reading and writing skills.",
    "tags": [
      "literacy",
      "reading",
      "September",
      "education",
      "awareness",
      "books",
      "learning"
    ],
    "image": "literacy-education-books.jpg",
    "relatedDays": [
      "world-teachers-day",
      "national-library-week",
      "international-literacy-day"
    ],
    "howToCelebrate": "Donate books to local schools, libraries, or literacy programs. Volunteer with adult literacy organizations or reading programs for children. Read to children in your community or family. Support literacy initiatives through donations or advocacy. Share the importance of literacy and reading on social media.",
    "funFacts": [
      "About 771 million adults worldwide cannot read or write",
      "Children who read for pleasure perform better in school",
      "Reading regularly can reduce stress by up to 68%",
      "Literacy rates have improved dramatically over the past century",
      "Reading fiction can improve empathy and social understanding"
    ]
  },
  {
    "title": "National Cybersecurity Awareness Day",
    "slug": "national-cybersecurity-awareness-day",
    "date": "2026-10-15",
    "category": "Awareness",
    "description": "Protect yourself and others online on National Cybersecurity Awareness Day! In our increasingly digital world, cybersecurity is more important than ever. Learn about online safety practices, password security, phishing scams, and how to protect your personal information. Stay informed about cyber threats and help create a safer digital environment for everyone.",
    "tags": [
      "cybersecurity",
      "online-safety",
      "October",
      "digital",
      "privacy",
      "protection",
      "awareness"
    ],
    "image": "cybersecurity-protection-awareness.jpg",
    "relatedDays": [
      "national-technology-day",
      "national-digital-wellness-day",
      "data-privacy-day"
    ],
    "howToCelebrate": "Update all your passwords and enable two-factor authentication on important accounts. Learn about common cyber threats like phishing, malware, and social engineering. Review your privacy settings on social media and other online accounts. Share cybersecurity tips and resources with friends and family. Support cybersecurity education and awareness programs.",
    "funFacts": [
      "Cybercrime damages are expected to reach $10.5 trillion annually by 2025",
      "95% of successful cyber attacks are due to human error",
      "The average data breach costs companies $4.35 million",
      "A new malware is created every 4.2 seconds",
      "Strong passwords should be at least 12 characters long with mixed characters"
    ]
  },
  {
    "title": "National Environmental Education Day",
    "slug": "national-environmental-education-day",
    "date": "2026-04-22",
    "category": "Awareness",
    "description": "Learn about our planet and how to protect it on National Environmental Education Day! Environmental education empowers people to make informed decisions about environmental issues and take action to protect our natural world. From climate change to conservation, discover how education can inspire environmental stewardship and sustainable living practices.",
    "tags": [
      "environmental-education",
      "sustainability",
      "April",
      "conservation",
      "climate",
      "learning",
      "awareness"
    ],
    "image": "environmental-education-nature.jpg",
    "relatedDays": [
      "earth-day",
      "world-environment-day",
      "national-environmental-education-week"
    ],
    "howToCelebrate": "Participate in environmental education programs or workshops. Visit nature centers, parks, or environmental organizations to learn about local ecosystems. Start an environmental project at school or in your community. Share environmental facts and tips on social media. Support environmental education initiatives and organizations.",
    "funFacts": [
      "Environmental education helps develop critical thinking skills",
      "Students who participate in environmental education score higher on standardized tests",
      "Environmental education can lead to more sustainable lifestyle choices",
      "Outdoor education experiences can improve mental health and well-being",
      "Environmental education programs exist in schools worldwide"
    ]
  },
  {
    "title": "National Autism Awareness Day",
    "slug": "national-autism-awareness-day",
    "date": "2026-04-02",
    "category": "Awareness",
    "description": "Promote understanding and acceptance of autism on National Autism Awareness Day! This important day raises awareness about autism spectrum disorders and celebrates the unique strengths and perspectives of individuals with autism. Learn about autism, support autism research and advocacy, and help create a more inclusive society for people of all neurotypes.",
    "tags": [
      "autism",
      "awareness",
      "April",
      "acceptance",
      "neurodiversity",
      "inclusion",
      "understanding"
    ],
    "image": "autism-awareness-support.jpg",
    "relatedDays": [
      "world-autism-awareness-day",
      "national-disability-awareness-month",
      "international-day-of-persons-with-disabilities"
    ],
    "howToCelebrate": "Learn about autism spectrum disorders and the experiences of autistic individuals. Support autism research organizations and advocacy groups. Promote autism acceptance and inclusion in your community. Share autism awareness information and resources on social media. Listen to and amplify autistic voices and perspectives.",
    "funFacts": [
      "About 1 in 36 children are diagnosed with autism spectrum disorder",
      "Autism affects people of all races, ethnicities, and socioeconomic backgrounds",
      "Many autistic individuals have exceptional skills in areas like math, music, or art",
      "Early intervention and support can significantly improve outcomes for autistic individuals",
      "The autism rights movement promotes acceptance rather than trying to 'cure' autism"
    ]
  },
  {
    "title": "National Disaster Preparedness Day",
    "slug": "national-disaster-preparedness-day",
    "date": "2026-09-30",
    "category": "Awareness",
    "description": "Be ready for emergencies on National Disaster Preparedness Day! Natural disasters and emergencies can happen without warning, making preparation essential for protecting yourself and your family. Learn about emergency planning, build disaster supply kits, and develop the knowledge and skills needed to respond effectively to various emergency situations.",
    "tags": [
      "disaster-preparedness",
      "emergency",
      "September",
      "safety",
      "planning",
      "awareness",
      "protection"
    ],
    "image": "disaster-preparedness-kit.jpg",
    "relatedDays": [
      "national-emergency-preparedness-month",
      "international-day-for-disaster-reduction",
      "national-safety-month"
    ],
    "howToCelebrate": "Create or update your family emergency plan and disaster supply kit. Learn about the types of disasters that could affect your area. Practice emergency procedures like evacuation routes and communication plans. Sign up for local emergency alerts and warnings. Share preparedness tips and resources with your community.",
    "funFacts": [
      "Only 39% of Americans have an emergency supply kit",
      "It's recommended to have supplies for at least 72 hours",
      "The most common natural disasters in the US are floods, hurricanes, and wildfires",
      "Having a family emergency plan can reduce panic and confusion during disasters",
      "Emergency kits should be checked and updated every six months"
    ]
  },
  {
    "title": "National Blood Donor Day",
    "slug": "national-blood-donor-day",
    "date": "2026-01-14",
    "category": "Awareness",
    "description": "Give the gift of life on National Blood Donor Day! Blood donation is one of the most meaningful ways to help others, as donated blood saves millions of lives each year. Learn about the importance of blood donation, eligibility requirements, and how this simple act of kindness can make a life-or-death difference for patients in need.",
    "tags": [
      "blood-donation",
      "life-saving",
      "January",
      "health",
      "giving",
      "medical",
      "awareness"
    ],
    "image": "blood-donation-awareness.jpg",
    "relatedDays": [
      "world-blood-donor-day",
      "national-volunteer-day",
      "red-cross-day"
    ],
    "howToCelebrate": "Donate blood if you're eligible and encourage others to do the same. Learn about blood types and donation requirements. Support blood donation drives in your community. Share the importance of blood donation on social media. Thank blood donors and healthcare workers who make transfusions possible.",
    "funFacts": [
      "One blood donation can save up to three lives",
      "Only 3% of age-eligible Americans donate blood annually",
      "Blood cannot be manufactured - it can only come from volunteer donors",
      "The average red blood cell lives for 120 days",
      "Type O-negative blood is the universal donor type"
    ]
  },
  {
    "title": "National Organ Donor Day",
    "slug": "national-organ-donor-day",
    "date": "2026-02-14",
    "category": "Awareness",
    "description": "Share the gift of life on National Organ Donor Day! Organ donation gives hope to thousands of people waiting for life-saving transplants. This important day raises awareness about organ donation, encourages people to register as donors, and honors the generous donors and recipients whose lives have been forever changed by this ultimate act of giving.",
    "tags": [
      "organ-donation",
      "transplant",
      "February",
      "life-saving",
      "awareness",
      "medical",
      "giving"
    ],
    "image": "organ-donation-awareness.jpg",
    "relatedDays": [
      "national-donate-life-month",
      "national-blood-donor-day",
      "world-kidney-day"
    ],
    "howToCelebrate": "Register as an organ donor and encourage family members to do the same. Learn about organ donation facts and the transplant process. Support organ donation awareness campaigns. Share organ donation information on social media. Honor organ donors and recipients in your community.",
    "funFacts": [
      "One organ donor can save up to eight lives",
      "Over 100,000 Americans are waiting for organ transplants",
      "Every 10 minutes, someone is added to the organ transplant waiting list",
      "Organs that can be donated include heart, liver, kidneys, lungs, pancreas, and intestines",
      "Age is not a barrier to organ donation - people in their 80s have been successful donors"
    ]
  },
  {
    "title": "National Cancer Awareness Day",
    "slug": "national-cancer-awareness-day",
    "date": "2026-02-04",
    "category": "Awareness",
    "description": "Stand together in the fight against cancer on National Cancer Awareness Day! This important day promotes cancer prevention, early detection, and support for patients and families affected by cancer. Learn about risk factors, screening guidelines, and the latest advances in cancer research and treatment.",
    "tags": [
      "cancer-awareness",
      "prevention",
      "February",
      "health",
      "research",
      "support",
      "screening"
    ],
    "image": "cancer-awareness-support.jpg",
    "relatedDays": [
      "world-cancer-day",
      "breast-cancer-awareness-month",
      "national-cancer-survivors-day"
    ],
    "howToCelebrate": "Learn about cancer prevention and early detection methods. Support cancer research organizations and patient support groups. Share cancer awareness information and resources. Participate in cancer fundraising events and awareness campaigns. Honor cancer survivors and remember those lost to cancer.",
    "funFacts": [
      "About 40% of cancer cases could be prevented through lifestyle changes",
      "Early detection significantly improves cancer treatment outcomes",
      "Cancer survival rates have improved dramatically over the past 30 years",
      "There are over 100 different types of cancer",
      "More than 18 million people worldwide are diagnosed with cancer each year"
    ]
  },
  {
    "title": "National Mental Health Awareness Day",
    "slug": "national-mental-health-awareness-day",
    "date": "2026-05-18",
    "category": "Awareness",
    "description": "Break the silence and promote mental health awareness on National Mental Health Awareness Day! Mental health is just as important as physical health, yet it's often overlooked or stigmatized. Learn about mental health conditions, support those who are struggling, and work to create a more understanding and compassionate society for everyone.",
    "tags": [
      "mental-health",
      "awareness",
      "May",
      "wellness",
      "support",
      "stigma",
      "compassion"
    ],
    "image": "mental-health-awareness-support.jpg",
    "relatedDays": [
      "world-mental-health-day",
      "national-suicide-prevention-month",
      "mental-health-awareness-month"
    ],
    "howToCelebrate": "Learn about mental health conditions and how to support those affected. Share mental health resources and information on social media. Check in with friends and family about their mental well-being. Support mental health organizations and advocacy groups. Practice self-care and stress management techniques.",
    "funFacts": [
      "1 in 5 adults experiences mental illness each year",
      "Mental health conditions are treatable with proper care",
      "Talking about mental health reduces stigma and encourages help-seeking",
      "Exercise and social connections can improve mental health",
      "Mental health awareness has increased significantly in recent years"
    ]
  },
  {
    "title": "National Recycling Day",
    "slug": "national-recycling-day",
    "date": "2026-11-15",
    "category": "Awareness",
    "description": "Go green and recycle on National Recycling Day! Recycling helps conserve natural resources, reduce waste, and protect our environment for future generations. Learn about what can be recycled, how to recycle properly, and discover creative ways to reduce, reuse, and recycle in your daily life.",
    "tags": [
      "recycling",
      "environment",
      "November",
      "sustainability",
      "waste-reduction",
      "green",
      "conservation"
    ],
    "image": "recycling-environmental-action.jpg",
    "relatedDays": [
      "earth-day",
      "world-environment-day",
      "national-cleanup-day"
    ],
    "howToCelebrate": "Sort and recycle materials properly in your home. Learn about local recycling programs and guidelines. Reduce waste by choosing products with less packaging. Start a composting program for organic waste. Share recycling tips and environmental facts on social media.",
    "funFacts": [
      "Recycling one aluminum can saves enough energy to power a TV for 3 hours",
      "Americans recycle about 34% of their waste",
      "Glass can be recycled indefinitely without losing quality",
      "Recycling creates 6 times more jobs than landfilling",
      "A single plastic bottle takes 450 years to decompose in a landfill"
    ]
  },
  {
    "title": "National Diabetes Awareness Day",
    "slug": "national-diabetes-awareness-day",
    "date": "2026-11-14",
    "category": "Awareness",
    "description": "Raise awareness about diabetes and its impact on National Diabetes Awareness Day! Diabetes affects millions of people worldwide and requires ongoing management and support. Learn about prevention, treatment options, and how to support those living with diabetes while promoting healthy lifestyle choices.",
    "tags": [
      "diabetes",
      "health",
      "November",
      "awareness",
      "prevention",
      "management",
      "support"
    ],
    "image": "national-diabetes-awareness-day-optimized.webp",
    "relatedDays": [
      "world-diabetes-day",
      "national-nutrition-month",
      "national-fitness-day"
    ],
    "howToCelebrate": "Learn about diabetes prevention and management. Get your blood sugar checked if you're at risk. Support diabetes research and advocacy organizations. Share diabetes awareness information on social media. Encourage healthy lifestyle choices for diabetes prevention.",
    "funFacts": [
      "Over 37 million Americans have diabetes",
      "Type 2 diabetes can often be prevented with lifestyle changes",
      "Regular exercise and healthy eating can help manage diabetes",
      "Diabetes is the 7th leading cause of death in the United States",
      "Early detection and treatment can prevent serious complications"
    ]
  },
  {
    "title": "National Alzheimer's Awareness Day",
    "slug": "national-alzheimers-awareness-day",
    "date": "2026-09-21",
    "category": "Awareness",
    "description": "Stand together against Alzheimer's on National Alzheimer's Awareness Day! This devastating disease affects millions of families worldwide, causing memory loss and cognitive decline. Learn about Alzheimer's, support research efforts, and help create a more understanding and supportive community for those affected.",
    "tags": [
      "alzheimers",
      "dementia",
      "September",
      "awareness",
      "memory",
      "research",
      "support"
    ],
    "image": "national-alzheimers-awareness-day-optimized.webp",
    "relatedDays": [
      "world-alzheimers-day",
      "national-memory-day",
      "national-brain-awareness-week"
    ],
    "howToCelebrate": "Learn about Alzheimer's disease and its impact on families. Support Alzheimer's research organizations and advocacy groups. Share information about early warning signs and prevention. Volunteer with organizations supporting families affected by Alzheimer's. Wear purple to show support for the cause.",
    "funFacts": [
      "Alzheimer's is the 6th leading cause of death in the United States",
      "More than 6 million Americans are living with Alzheimer's",
      "Early diagnosis can help slow disease progression",
      "Regular physical and mental exercise may help prevent Alzheimer's",
      "Alzheimer's affects not just memory but also thinking and behavior"
    ]
  },
  {
    "title": "National Cancer Survivors Day",
    "slug": "national-cancer-survivors-day",
    "date": "2026-06-01",
    "category": "Awareness",
    "description": "Celebrate life and hope on National Cancer Survivors Day! This important American observance honors the millions of cancer survivors who have faced this disease with courage and determination. From those in remission to long-term survivors, recognize their strength, resilience, and the hope they bring to others fighting cancer.",
    "tags": [
      "cancer-survivors",
      "hope",
      "June",
      "american-awareness",
      "celebration",
      "strength",
      "resilience"
    ],
    "image": "cancer-survivors-celebration.jpg",
    "relatedDays": [
      "national-cancer-awareness-day",
      "breast-cancer-awareness-month",
      "world-cancer-day"
    ],
    "howToCelebrate": "Celebrate cancer survivors in your life with cards, calls, or visits. Participate in cancer survivor events and walks. Support cancer research and treatment organizations. Share survivor stories and messages of hope on social media. Donate to cancer charities that support survivors and research.",
    "funFacts": [
      "There are over 16.9 million cancer survivors in the United States",
      "Cancer survival rates have improved significantly over the past 30 years",
      "The 5-year survival rate for all cancers combined is about 68%",
      "Early detection and treatment greatly improve survival rates",
      "Cancer survivors often become advocates for cancer research and awareness"
    ]
  },
  {
    "title": "National Suicide Prevention Day",
    "slug": "national-suicide-prevention-day",
    "date": "2026-09-10",
    "category": "Awareness",
    "description": "Break the silence and save lives on National Suicide Prevention Day! This critical American awareness day focuses on preventing suicide, supporting those at risk, and remembering those we've lost. Learn the warning signs, reach out to those who may be struggling, and help create a more compassionate society where everyone feels valued and supported.",
    "tags": [
      "suicide-prevention",
      "mental-health",
      "September",
      "american-awareness",
      "support",
      "crisis",
      "compassion"
    ],
    "image": "suicide-prevention-awareness.jpg",
    "relatedDays": [
      "national-mental-health-day",
      "national-mental-health-awareness-day",
      "world-suicide-prevention-day"
    ],
    "howToCelebrate": "Learn about suicide warning signs and how to help someone in crisis. Share the National Suicide Prevention Lifeline (988) on social media. Check in with friends and family who may be struggling. Support suicide prevention organizations and mental health resources. Participate in awareness walks and events in your community.",
    "funFacts": [
      "Suicide is the 10th leading cause of death in the United States",
      "The National Suicide Prevention Lifeline is 988",
      "Suicide rates have increased by 30% since 2000",
      "Men are 3.5 times more likely to die by suicide than women",
      "Most people who attempt suicide don't die by suicide"
    ]
  },
  {
    "title": "National Recovery Month",
    "slug": "national-recovery-month",
    "date": "2026-09-01",
    "category": "Awareness",
    "description": "Celebrate hope and healing during National Recovery Month! This important American observance recognizes the millions of Americans in recovery from substance use disorders and mental health conditions. Learn about recovery resources, support those in recovery, and help reduce the stigma surrounding addiction and mental health treatment.",
    "tags": [
      "recovery",
      "addiction",
      "September",
      "american-awareness",
      "healing",
      "support",
      "hope"
    ],
    "image": "recovery-month-celebration.jpg",
    "relatedDays": [
      "national-mental-health-day",
      "national-suicide-prevention-day",
      "world-mental-health-day"
    ],
    "howToCelebrate": "Learn about recovery resources and support services in your community. Share recovery stories and messages of hope on social media. Support organizations that help people in recovery. Attend recovery events and walks in your area. Educate yourself about addiction and mental health to reduce stigma.",
    "funFacts": [
      "National Recovery Month was established in 1989 by SAMHSA",
      "Over 20 million Americans are in recovery from substance use disorders",
      "Recovery is possible for everyone, regardless of the severity of their condition",
      "Support from family and friends is crucial for successful recovery",
      "Recovery rates improve significantly with proper treatment and support"
    ]
  },
  {
    "title": "National Donate Life Month",
    "slug": "national-donate-life-month",
    "date": "2026-04-01",
    "category": "Awareness",
    "description": "Give the gift of life during National Donate Life Month! This important American awareness campaign promotes organ, eye, and tissue donation, encouraging Americans to register as donors and save lives. Learn about the donation process, register as a donor, and help spread awareness about this life-saving opportunity.",
    "tags": [
      "donate-life",
      "organ-donation",
      "April",
      "american-awareness",
      "life-saving",
      "gift",
      "hope"
    ],
    "image": "donate-life-awareness.jpg",
    "relatedDays": [
      "national-organ-donor-day",
      "national-blood-donor-day",
      "world-blood-donor-day"
    ],
    "howToCelebrate": "Register as an organ, eye, and tissue donor. Share your donor status on social media to encourage others. Learn about the donation process and how it saves lives. Support organizations that promote donation awareness. Talk to your family about your wishes regarding donation.",
    "funFacts": [
      "One organ donor can save up to 8 lives",
      "Over 100,000 Americans are waiting for organ transplants",
      "Every 10 minutes, someone is added to the transplant waiting list",
      "95% of Americans support organ donation, but only 58% are registered",
      "Donation is possible for people of all ages and backgrounds"
    ]
  },
  {
    "title": "National Breast Cancer Awareness Month",
    "slug": "national-breast-cancer-awareness-month",
    "date": "2026-10-01",
    "category": "Awareness",
    "description": "Think pink and raise awareness during National Breast Cancer Awareness Month! This important American campaign educates women about breast cancer prevention, early detection, and treatment options. From mammograms to self-exams, learn how to protect yourself and support others in the fight against breast cancer.",
    "tags": [
      "breast-cancer",
      "awareness",
      "October",
      "american-awareness",
      "prevention",
      "pink",
      "women"
    ],
    "image": "breast-cancer-awareness-pink.jpg",
    "relatedDays": [
      "national-mammography-day",
      "national-cancer-awareness-day",
      "world-cancer-day"
    ],
    "howToCelebrate": "Schedule your annual mammogram if you're due. Learn about breast self-examination techniques. Participate in breast cancer awareness walks and events. Wear pink to show your support. Donate to breast cancer research and support organizations.",
    "funFacts": [
      "1 in 8 women will develop breast cancer in their lifetime",
      "Early detection through mammograms can reduce breast cancer deaths by 30%",
      "Breast cancer is the most common cancer in American women",
      "Men can also get breast cancer, though it's rare",
      "The pink ribbon became the symbol of breast cancer awareness in 1992"
    ]
  },
  {
    "title": "National Donate Life Day",
    "slug": "national-donate-life-day-organ",
    "date": "2026-04-11",
    "category": "Awareness & Health",
    "description": "Give the gift of life on National Donate Life Day! This important observance promotes organ, eye, and tissue donation, which saves and heals lives across America. One donor can save up to 8 lives and heal over 75 people. Register as a donor today!",
    "tags": [
      "organ-donation",
      "health",
      "April",
      "lifesaving",
      "awareness",
      "transplant",
      "gift-of-life"
    ],
    "image": "donate-life-heart-symbol.jpg",
    "relatedDays": [
      "national-donor-day",
      "world-donor-day",
      "organ-donation-awareness-month"
    ],
    "howToCelebrate": "Register as an organ, eye, and tissue donor. Share your donor status on social media. Learn about donation and transplantation. Thank donor families and living donors. Support organizations that promote donation. Wear blue and green to show support.",
    "funFacts": [
      "Over 100,000 Americans are waiting for organ transplants",
      "One organ donor can save up to 8 lives",
      "Tissue donation can heal up to 75 people",
      "60% of Americans are registered donors",
      "All major religions support organ donation"
    ]
  },
  {
    "title": "National Diabetes Awareness Month",
    "slug": "national-diabetes-awareness-month-november",
    "date": "2026-11-01",
    "category": "Awareness & Health",
    "description": "Fight diabetes and promote healthy living during National Diabetes Awareness Month! November focuses attention on diabetes prevention, management, and research. Learn about this growing epidemic affecting over 37 million Americans and take steps toward better health.",
    "tags": [
      "diabetes",
      "health",
      "November",
      "awareness",
      "prevention",
      "chronic-disease",
      "wellness"
    ],
    "image": "diabetes-awareness-blue-circle.jpg",
    "relatedDays": [
      "world-diabetes-day",
      "american-diabetes-month",
      "national-nutrition-month"
    ],
    "howToCelebrate": "Get screened for diabetes and prediabetes. Learn about diabetes management and prevention. Support diabetes research organizations. Participate in diabetes awareness walks. Share educational information. Wear blue on World Diabetes Day (Nov 14).",
    "funFacts": [
      "1 in 10 Americans has diabetes",
      "96 million Americans have prediabetes",
      "Type 2 diabetes can often be prevented through lifestyle changes",
      "Diabetes costs the US over $327 billion annually",
      "Early detection and management can prevent complications"
    ]
  },
  {
    "title": "National Heart Health Month",
    "slug": "national-heart-health-month-february",
    "date": "2026-02-01",
    "category": "Awareness & Health",
    "description": "Love your heart during National Heart Health Month! February focuses on cardiovascular disease prevention and heart health. Heart disease is the leading cause of death in America, but many cases are preventable through healthy lifestyle choices.",
    "tags": [
      "heart-health",
      "cardiovascular",
      "February",
      "awareness",
      "prevention",
      "wellness",
      "health"
    ],
    "image": "heart-health-awareness-red.jpg",
    "relatedDays": [
      "world-heart-day",
      "national-wear-red-day",
      "american-heart-month"
    ],
    "howToCelebrate": "Schedule a heart health screening. Learn your numbers (blood pressure, cholesterol). Start heart-healthy exercise routines. Adopt a heart-healthy diet. Quit smoking if you smoke. Wear red on National Wear Red Day (first Friday). Share heart health tips on social media.",
    "funFacts": [
      "Heart disease causes 1 in 4 deaths in the US",
      "About 80% of cardiovascular disease can be prevented",
      "Women's heart attack symptoms often differ from men's",
      "30 minutes of daily exercise significantly reduces heart disease risk",
      "The American Heart Association promotes Life's Essential 8 for heart health"
    ]
  },
  {
    "title": "National Alzheimer's Awareness Month",
    "slug": "national-alzheimers-awareness-month-november",
    "date": "2026-11-01",
    "category": "Awareness & Health",
    "description": "Remember and support those affected by Alzheimer's during National Alzheimer's Awareness Month! November brings attention to this devastating disease affecting over 6 million Americans. Support research, caregivers, and families facing this challenging journey.",
    "tags": [
      "Alzheimers",
      "memory",
      "November",
      "awareness",
      "caregiving",
      "health",
      "support"
    ],
    "image": "alzheimers-awareness-purple.jpg",
    "relatedDays": [
      "world-alzheimers-day",
      "national-family-caregivers-month",
      "brain-health-awareness-month"
    ],
    "howToCelebrate": "Learn about Alzheimer's warning signs. Support Alzheimer's research organizations. Participate in the Walk to End Alzheimer's. Support caregivers of those with Alzheimer's. Volunteer at memory care facilities. Share purple awareness ribbons and information on social media.",
    "funFacts": [
      "Over 6.7 million Americans age 65+ have Alzheimer's",
      "It's the 6th leading cause of death in the US",
      "Two-thirds of Americans with Alzheimer's are women",
      "Over 11 million Americans provide unpaid care for someone with Alzheimer's",
      "Research is making progress toward prevention and treatment"
    ]
  },
  {
    "title": "National Stroke Awareness Month",
    "slug": "national-stroke-awareness-month-may",
    "date": "2026-05-01",
    "category": "Awareness & Health",
    "description": "Act FAST and save lives during National Stroke Awareness Month! May focuses on stroke prevention, recognition, and treatment. Learn the warning signs - Face drooping, Arm weakness, Speech difficulty, Time to call 911. Quick action saves lives and reduces disability.",
    "tags": [
      "stroke",
      "health",
      "May",
      "awareness",
      "prevention",
      "emergency",
      "brain-health"
    ],
    "image": "stroke-awareness-fast-signs.jpg",
    "relatedDays": [
      "world-stroke-day",
      "brain-awareness-week",
      "national-heart-health-month"
    ],
    "howToCelebrate": "Learn and share the FAST acronym for stroke recognition. Know your risk factors and get screened. Adopt stroke-prevention lifestyle habits. Support stroke survivors and their families. Participate in awareness events. Share lifesaving information on social media.",
    "funFacts": [
      "Someone in the US has a stroke every 40 seconds",
      "Stroke is the 5th leading cause of death in America",
      "Up to 80% of strokes can be prevented",
      "Time lost is brain lost - treatment within 3 hours is critical",
      "Stroke is a leading cause of serious long-term disability"
    ]
  },
  {
    "title": "National Immunization Awareness Month",
    "slug": "national-immunization-awareness-month-august",
    "date": "2026-08-01",
    "category": "Awareness & Health",
    "description": "Protect yourself and your community during National Immunization Awareness Month! August highlights the importance of vaccines for people of all ages. Vaccines have saved millions of lives and continue to protect against serious diseases.",
    "tags": [
      "vaccines",
      "immunization",
      "August",
      "prevention",
      "health",
      "awareness",
      "public-health"
    ],
    "image": "vaccination-immunization-awareness.jpg",
    "relatedDays": [
      "world-immunization-week",
      "flu-awareness-day",
      "public-health-day"
    ],
    "howToCelebrate": "Check your vaccination records and get caught up. Schedule back-to-school vaccines for children. Get your annual flu shot. Learn about vaccine safety and effectiveness. Share accurate vaccine information. Thank healthcare workers who administer vaccines.",
    "funFacts": [
      "Vaccines prevent 2-3 million deaths worldwide annually",
      "The US childhood vaccination program prevents 42,000 deaths per year",
      "Vaccines have eliminated or nearly eliminated many diseases in the US",
      "Herd immunity protects those who cannot be vaccinated",
      "Vaccine safety is continuously monitored by multiple systems"
    ]
  },
  {
    "title": "National Obesity Awareness Month",
    "slug": "national-obesity-awareness-month-september",
    "date": "2026-09-01",
    "category": "Awareness & Health",
    "description": "Focus on healthy weight and wellness during National Obesity Awareness Month! September brings attention to the obesity epidemic affecting millions of Americans. Learn about prevention, treatment, and reducing stigma around weight and health.",
    "tags": [
      "obesity",
      "health",
      "September",
      "awareness",
      "prevention",
      "wellness",
      "nutrition"
    ],
    "image": "healthy-weight-wellness.jpg",
    "relatedDays": [
      "national-nutrition-month",
      "national-fitness-day",
      "world-obesity-day"
    ],
    "howToCelebrate": "Schedule a health screening with your doctor. Learn about healthy eating and portion control. Start or increase physical activity. Focus on health, not just weight. Support obesity prevention programs. Reduce weight stigma. Share evidence-based health information on social media.",
    "funFacts": [
      "Over 42% of American adults have obesity",
      "Obesity increases risk for many serious health conditions",
      "Small, sustainable lifestyle changes can make a big difference",
      "Genetics, environment, and behavior all play roles in obesity",
      "Obesity costs the US healthcare system nearly $173 billion annually"
    ]
  },
  {
    "title": "National Depression Screening Day",
    "slug": "national-depression-screening-day-awareness",
    "date": "2026-10-09",
    "category": "Awareness & Health",
    "description": "Get screened on National Depression Screening Day! Depression affects millions of Americans, and early screening saves lives. Free screenings are offered nationwide to identify those needing mental health support.",
    "tags": [
      "depression",
      "mental-health",
      "October",
      "screening",
      "awareness",
      "healthcare",
      "support"
    ],
    "image": "depression-screening-day.jpg",
    "relatedDays": [
      "world-mental-health-day",
      "suicide-prevention-day",
      "mental-health-awareness-month"
    ],
    "howToCelebrate": "Take a depression screening test. Share screening resources. Support mental health organizations. Check in on loved ones. Reduce mental health stigma.",
    "funFacts": [
      "Over 21 million US adults experience depression annually",
      "Depression is highly treatable when identified",
      "Free confidential screenings available nationwide",
      "Early intervention dramatically improves outcomes",
      "Depression screening should be part of routine healthcare"
    ]
  },
  {
    "title": "National Physical Therapy Month",
    "slug": "national-physical-therapy-month-october",
    "date": "2026-10-01",
    "category": "Awareness & Health",
    "description": "Move better during National Physical Therapy Month! Physical therapists help millions recover from injuries and manage chronic conditions. PT is essential healthcare that improves quality of life for all ages.",
    "tags": [
      "physical-therapy",
      "rehabilitation",
      "October",
      "healthcare",
      "movement",
      "recovery",
      "wellness"
    ],
    "image": "physical-therapy-month.jpg",
    "relatedDays": [
      "national-fitness-day",
      "arthritis-awareness-month",
      "occupational-therapy-month"
    ],
    "howToCelebrate": "Thank your physical therapist. Learn about PT benefits. Try PT exercises. Support mobility awareness. Share PT success stories.",
    "funFacts": [
      "Over 350,000 physical therapists work in the US",
      "PT helps avoid surgery for many conditions",
      "Physical therapy treats all ages from infants to elderly",
      "PT reduces long-term healthcare costs",
      "Movement is medicine for countless conditions"
    ]
  },
  {
    "title": "National Cholesterol Education Month",
    "slug": "national-cholesterol-education-month-september",
    "date": "2026-09-01",
    "category": "Awareness & Health",
    "description": "Know your numbers during National Cholesterol Education Month! High cholesterol affects 93 million American adults. Understanding and managing cholesterol levels prevents heart disease and strokes.",
    "tags": [
      "cholesterol",
      "heart-health",
      "September",
      "prevention",
      "awareness",
      "healthcare",
      "education"
    ],
    "image": "cholesterol-education-month.jpg",
    "relatedDays": [
      "world-heart-day",
      "american-heart-month",
      "blood-pressure-awareness"
    ],
    "howToCelebrate": "Get cholesterol checked. Learn about healthy cholesterol levels. Improve diet and exercise. Share heart health tips. Support cardiovascular research.",
    "funFacts": [
      "93 million US adults have high cholesterol",
      "Many people don't know they have high cholesterol",
      "Diet and exercise can significantly impact levels",
      "High cholesterol increases heart disease risk",
      "Regular screening saves lives"
    ]
  },
  {
    "title": "National Pain Awareness Month",
    "slug": "national-pain-awareness-month-september",
    "date": "2026-09-01",
    "category": "Awareness & Health",
    "description": "Understand chronic pain during National Pain Awareness Month! Over 50 million Americans live with chronic pain. Raising awareness improves treatment access and reduces stigma around pain management.",
    "tags": [
      "chronic-pain",
      "awareness",
      "September",
      "healthcare",
      "pain-management",
      "support",
      "wellness"
    ],
    "image": "pain-awareness-month.jpg",
    "relatedDays": [
      "fibromyalgia-awareness-day",
      "arthritis-awareness-month",
      "migraine-awareness-month"
    ],
    "howToCelebrate": "Learn about chronic pain conditions. Support those living with pain. Advocate for pain treatment access. Share pain management resources. Reduce pain stigma.",
    "funFacts": [
      "Over 50 million US adults have chronic pain",
      "Chronic pain costs over $600 billion annually",
      "Many effective pain management strategies exist",
      "Chronic pain affects mental and physical health",
      "Multidisciplinary approaches work best"
    ]
  },
  {
    "title": "National Prostate Health Month",
    "slug": "national-prostate-health-month-september",
    "date": "2026-09-01",
    "category": "Awareness & Health",
    "description": "Screen for prostate health during National Prostate Health Month! Prostate cancer is the second most common cancer in American men. Early detection through screening dramatically improves treatment outcomes.",
    "tags": [
      "prostate-health",
      "mens-health",
      "September",
      "cancer-screening",
      "awareness",
      "prevention",
      "healthcare"
    ],
    "image": "prostate-health-month.jpg",
    "relatedDays": [
      "mens-health-week",
      "movember",
      "cancer-awareness-month"
    ],
    "howToCelebrate": "Get prostate screening. Learn about prostate health. Encourage men to get checked. Support prostate cancer research. Share screening importance.",
    "funFacts": [
      "1 in 8 men will be diagnosed with prostate cancer",
      "Early detection has 99% 5-year survival rate",
      "African American men have higher prostate cancer risk",
      "Screening recommendations start at age 50",
      "Prostate cancer is highly treatable when caught early"
    ]
  },
  {
    "title": "National Bone and Joint Health Week",
    "slug": "national-bone-joint-health-week-october",
    "date": "2026-10-12",
    "category": "Awareness & Health",
    "description": "Strengthen bones and joints during National Bone and Joint Health Week! Musculoskeletal conditions affect 1 in 2 Americans. Maintaining bone and joint health prevents disability and improves quality of life.",
    "tags": [
      "bone-health",
      "joint-health",
      "October",
      "musculoskeletal",
      "awareness",
      "prevention",
      "wellness"
    ],
    "image": "bone-joint-health-week.jpg",
    "relatedDays": [
      "osteoporosis-awareness-day",
      "arthritis-awareness-month",
      "physical-therapy-month"
    ],
    "howToCelebrate": "Exercise for bone strength. Learn about joint health. Get bone density checked. Support arthritis research. Share bone health tips.",
    "funFacts": [
      "1 in 2 Americans have a musculoskeletal condition",
      "Osteoporosis affects 10 million Americans",
      "Weight-bearing exercise strengthens bones",
      "Calcium and vitamin D are crucial for bones",
      "Early intervention prevents long-term disability"
    ]
  },
  {
    "title": "National Poison Prevention Week",
    "slug": "national-poison-prevention-week-march",
    "date": "2026-03-16",
    "category": "Awareness & Health",
    "description": "Prevent poisoning during National Poison Prevention Week! Poison Control centers handle millions of calls annually. Simple prevention steps protect children and adults from accidental poisonings.",
    "tags": [
      "poison-prevention",
      "safety",
      "March",
      "children",
      "awareness",
      "public-health",
      "education"
    ],
    "image": "poison-prevention-week.jpg",
    "relatedDays": [
      "child-safety-week",
      "medication-safety-week",
      "carbon-monoxide-awareness"
    ],
    "howToCelebrate": "Childproof your home. Save Poison Control number (1-800-222-1222). Safely store medications and chemicals. Learn poison first aid. Share prevention tips.",
    "funFacts": [
      "Poison Control handles over 2 million cases yearly",
      "Most poisonings happen at home",
      "Children under 6 are at highest risk",
      "Many poisonings are preventable",
      "Free expert help available 24/7"
    ]
  },
  {
    "title": "National Safety Month",
    "slug": "national-safety-month-june",
    "date": "2026-06-01",
    "category": "Awareness & Health",
    "description": "Stay safe during National Safety Month! From workplace safety to driving and home hazards, preventing accidents saves lives. Safety awareness reduces injuries and saves billions in costs.",
    "tags": [
      "safety",
      "prevention",
      "June",
      "workplace",
      "awareness",
      "public-health",
      "education"
    ],
    "image": "national-safety-month.jpg",
    "relatedDays": [
      "workplace-safety-day",
      "fire-prevention-week",
      "emergency-preparedness-month"
    ],
    "howToCelebrate": "Review safety procedures. Conduct safety training. Check smoke detectors. Practice emergency plans. Share safety tips.",
    "funFacts": [
      "Preventable injuries cost over $1 trillion annually",
      "Most accidents are preventable",
      "Workplace safety programs reduce injuries dramatically",
      "Home safety checks prevent most accidents",
      "Safety awareness saves lives and money"
    ]
  },
  {
    "title": "National Preparedness Month",
    "slug": "national-preparedness-month-september",
    "date": "2026-09-01",
    "category": "Awareness & Health",
    "description": "Get ready during National Preparedness Month! Emergencies and disasters can happen anytime. Having emergency plans and supplies protects families and communities during crises.",
    "tags": [
      "preparedness",
      "emergency",
      "September",
      "safety",
      "awareness",
      "disaster",
      "planning"
    ],
    "image": "national-preparedness-month.jpg",
    "relatedDays": [
      "emergency-preparedness-day",
      "fire-prevention-week",
      "earthquake-preparedness"
    ],
    "howToCelebrate": "Create emergency plans. Build emergency kits. Learn first aid and CPR. Practice evacuation routes. Share preparedness resources.",
    "funFacts": [
      "60% of Americans don't have emergency plans",
      "Disasters can strike without warning",
      "Simple preparations save lives",
      "Emergency kits should last 72 hours minimum",
      "Community preparedness strengthens resilience"
    ]
  },
  {
    "title": "National Yoga Month",
    "slug": "national-yoga-month-september",
    "date": "2026-09-01",
    "category": "Awareness & Health",
    "description": "Find balance during National Yoga Month! Over 36 million Americans practice yoga for physical and mental health benefits. Yoga reduces stress, improves flexibility, and enhances overall wellbeing.",
    "tags": [
      "yoga",
      "wellness",
      "September",
      "mindfulness",
      "fitness",
      "mental-health",
      "exercise"
    ],
    "image": "national-yoga-month.jpg",
    "relatedDays": [
      "international-yoga-day",
      "national-meditation-day",
      "national-fitness-day"
    ],
    "howToCelebrate": "Practice yoga daily. Try new yoga styles. Attend yoga classes. Teach others about yoga benefits. Share yoga poses and tips.",
    "funFacts": [
      "Over 36 million Americans practice yoga",
      "Yoga improves flexibility, strength, and balance",
      "Regular yoga reduces stress and anxiety",
      "Yoga is adaptable for all fitness levels",
      "The yoga industry is worth billions"
    ]
  },
  {
    "title": "National Chiropractic Health Month",
    "slug": "national-chiropractic-health-month-october",
    "date": "2026-10-01",
    "category": "Awareness & Health",
    "description": "Align your spine during National Chiropractic Health Month! Chiropractors help millions manage pain and improve mobility. Chiropractic care offers drug-free treatment for many musculoskeletal conditions.",
    "tags": [
      "chiropractic",
      "health",
      "October",
      "spine",
      "pain-relief",
      "wellness",
      "alternative-medicine"
    ],
    "image": "chiropractic-health-month.jpg",
    "relatedDays": [
      "world-spine-day",
      "physical-therapy-month",
      "pain-awareness-month"
    ],
    "howToCelebrate": "Visit a chiropractor. Learn about spinal health. Practice good posture. Share chiropractic benefits. Support holistic healthcare.",
    "funFacts": [
      "Over 35 million Americans visit chiropractors annually",
      "Chiropractic care treats back pain, headaches, and more",
      "70,000+ chiropractors practice in the US",
      "Chiropractic is the third-largest healthcare profession",
      "Drug-free pain relief option"
    ]
  },
  {
    "title": "National Dental Hygiene Month",
    "slug": "national-dental-hygiene-month-october",
    "date": "2026-10-01",
    "category": "Awareness & Health",
    "description": "Brush and floss during National Dental Hygiene Month! Oral health affects overall health. Dental hygienists educate about prevention and provide essential dental care to millions.",
    "tags": [
      "dental",
      "oral-health",
      "October",
      "hygiene",
      "prevention",
      "healthcare",
      "teeth"
    ],
    "image": "dental-hygiene-month.jpg",
    "relatedDays": [
      "national-tooth-fairy-day",
      "give-kids-a-smile-day",
      "world-oral-health-day"
    ],
    "howToCelebrate": "Visit your dentist. Thank dental hygienists. Improve brushing and flossing habits. Teach kids about oral health. Share dental care tips.",
    "funFacts": [
      "Over 200,000 dental hygienists work in the US",
      "Oral health impacts overall health",
      "Gum disease linked to heart disease and diabetes",
      "Preventive care saves money and teeth",
      "Most dental problems are preventable"
    ]
  },
  {
    "title": "National Vision and Learning Month",
    "slug": "national-vision-learning-month-august",
    "date": "2026-08-01",
    "category": "Awareness & Health",
    "description": "See clearly during National Vision and Learning Month! Vision problems affect learning in 1 in 4 children. Eye exams before school starts ensure kids can see to succeed.",
    "tags": [
      "vision",
      "eye-health",
      "August",
      "learning",
      "children",
      "education",
      "healthcare"
    ],
    "image": "vision-learning-month.jpg",
    "relatedDays": [
      "children-eye-health-day",
      "back-to-school-month",
      "world-sight-day"
    ],
    "howToCelebrate": "Get children's eyes examined. Learn about vision and learning connection. Support vision screening programs. Share eye health tips. Provide glasses to those in need.",
    "funFacts": [
      "1 in 4 school-age children have vision problems",
      "80% of learning is visual",
      "Vision problems often misdiagnosed as learning disabilities",
      "Many kids don't know they can't see well",
      "Early detection prevents learning struggles"
    ]
  },
  {
    "title": "National Spinal Cord Injury Awareness Month",
    "slug": "national-spinal-cord-injury-month-september",
    "date": "2026-09-01",
    "category": "Awareness & Health",
    "description": "Support spinal cord injury awareness during September! Nearly 300,000 Americans live with spinal cord injuries. Research advances and advocacy improve quality of life for those affected.",
    "tags": [
      "spinal-cord-injury",
      "disability",
      "September",
      "awareness",
      "research",
      "support",
      "healthcare"
    ],
    "image": "spinal-cord-injury-month.jpg",
    "relatedDays": [
      "disability-awareness-month",
      "world-spine-day",
      "paralysis-awareness-month"
    ],
    "howToCelebrate": "Support SCI research. Learn about spinal cord injuries. Improve accessibility. Advocate for disability rights. Share survivor stories.",
    "funFacts": [
      "Nearly 300,000 Americans live with SCI",
      "17,000 new cases occur annually in the US",
      "Motor vehicle crashes cause 38% of SCIs",
      "Research is advancing treatment options",
      "Accessibility improvements benefit everyone"
    ]
  },
  {
    "title": "National Hepatitis Awareness Month",
    "slug": "national-hepatitis-awareness-month-may",
    "date": "2026-05-01",
    "category": "Awareness & Health",
    "description": "Test for hepatitis during National Hepatitis Awareness Month! Millions of Americans have hepatitis and don't know it. Testing and treatment prevent liver damage and save lives.",
    "tags": [
      "hepatitis",
      "liver-health",
      "May",
      "awareness",
      "testing",
      "prevention",
      "healthcare"
    ],
    "image": "hepatitis-awareness-month.jpg",
    "relatedDays": [
      "world-hepatitis-day",
      "liver-health-month",
      "viral-hepatitis-testing-day"
    ],
    "howToCelebrate": "Get tested for hepatitis. Learn about hepatitis types. Get vaccinated. Support liver health. Share testing importance.",
    "funFacts": [
      "Over 4 million Americans have hepatitis",
      "Many people don't know they're infected",
      "Hepatitis vaccines prevent infection",
      "Early treatment prevents liver disease",
      "Hepatitis C is now curable"
    ]
  },
  {
    "title": "National Celiac Disease Awareness Month",
    "slug": "national-celiac-disease-awareness-month-may",
    "date": "2026-05-01",
    "category": "Awareness & Health",
    "description": "Go gluten-free awareness during National Celiac Disease Awareness Month! 1 in 100 people have celiac disease, but many are undiagnosed. Awareness improves diagnosis and support for those affected.",
    "tags": [
      "celiac-disease",
      "gluten-free",
      "May",
      "awareness",
      "autoimmune",
      "diet",
      "healthcare"
    ],
    "image": "celiac-disease-awareness-month.jpg",
    "relatedDays": [
      "gluten-free-day",
      "food-allergy-awareness-week",
      "digestive-health-month"
    ],
    "howToCelebrate": "Learn about celiac disease. Support gluten-free options. Get tested if symptomatic. Share celiac information. Advocate for better labeling.",
    "funFacts": [
      "1 in 100 people worldwide have celiac disease",
      "83% of Americans with celiac are undiagnosed",
      "Only treatment is strict gluten-free diet",
      "Celiac is a serious autoimmune disease",
      "Gluten-free market has grown dramatically"
    ]
  },
  {
    "title": "National Scoliosis Awareness Month",
    "slug": "national-scoliosis-awareness-month-june",
    "date": "2026-06-01",
    "category": "Awareness & Health",
    "description": "Stand up straight for National Scoliosis Awareness Month! Scoliosis affects 6-9 million Americans. Early detection through screening allows effective treatment and prevents progression.",
    "tags": [
      "scoliosis",
      "spine-health",
      "June",
      "awareness",
      "children",
      "screening",
      "healthcare"
    ],
    "image": "scoliosis-awareness-month.jpg",
    "relatedDays": [
      "world-spine-day",
      "bone-and-joint-health-week",
      "pediatric-health-month"
    ],
    "howToCelebrate": "Get scoliosis screenings. Learn about scoliosis signs. Support scoliosis research. Share screening importance. Advocate for school screenings.",
    "funFacts": [
      "6-9 million Americans have scoliosis",
      "Most common in adolescent girls",
      "Early detection prevents severe curvature",
      "School screenings identify many cases",
      "Treatment ranges from observation to surgery"
    ]
  },
  {
    "title": "National Healthy Skin Month",
    "slug": "national-healthy-skin-month-november",
    "date": "2026-11-01",
    "category": "Awareness & Health",
    "description": "Protect your skin during National Healthy Skin Month! Skin cancer is the most common cancer in America. Sun protection and skin checks prevent skin cancer and detect it early.",
    "tags": [
      "skin-health",
      "cancer-prevention",
      "November",
      "awareness",
      "sun-safety",
      "dermatology",
      "healthcare"
    ],
    "image": "national-healthy-skin-month-november-optimized.webp",
    "relatedDays": [
      "melanoma-awareness-month",
      "skin-cancer-awareness-month",
      "sun-safety-month"
    ],
    "howToCelebrate": "Get skin cancer screenings. Use sunscreen daily. Perform self-skin checks. Learn about skin health. Share sun protection tips.",
    "funFacts": [
      "1 in 5 Americans will develop skin cancer",
      "Skin cancer is the most common cancer",
      "Daily sunscreen reduces skin cancer risk",
      "Early detection has 99% cure rate",
      "Melanoma is the deadliest skin cancer"
    ]
  },
  {
    "title": "National Lung Cancer Awareness Month",
    "slug": "national-lung-cancer-awareness-month-november",
    "date": "2026-11-01",
    "category": "Awareness & Health",
    "description": "Breathe awareness during National Lung Cancer Awareness Month! Lung cancer kills more Americans than any other cancer. Screening saves lives, and awareness reduces stigma.",
    "tags": [
      "lung-cancer",
      "cancer-awareness",
      "November",
      "screening",
      "prevention",
      "healthcare",
      "awareness"
    ],
    "image": "national-lung-cancer-awareness-month-november-optimized.webp",
    "relatedDays": [
      "world-lung-cancer-day",
      "great-american-smokeout",
      "cancer-awareness-month"
    ],
    "howToCelebrate": "Support lung cancer research. Get screened if high-risk. Learn about early detection. Share screening guidelines. Reduce lung cancer stigma.",
    "funFacts": [
      "Lung cancer is the leading cancer killer",
      "234,000+ new cases diagnosed annually in US",
      "Screening reduces lung cancer deaths by 20%",
      "Anyone with lungs can get lung cancer",
      "Early detection dramatically improves survival"
    ]
  },
  {
    "title": "National Epilepsy Awareness Month",
    "slug": "national-epilepsy-awareness-month-november",
    "date": "2026-11-01",
    "category": "Awareness & Health",
    "description": "Support epilepsy awareness during November! 3.4 million Americans have epilepsy. Awareness reduces stigma, improves treatment access, and teaches seizure first aid.",
    "tags": [
      "epilepsy",
      "neurological",
      "November",
      "awareness",
      "seizures",
      "support",
      "healthcare"
    ],
    "image": "national-epilepsy-awareness-month-november-optimized.webp",
    "relatedDays": [
      "purple-day-epilepsy",
      "brain-awareness-week",
      "neurological-disorders-month"
    ],
    "howToCelebrate": "Learn seizure first aid. Wear purple for epilepsy. Support epilepsy research. Share epilepsy facts. Reduce epilepsy stigma.",
    "funFacts": [
      "3.4 million Americans have epilepsy",
      "1 in 26 people will develop epilepsy",
      "Seizures have many causes",
      "Most people with epilepsy control seizures with treatment",
      "Knowing seizure first aid saves lives"
    ]
  },
  {
    "title": "National Influenza Vaccination Week",
    "slug": "national-influenza-vaccination-week-december",
    "date": "2026-12-07",
    "category": "Awareness & Health",
    "description": "Get your flu shot during National Influenza Vaccination Week! Flu hospitalizes hundreds of thousands annually. Vaccination protects you and vulnerable populations.",
    "tags": [
      "flu",
      "vaccination",
      "December",
      "prevention",
      "public-health",
      "immunization",
      "healthcare"
    ],
    "image": "flu-vaccination-week.jpg",
    "relatedDays": [
      "flu-season",
      "immunization-awareness-month",
      "public-health-week"
    ],
    "howToCelebrate": "Get flu vaccine. Encourage others to vaccinate. Share flu prevention tips. Support public health. Practice good hygiene.",
    "funFacts": [
      "Flu hospitalizes 200,000+ Americans yearly",
      "Flu vaccine reduces illness risk by 40-60%",
      "It's not too late to get vaccinated",
      "Flu vaccine protects you and others",
      "Annual vaccination recommended for everyone 6+ months"
    ]
  },
  {
    "title": "National Hand Washing Awareness Week",
    "slug": "national-hand-washing-awareness-week-december",
    "date": "2026-12-07",
    "category": "Awareness & Health",
    "description": "Scrub up during National Hand Washing Awareness Week! Handwashing is the single most effective way to prevent illness. Proper handwashing prevents millions of infections annually.",
    "tags": [
      "handwashing",
      "hygiene",
      "December",
      "prevention",
      "public-health",
      "infection-control",
      "awareness"
    ],
    "image": "hand-washing-awareness-week.jpg",
    "relatedDays": [
      "global-handwashing-day",
      "flu-season",
      "infection-prevention-week"
    ],
    "howToCelebrate": "Wash hands properly and frequently. Teach children handwashing. Share handwashing techniques. Promote hand hygiene. Prevent illness spread.",
    "funFacts": [
      "Handwashing prevents 1 in 3 diarrheal illnesses",
      "Handwashing prevents 1 in 5 respiratory infections",
      "Most people don't wash hands correctly",
      "Scrub for at least 20 seconds",
      "Simple habit with huge health impact"
    ]
  },
  {
    "title": "National Autism Awareness Month",
    "slug": "national-autism-awareness-month-april",
    "date": "2026-04-01",
    "category": "Awareness & Health",
    "description": "Light it up blue for Autism Awareness Month! April is dedicated to increasing understanding and acceptance of autism spectrum disorder. Learn about autism, support autistic individuals and their families, and promote inclusion and neurodiversity in our communities.",
    "tags": [
      "autism",
      "awareness",
      "April",
      "neurodiversity",
      "acceptance",
      "health",
      "advocacy"
    ],
    "image": "autism-awareness-blue.jpg",
    "relatedDays": [
      "world-autism-day",
      "disability-awareness",
      "special-education-day"
    ],
    "howToCelebrate": "Wear blue to show support. Learn about autism and neurodiversity. Support autism organizations. Listen to autistic voices and perspectives. Promote acceptance and inclusion in your community. Share autism resources on social media.",
    "funFacts": [
      "1 in 36 children in the US are diagnosed with autism",
      "Autism affects all racial, ethnic, and socioeconomic groups",
      "Early intervention can greatly improve outcomes",
      "Autism is a spectrum with diverse strengths and challenges",
      "The puzzle piece has been replaced by the infinity symbol by many advocates"
    ]
  },
  {
    "title": "National Bone Marrow Donor Awareness Month",
    "slug": "national-bone-marrow-donor-awareness-november",
    "date": "2026-11-01",
    "category": "Awareness & Health",
    "description": "Save lives by registering as a bone marrow donor! November raises awareness about the critical need for bone marrow and cord blood donors. Learn how you can become a potential match for someone battling blood cancer or other diseases.",
    "tags": [
      "bone-marrow",
      "donor",
      "November",
      "lifesaving",
      "health",
      "awareness",
      "registry"
    ],
    "image": "national-bone-marrow-donor-awareness-november-optimized.webp",
    "relatedDays": [
      "national-donor-day",
      "leukemia-awareness",
      "blood-cancer-awareness"
    ],
    "howToCelebrate": "Register as a bone marrow donor. Learn about the donation process. Share information about bone marrow donation. Support organizations like Be The Match. Encourage others to register.",
    "funFacts": [
      "Every 3 minutes someone in the US is diagnosed with blood cancer",
      "70% of patients don't have a matching donor in their family",
      "You could be someone's only hope for survival",
      "Registration is simple - just a cheek swab",
      "Donors aged 18-40 are most likely to be chosen"
    ]
  },
  {
    "title": "National Glaucoma Awareness Month",
    "slug": "national-glaucoma-awareness-january",
    "date": "2026-01-01",
    "category": "Awareness & Health",
    "description": "Protect your vision during Glaucoma Awareness Month! January highlights the importance of regular eye exams to detect this silent thief of sight. Glaucoma often has no early symptoms, making awareness and screening critical for prevention.",
    "tags": [
      "glaucoma",
      "eye-health",
      "January",
      "vision",
      "awareness",
      "screening",
      "prevention"
    ],
    "image": "glaucoma-eye-health.jpg",
    "relatedDays": [
      "world-sight-day",
      "eye-health-week",
      "vision-screening-month"
    ],
    "howToCelebrate": "Schedule an eye exam. Learn about glaucoma risk factors. Share eye health information. Support glaucoma research. Remind family members to get screenings.",
    "funFacts": [
      "Glaucoma is the leading cause of irreversible blindness",
      "Over 3 million Americans have glaucoma",
      "Half don't know they have it",
      "Regular eye exams can prevent 90% of vision loss",
      "Everyone over 60 should be screened annually"
    ]
  },
  {
    "title": "National Kidney Month",
    "slug": "national-kidney-month-march",
    "date": "2026-03-01",
    "category": "Awareness & Health",
    "description": "Keep your kidneys healthy! March is National Kidney Month, raising awareness about kidney disease prevention and treatment. Learn how lifestyle choices affect kidney health and the importance of early detection.",
    "tags": [
      "kidney-health",
      "awareness",
      "March",
      "prevention",
      "chronic-disease",
      "health",
      "screening"
    ],
    "image": "kidney-health-awareness.jpg",
    "relatedDays": [
      "world-kidney-day",
      "national-donor-day",
      "diabetes-awareness"
    ],
    "howToCelebrate": "Get your kidney function tested. Learn about kidney-healthy diet. Stay hydrated and exercise. Control blood pressure and blood sugar. Share kidney health information.",
    "funFacts": [
      "37 million American adults have kidney disease",
      "9 in 10 don't know they have it",
      "Diabetes and high blood pressure cause most kidney disease",
      "Your kidneys filter 200 quarts of blood daily",
      "Early detection can slow or prevent kidney failure"
    ]
  },
  {
    "title": "National Migraine and Headache Awareness Month",
    "slug": "national-migraine-headache-awareness-june",
    "date": "2026-06-01",
    "category": "Awareness & Health",
    "description": "Shine a light on migraine! June raises awareness about migraines and chronic headaches that affect millions. Learn about triggers, treatments, and how to support those living with this invisible disability.",
    "tags": [
      "migraine",
      "headache",
      "June",
      "chronic-pain",
      "awareness",
      "health",
      "treatment"
    ],
    "image": "migraine-awareness.jpg",
    "relatedDays": [
      "chronic-pain-awareness",
      "headache-awareness-week",
      "invisible-disabilities-week"
    ],
    "howToCelebrate": "Learn about migraine triggers and treatments. Support migraine research. Share experiences or listen to those with migraines. Wear purple for awareness. Advocate for better migraine care.",
    "funFacts": [
      "Over 39 million Americans suffer from migraines",
      "Migraines are the 3rd most prevalent illness worldwide",
      "Women are 3 times more likely to suffer migraines",
      "Migraines are a neurological disease, not just a headache",
      "Many people with migraines are undiagnosed or undertreated"
    ]
  },
  {
    "title": "National PTSD Awareness Month",
    "slug": "national-ptsd-awareness-june",
    "date": "2026-06-01",
    "category": "Awareness & Health",
    "description": "Support those with PTSD this June! Post-Traumatic Stress Disorder affects millions of veterans, survivors, and trauma victims. Raise awareness, reduce stigma, and promote understanding and treatment of this serious mental health condition.",
    "tags": [
      "PTSD",
      "mental-health",
      "June",
      "trauma",
      "veterans",
      "awareness",
      "treatment"
    ],
    "image": "ptsd-awareness-support.jpg",
    "relatedDays": [
      "veterans-day",
      "mental-health-awareness-month",
      "trauma-awareness"
    ],
    "howToCelebrate": "Learn about PTSD symptoms and treatment. Support veterans organizations. Share mental health resources. Listen to trauma survivors. Promote stigma-free conversations about PTSD.",
    "funFacts": [
      "About 8 million adults have PTSD in a given year",
      "PTSD can develop after any traumatic event",
      "Women are twice as likely as men to develop PTSD",
      "Effective treatments exist including therapy and medication",
      "June 27th is National PTSD Awareness Day"
    ]
  },
  {
    "title": "National Minority Health Month",
    "slug": "national-minority-health-month-april",
    "date": "2026-04-01",
    "category": "Awareness & Health",
    "description": "Address health disparities this April! National Minority Health Month highlights the importance of improving health outcomes in minority communities. Promote health equity, access to care, and culturally competent healthcare.",
    "tags": [
      "health-equity",
      "minority-health",
      "April",
      "disparities",
      "access",
      "awareness",
      "justice"
    ],
    "image": "minority-health-equity.jpg",
    "relatedDays": [
      "health-equity-day",
      "cultural-diversity-month",
      "public-health-week"
    ],
    "howToCelebrate": "Learn about health disparities. Support community health programs. Promote health screenings in underserved communities. Advocate for health equity policies. Share minority health resources.",
    "funFacts": [
      "Health disparities persist across racial and ethnic lines",
      "Minority communities often face barriers to healthcare access",
      "Social determinants greatly impact health outcomes",
      "Cultural competence in healthcare improves outcomes",
      "Addressing disparities benefits everyone's health"
    ]
  },
  {
    "title": "National Healthy Vision Month",
    "slug": "national-healthy-vision-month-may",
    "date": "2026-05-01",
    "category": "Awareness & Health",
    "description": "See the importance of eye health! May promotes vision wellness and eye disease prevention. Schedule comprehensive eye exams, protect your eyes from UV damage, and learn about maintaining healthy vision throughout life.",
    "tags": [
      "vision",
      "eye-health",
      "May",
      "prevention",
      "screening",
      "health",
      "awareness"
    ],
    "image": "healthy-vision-eye-exam.jpg",
    "relatedDays": [
      "world-sight-day",
      "glaucoma-awareness",
      "eye-safety-month"
    ],
    "howToCelebrate": "Schedule a comprehensive eye exam. Wear UV-protective sunglasses. Learn about eye disease prevention. Give your eyes breaks from screens. Share eye health tips.",
    "funFacts": [
      "Over 11 million Americans over 12 need vision correction",
      "Many eye diseases have no early warning signs",
      "UV exposure increases risk of cataracts and other issues",
      "The 20-20-20 rule helps prevent digital eye strain",
      "Regular eye exams can detect overall health problems"
    ]
  },
  {
    "title": "National Distracted Driving Awareness Month",
    "slug": "national-distracted-driving-awareness-april-safety",
    "date": "2026-04-01",
    "category": "Awareness & Health",
    "description": "Put down the phone! April is Distracted Driving Awareness Month. Texting while driving kills thousands annually. Commit to focused, safe driving and save lives.",
    "tags": [
      "driving-safety",
      "awareness",
      "April",
      "distraction",
      "prevention",
      "safety",
      "phones"
    ],
    "image": "distracted-driving-awareness.jpg",
    "relatedDays": [
      "drive-safely-week",
      "teen-driver-safety",
      "seatbelt-awareness"
    ],
    "howToCelebrate": "Put phones away while driving. Use hands-free devices only. Educate teens about driving safety. Share distracted driving statistics. Take a safe driving pledge.",
    "funFacts": [
      "9 people die daily from distracted driving in the US",
      "Texting makes you 23 times more likely to crash",
      "Distracted driving is the leading cause of teen deaths",
      "It takes 5 seconds to read a text - enough to travel a football field at highway speed",
      "Many states have banned handheld phone use while driving"
    ]
  },
  {
    "title": "National Eating Disorders Awareness Week",
    "slug": "national-eating-disorders-awareness-week-february-health",
    "date": "2026-02-24",
    "category": "Awareness & Health",
    "description": "Break the silence! National Eating Disorders Awareness Week educates about eating disorders and promotes early intervention. Millions suffer from anorexia, bulimia, and binge eating - recovery is possible.",
    "tags": [
      "eating-disorders",
      "mental-health",
      "February",
      "awareness",
      "recovery",
      "health",
      "support"
    ],
    "image": "eating-disorders-awareness.jpg",
    "relatedDays": [
      "mental-health-awareness",
      "body-positivity-day",
      "nutrition-month"
    ],
    "howToCelebrate": "Learn about eating disorder signs. Support recovery programs. Promote body positivity. Share resources. Listen to recovery stories. Advocate for mental health care.",
    "funFacts": [
      "30 million Americans will have an eating disorder in their lifetime",
      "Eating disorders have the highest mortality rate of any mental illness",
      "They affect all genders, ages, and backgrounds",
      "Early intervention significantly improves recovery rates",
      "Treatment works and full recovery is possible"
    ]
  },
  {
    "title": "National Childhood Obesity Awareness Month",
    "slug": "national-childhood-obesity-awareness-september-health",
    "date": "2026-09-01",
    "category": "Awareness & Health",
    "description": "Fight childhood obesity! September raises awareness about this serious health crisis affecting millions of American kids. Promote healthy eating, physical activity, and family wellness.",
    "tags": [
      "childhood-obesity",
      "health",
      "September",
      "kids",
      "nutrition",
      "fitness",
      "prevention"
    ],
    "image": "childhood-obesity-awareness.jpg",
    "relatedDays": [
      "national-fitness-day",
      "nutrition-month",
      "family-health-month"
    ],
    "howToCelebrate": "Promote healthy family meals. Encourage kids to play and exercise. Limit screen time. Educate about nutrition. Support healthy school lunch programs. Model healthy habits.",
    "funFacts": [
      "1 in 5 American children are obese",
      "Childhood obesity has tripled since the 1970s",
      "It increases risk of diabetes, heart disease, and other conditions",
      "Healthy habits in childhood lead to healthy adults",
      "Parents' eating habits strongly influence children"
    ]
  },
  {
    "title": "World Diabetes Day",
    "slug": "world-diabetes-day-november-14",
    "date": "2026-11-14",
    "category": "Awareness & Health",
    "description": "Raise diabetes awareness! World Diabetes Day highlights this global health crisis affecting millions. Learn about prevention, management, and supporting those living with diabetes.",
    "tags": [
      "diabetes",
      "health",
      "November",
      "awareness",
      "chronic-disease",
      "prevention",
      "global"
    ],
    "image": "diabetes-awareness.jpg",
    "relatedDays": [
      "american-diabetes-month",
      "world-health-day",
      "chronic-disease-day"
    ],
    "howToCelebrate": "Get screened for diabetes. Learn about prevention. Support diabetes research. Wear blue for awareness. Educate about symptoms. Promote healthy lifestyles.",
    "funFacts": [
      "Over 463 million adults have diabetes worldwide",
      "Type 2 diabetes is largely preventable",
      "Many people have prediabetes and don't know it",
      "Diabetes is a leading cause of blindness and amputation",
      "Proper management allows people with diabetes to live full lives"
    ]
  },
  {
    "title": "National Colorectal Cancer Awareness Month",
    "slug": "national-colorectal-cancer-awareness-march-health",
    "date": "2026-03-01",
    "category": "Awareness & Health",
    "description": "Get screened! March is Colorectal Cancer Awareness Month. Screening saves lives - colon cancer is highly treatable when caught early. Wear blue for awareness!",
    "tags": [
      "colorectal-cancer",
      "awareness",
      "March",
      "screening",
      "health",
      "prevention",
      "blue"
    ],
    "image": "colorectal-cancer-awareness.jpg",
    "relatedDays": [
      "cancer-awareness",
      "screening-awareness",
      "health-month"
    ],
    "howToCelebrate": "Get screened if you're 45+. Learn about screening options. Wear blue. Support cancer research. Share screening importance. Promote healthy diet and exercise.",
    "funFacts": [
      "Third most common cancer in the US",
      "90% survival rate when caught early",
      "Screening recommended starting at age 45",
      "Many cases are preventable with screening",
      "Blue is the official awareness color"
    ]
  },
  {
    "title": "National Eye Exam Month",
    "slug": "national-eye-exam-month-august-vision",
    "date": "2026-08-01",
    "category": "Awareness & Health",
    "description": "See clearly! August is National Eye Exam Month. Regular eye exams detect vision problems and serious eye diseases early. Schedule your annual eye exam!",
    "tags": [
      "eye-exam",
      "vision",
      "August",
      "health",
      "eyes",
      "screening",
      "prevention"
    ],
    "image": "eye-exam-vision.jpg",
    "relatedDays": [
      "healthy-vision-month",
      "glaucoma-awareness",
      "eye-health-day"
    ],
    "howToCelebrate": "Schedule an eye exam. Learn about eye health. Get prescription updated. Educate kids about eye care. Donate old glasses. Support eye health programs.",
    "funFacts": [
      "Many eye diseases have no early symptoms",
      "Children should have regular eye exams",
      "Eye exams can detect diabetes and high blood pressure",
      "Vision changes can indicate health problems",
      "Comprehensive exams check more than just vision"
    ]
  },
  {
    "title": "National Sleep Awareness Week",
    "slug": "national-sleep-awareness-week-march",
    "date": "2026-03-10",
    "category": "Awareness",
    "description": "Prioritize your sleep health during National Sleep Awareness Week! This important week raises awareness about the critical role sleep plays in our physical and mental well-being. Learn about sleep disorders, discover healthy sleep habits, and understand how quality rest impacts every aspect of your life.",
    "tags": [
      "sleep",
      "health",
      "March",
      "wellness",
      "awareness",
      "rest",
      "mental-health"
    ],
    "relatedDays": [
      "national-sleep-day",
      "world-mental-health-day",
      "national-wellness-month"
    ],
    "howToCelebrate": "Establish a consistent sleep schedule and stick to it. Create a relaxing bedtime routine to signal your body it's time to rest. Make your bedroom a sleep-friendly environment - cool, dark, and quiet. Limit screen time before bed. Learn about sleep disorders and when to seek professional help.",
    "funFacts": [
      "Adults need 7-9 hours of sleep per night for optimal health",
      "Sleep deprivation can impair cognitive function as much as alcohol intoxication",
      "Your brain cleans itself during deep sleep, removing toxins",
      "Chronic sleep deprivation increases the risk of obesity, diabetes, and heart disease",
      "Most people need 15-20 minutes to fall asleep - if you fall asleep instantly, you're likely sleep-deprived"
    ]
  },
  {
    "title": "National Kidney Health Month",
    "slug": "national-kidney-health-month-march",
    "date": "2026-03-01",
    "category": "Awareness",
    "description": "Protect your kidneys during National Kidney Health Month! Your kidneys are vital organs that filter waste from your blood. Learn about kidney disease prevention, recognize early warning signs, and discover how to maintain optimal kidney health through diet, exercise, and regular checkups.",
    "tags": [
      "kidney",
      "health",
      "March",
      "awareness",
      "prevention",
      "organ-health",
      "wellness"
    ],
    "relatedDays": [
      "world-kidney-day",
      "national-healthy-eating-day",
      "national-exercise-day"
    ],
    "howToCelebrate": "Schedule a checkup and ask about kidney function tests. Stay hydrated by drinking plenty of water throughout the day. Reduce sodium intake to protect kidney function. Exercise regularly to maintain healthy blood pressure. Learn about risk factors for kidney disease and how to prevent them.",
    "funFacts": [
      "Your kidneys filter about 200 quarts of blood daily",
      "Kidney disease affects over 37 million Americans",
      "High blood pressure and diabetes are the leading causes of kidney disease",
      "Your kidneys produce hormones that regulate blood pressure and red blood cell production",
      "Early kidney disease often has no symptoms, making regular screening important"
    ]
  },
  {
    "title": "National Stress Awareness Month",
    "slug": "national-stress-awareness-month-april",
    "date": "2026-04-01",
    "category": "Awareness",
    "description": "Take control of stress during National Stress Awareness Month! Stress affects everyone, but chronic stress can have serious health consequences. Learn effective stress management techniques, discover healthy coping strategies, and prioritize your mental well-being this month.",
    "tags": [
      "stress",
      "mental-health",
      "April",
      "awareness",
      "wellness",
      "self-care",
      "health"
    ],
    "relatedDays": [
      "world-mental-health-day",
      "national-meditation-day",
      "national-wellness-month"
    ],
    "howToCelebrate": "Practice stress-reduction techniques like meditation, deep breathing, or yoga. Identify your stress triggers and develop healthy coping strategies. Make time for activities you enjoy and that help you relax. Connect with friends and family for social support. Consider talking to a mental health professional if stress is overwhelming.",
    "funFacts": [
      "Chronic stress can weaken your immune system and increase disease risk",
      "Exercise is one of the most effective ways to reduce stress",
      "Stress can cause physical symptoms like headaches, muscle tension, and digestive issues",
      "Laughing releases endorphins that help combat stress",
      "Chronic stress can contribute to anxiety, depression, and other mental health conditions"
    ]
  },
  {
    "title": "National Skin Cancer Awareness Month",
    "slug": "national-skin-cancer-awareness-month-may",
    "date": "2026-05-01",
    "category": "Awareness",
    "description": "Protect your skin during National Skin Cancer Awareness Month! Skin cancer is the most common cancer in the United States, but it's also highly preventable. Learn about sun safety, recognize warning signs, and take steps to protect yourself and your loved ones from harmful UV radiation.",
    "tags": [
      "skin-cancer",
      "cancer",
      "May",
      "awareness",
      "prevention",
      "sun-safety",
      "health"
    ],
    "relatedDays": [
      "national-melanoma-day",
      "national-sun-safety-week",
      "cancer-awareness-day"
    ],
    "howToCelebrate": "Schedule a skin check with a dermatologist. Learn the ABCDEs of melanoma detection. Always wear sunscreen with SPF 30 or higher when outdoors. Wear protective clothing, hats, and sunglasses. Avoid tanning beds and seek shade during peak sun hours (10 AM - 4 PM).",
    "funFacts": [
      "One in five Americans will develop skin cancer by age 70",
      "Melanoma is the deadliest form of skin cancer but highly treatable when caught early",
      "UV radiation from tanning beds is classified as a human carcinogen",
      "Just one blistering sunburn in childhood doubles your risk of melanoma",
      "Regular use of SPF 15 sunscreen can reduce your risk of melanoma by 50%"
    ]
  }
]