[
  {
    "title": "Columbus Day",
    "slug": "columbus-day",
    "date": "2026-10-13",
    "category": "Holiday",
    "description": "Commemorate Christopher Columbus' historic voyage to the Americas on Columbus Day. This federal holiday marks the anniversary of Columbus' landing in 1492, celebrating Italian-American heritage and the spirit of exploration. Learn about the historical significance, discover local parades and festivals, and explore the complex legacy of this pivotal moment in world history.",
    "tags": [
      "holiday",
      "history",
      "October",
      "exploration",
      "italian-american",
      "columbus",
      "federal"
    ],
    "image": "columbus-day-parade.jpg",
    "relatedDays": [
      "indigenous-peoples-day",
      "leif-erikson-day",
      "veterans-day"
    ],
    "howToCelebrate": "Attend local Columbus Day parades and festivals celebrating Italian-American culture. Visit museums or historical sites related to exploration and maritime history. Learn about the complex history of European exploration and its impact on indigenous peoples. Enjoy Italian-American cuisine and cultural events. Read books or watch documentaries about the Age of Exploration.",
    "funFacts": [
      "Columbus never actually set foot on mainland North America",
      "His ships were the Niña, Pinta, and Santa María",
      "Columbus Day became a federal holiday in 1937",
      "Many states now celebrate Indigenous Peoples' Day instead",
      "Columbus made four voyages to the Americas between 1492 and 1504"
    ]
  },
  {
    "title": "Halloween",
    "slug": "halloween",
    "date": "2026-10-31",
    "category": "Holiday",
    "description": "Get ready for the spookiest night of the year! Halloween brings out the kid in all of us with costumes, trick-or-treating, haunted houses, and pumpkin carving. From ancient Celtic traditions to modern celebrations, discover the rich history behind this beloved holiday. Whether you're planning a party, decorating your home, or just enjoying some candy, Halloween is all about fun, creativity, and a little bit of fright!",
    "tags": [
      "halloween",
      "costumes",
      "October",
      "trick-or-treat",
      "pumpkins",
      "spooky",
      "celebration"
    ],
    "image": "halloween-optimized.webp",
    "relatedDays": [
      "day-of-the-dead",
      "all-saints-day",
      "national-pumpkin-day"
    ],
    "howToCelebrate": "Carve pumpkins with creative designs and display them on your porch. Dress up in costumes and go trick-or-treating or attend a Halloween party. Decorate your home with spooky decorations like cobwebs, skeletons, and jack-o'-lanterns. Watch classic horror movies or family-friendly Halloween films. Visit a haunted house or corn maze for thrills. Hand out candy to trick-or-treaters in your neighborhood.",
    "funFacts": [
      "Halloween originated from the ancient Celtic festival of Samhain over 2,000 years ago",
      "Americans spend over $9 billion on Halloween each year",
      "The largest pumpkin ever recorded weighed 2,624 pounds",
      "Black cats were once believed to be witches' familiars",
      "The tradition of trick-or-treating began in medieval Europe"
    ]
  },
  {
    "title": "Veterans Day",
    "slug": "veterans-day",
    "date": "2026-11-11",
    "category": "Holiday",
    "description": "Honor those who served our country on Veterans Day! This federal holiday pays tribute to all American military veterans who have bravely served in the armed forces. Attend local ceremonies, visit veterans' memorials, or simply thank a veteran for their service. Learn about the history of this important day and discover ways to support veterans in your community.",
    "tags": [
      "veterans",
      "military",
      "November",
      "honor",
      "service",
      "federal-holiday",
      "gratitude"
    ],
    "image": "veterans-day-optimized.webp",
    "relatedDays": [
      "memorial-day",
      "armed-forces-day",
      "national-military-appreciation-month"
    ],
    "howToCelebrate": "Attend a Veterans Day parade or ceremony in your community. Visit a veterans' memorial or cemetery to pay your respects. Thank veterans you know personally for their service. Donate to organizations that support veterans and their families. Learn about the history of Veterans Day and the sacrifices made by military personnel. Fly the American flag at half-mast until noon, then full-staff.",
    "funFacts": [
      "Veterans Day was originally called Armistice Day and marked the end of World War I",
      "The date November 11th was chosen because WWI ended on the 11th hour of the 11th day of the 11th month",
      "There are over 18 million veterans living in the United States today",
      "Veterans Day became a federal holiday in 1938",
      "The holiday was temporarily moved to the fourth Monday in October from 1971-1977"
    ]
  },
  {
    "title": "Thanksgiving Day",
    "slug": "thanksgiving-day",
    "date": "2026-11-27",
    "category": "Holiday",
    "description": "Gather with family and friends to give thanks on Thanksgiving Day! This beloved American holiday is all about gratitude, delicious food, and spending quality time with loved ones. From the traditional turkey dinner to football games and parades, Thanksgiving brings communities together to celebrate the blessings in our lives. Discover new recipes, learn about the holiday's history, and create lasting memories.",
    "tags": [
      "thanksgiving",
      "gratitude",
      "November",
      "family",
      "turkey",
      "tradition",
      "celebration"
    ],
    "image": "thanksgiving-dinner.jpg",
    "relatedDays": [
      "black-friday",
      "cyber-monday",
      "national-turkey-day"
    ],
    "howToCelebrate": "Prepare a traditional Thanksgiving feast with turkey, stuffing, cranberry sauce, and pumpkin pie. Go around the table and share what you're grateful for this year. Watch the Macy's Thanksgiving Day Parade or football games. Volunteer at a local food bank or homeless shelter. Take a family walk or play outdoor games together. Send thank-you notes to people who have made a difference in your life.",
    "funFacts": [
      "The first Thanksgiving was celebrated in 1621 and lasted three days",
      "Americans eat about 46 million turkeys on Thanksgiving",
      "The Macy's Thanksgiving Day Parade started in 1924",
      "Thanksgiving became a national holiday in 1863 when Abraham Lincoln declared it",
      "The average Thanksgiving meal contains about 3,000 calories"
    ]
  },
  {
    "title": "Hanukkah 2026",
    "slug": "hanukkah-2026",
    "date": "2026-12-25",
    "category": "Holiday",
    "description": "Celebrate the Festival of Lights! Hanukkah commemorates the miracle of the oil that lasted eight days in the ancient Temple. Light the menorah, enjoy traditional foods like latkes and sufganiyot, play dreidel games, and exchange gifts with family and friends. Learn about the rich traditions, history, and meaning behind this beautiful Jewish holiday that brings light and joy to the darkest time of year.",
    "tags": [
      "hanukkah",
      "jewish",
      "December",
      "lights",
      "menorah",
      "tradition",
      "miracle"
    ],
    "image": "hanukkah-menorah.jpg",
    "relatedDays": [
      "christmas-day",
      "kwanzaa",
      "winter-solstice"
    ],
    "howToCelebrate": "Light the menorah each night for eight nights, adding one candle each day. Enjoy traditional Hanukkah foods like latkes (potato pancakes) and sufganiyot (jelly donuts). Play dreidel games with family and friends. Exchange small gifts each night of Hanukkah. Learn about the history and meaning of Hanukkah through books or online resources. Attend community Hanukkah celebrations or host your own.",
    "funFacts": [
      "Hanukkah means 'dedication' in Hebrew",
      "The holiday commemorates the rededication of the Second Temple in Jerusalem",
      "Hanukkah lasts for eight days and nights",
      "The menorah used during Hanukkah is called a hanukkiah and has nine branches",
      "Hanukkah is not mentioned in the Hebrew Bible but is described in the Talmud"
    ]
  },
  {
    "title": "Christmas Eve",
    "slug": "christmas-eve",
    "date": "2026-12-24",
    "category": "Holiday",
    "description": "The magic is in the air on Christmas Eve! This special night is filled with anticipation, wonder, and the joy of giving. From hanging stockings and leaving cookies for Santa to attending midnight mass or enjoying a quiet family dinner, Christmas Eve traditions vary but all share the same spirit of love and togetherness. Create lasting memories and embrace the wonder of the season.",
    "tags": [
      "christmas-eve",
      "christmas",
      "December",
      "eve",
      "santa",
      "traditions",
      "family"
    ],
    "image": "christmas-eve-magic.jpg",
    "relatedDays": [
      "christmas-day",
      "hanukkah-2026",
      "new-years-eve"
    ],
    "howToCelebrate": "Hang stockings by the fireplace and leave cookies and milk for Santa. Attend Christmas Eve church services or watch them online. Enjoy a special family dinner together. Read Christmas stories or watch classic holiday movies. Drive around to look at Christmas light displays in your neighborhood. Spend quality time with loved ones and create new traditions.",
    "funFacts": [
      "Christmas Eve is celebrated on December 24th in most Western countries",
      "The tradition of hanging stockings comes from the story of St. Nicholas",
      "Many families open one present on Christmas Eve",
      "Christmas Eve is often considered more important than Christmas Day in some cultures",
      "The tradition of leaving cookies for Santa started in the 1930s"
    ]
  },
  {
    "title": "Christmas Day",
    "slug": "christmas-day",
    "date": "2026-12-25",
    "category": "Holiday",
    "description": "Merry Christmas! Celebrate the most wonderful time of the year with family, friends, and the joy of giving. From opening presents under the tree to enjoying a festive feast, Christmas Day is about love, gratitude, and creating precious memories. Whether you're celebrating the religious significance or simply enjoying the magic of the season, may your day be filled with peace, joy, and happiness.",
    "tags": [
      "christmas",
      "holiday",
      "December",
      "gifts",
      "family",
      "celebration",
      "joy"
    ],
    "image": "christmas-day-celebration.jpg",
    "relatedDays": [
      "christmas-eve",
      "boxing-day",
      "new-years-eve"
    ],
    "howToCelebrate": "Wake up early to open presents with family and friends. Attend Christmas church services or watch them online. Prepare and enjoy a traditional Christmas dinner with loved ones. Watch classic Christmas movies like 'It's a Wonderful Life' or 'A Christmas Story'. Call or video chat with family members who can't be there in person. Give back by volunteering at a soup kitchen or donating to charity.",
    "funFacts": [
      "Christmas trees were first decorated in 16th century Germany",
      "Santa Claus is based on Saint Nicholas, a 4th-century Greek bishop",
      "The first Christmas card was sent in 1843",
      "Rudolph the Red-Nosed Reindeer was created for a department store in 1939",
      "Christmas is celebrated by over 2 billion people worldwide"
    ]
  },
  {
    "title": "New Year's Eve",
    "slug": "new-years-eve",
    "date": "2026-12-31",
    "category": "Holiday",
    "description": "Ring in the New Year with style and celebration! New Year's Eve is the perfect time to reflect on the past year and look forward to new beginnings. From glamorous parties and fireworks displays to quiet gatherings with loved ones, celebrate the end of one year and the start of another. Make resolutions, count down to midnight, and toast to new possibilities and fresh starts.",
    "tags": [
      "new-years-eve",
      "celebration",
      "December",
      "midnight",
      "fireworks",
      "resolution",
      "party"
    ],
    "image": "new-years-eve-celebration.jpg",
    "relatedDays": [
      "new-years-day",
      "christmas-day",
      "national-champagne-day"
    ],
    "howToCelebrate": "Attend a New Year's Eve party or host your own celebration with friends and family. Watch the ball drop in Times Square or find a local fireworks display. Make New Year's resolutions and write them down. Toast with champagne or sparkling cider at midnight. Reflect on the past year and set goals for the new one. Share a kiss with someone special at midnight for good luck.",
    "funFacts": [
      "The Times Square ball drop tradition started in 1907",
      "The first New Year's Eve celebration was held in ancient Babylon 4,000 years ago",
      "Eating black-eyed peas on New Year's Eve is thought to bring good luck",
      "The tradition of making resolutions dates back to ancient Rome",
      "New Year's Eve is celebrated at different times around the world due to time zones"
    ]
  },
  {
    "title": "Presidents Day",
    "slug": "presidents-day",
    "date": "2026-02-17",
    "category": "Holiday",
    "description": "Honor the legacy of American presidents on Presidents Day! This federal holiday celebrates the contributions and leadership of all U.S. presidents, with special recognition for George Washington and Abraham Lincoln. Learn about presidential history, visit historical sites, and reflect on the importance of leadership and public service in American democracy.",
    "tags": [
      "presidents",
      "american-history",
      "February",
      "federal-holiday",
      "leadership",
      "democracy",
      "patriotic"
    ],
    "image": "presidents-day-celebration.jpg",
    "relatedDays": [
      "independence-day",
      "constitution-day",
      "memorial-day"
    ],
    "howToCelebrate": "Visit presidential libraries, monuments, or historical sites. Read biographies of American presidents and learn about their contributions. Watch documentaries about presidential history and American government. Attend local Presidents Day events and parades. Discuss the importance of civic engagement and democratic values.",
    "funFacts": [
      "Presidents Day was originally established to honor George Washington's birthday",
      "It's officially called 'Washington's Birthday' at the federal level",
      "The holiday was moved to the third Monday in February in 1971",
      "Four U.S. presidents were born in February: Washington, Lincoln, Reagan, and Harrison",
      "Mount Rushmore features four presidents: Washington, Jefferson, Roosevelt, and Lincoln"
    ]
  },
  {
    "title": "Labor Day",
    "slug": "labor-day",
    "date": "2026-09-01",
    "category": "Holiday",
    "description": "Celebrate the contributions of workers and the labor movement on Labor Day! This federal holiday honors the achievements of American workers and their role in building the nation's strength and prosperity. From its origins in the labor movement to modern celebrations, Labor Day marks the unofficial end of summer and recognizes the dignity of work.",
    "tags": [
      "labor",
      "workers",
      "September",
      "federal-holiday",
      "employment",
      "unions",
      "summer-end"
    ],
    "image": "labor-day-workers-celebration.jpg",
    "relatedDays": [
      "national-employee-appreciation-day",
      "international-workers-day",
      "national-boss-day"
    ],
    "howToCelebrate": "Attend local Labor Day parades and festivals. Take time to appreciate the hard work of essential workers in your community. Learn about the history of the labor movement and workers' rights. Enjoy end-of-summer activities like barbecues, picnics, or beach trips. Support worker-friendly businesses and fair labor practices.",
    "funFacts": [
      "Labor Day was first celebrated in 1882 in New York City",
      "It became a federal holiday in 1894 after the Pullman Strike",
      "Labor Day is celebrated on the first Monday in September",
      "It traditionally marks the end of summer and the start of the school year",
      "The first Labor Day parade had 10,000 workers marching in New York"
    ]
  },
  {
    "title": "Martin Luther King Jr. Day",
    "slug": "martin-luther-king-jr-day",
    "date": "2026-01-20",
    "category": "Holiday",
    "description": "Honor the legacy of civil rights leader Dr. Martin Luther King Jr. on this federal holiday! This day celebrates Dr. King's contributions to the civil rights movement and his dream of equality and justice for all. Reflect on his powerful message of nonviolent resistance, love, and unity while continuing the work toward a more just and equitable society.",
    "tags": [
      "martin-luther-king",
      "civil-rights",
      "January",
      "federal-holiday",
      "equality",
      "justice",
      "legacy"
    ],
    "image": "martin-luther-king-jr-day.jpg",
    "relatedDays": [
      "black-history-month",
      "international-human-rights-day",
      "national-freedom-day"
    ],
    "howToCelebrate": "Participate in community service projects and volunteer activities. Attend MLK Day events, marches, or educational programs. Read Dr. King's speeches and writings, especially 'I Have a Dream'. Support civil rights organizations and social justice causes. Reflect on progress made and work still needed for equality.",
    "funFacts": [
      "MLK Day became a federal holiday in 1983, first observed in 1986",
      "It's the only federal holiday designated as a National Day of Service",
      "Dr. King was the youngest person to receive the Nobel Peace Prize at age 35",
      "His 'I Have a Dream' speech was largely improvised",
      "All 50 states officially observe MLK Day as a holiday"
    ]
  },
  {
    "title": "Memorial Day",
    "slug": "memorial-day",
    "date": "2026-05-26",
    "category": "Holiday",
    "description": "Honor and remember the brave men and women who died serving in the U.S. military on Memorial Day. This solemn federal holiday is a time to reflect on the ultimate sacrifice made by service members to protect our freedoms. From visiting cemeteries to participating in parades, join in remembering those who gave their lives for our country.",
    "tags": [
      "memorial-day",
      "military",
      "May",
      "federal-holiday",
      "sacrifice",
      "remembrance",
      "veterans"
    ],
    "image": "memorial-day-remembrance.jpg",
    "relatedDays": [
      "veterans-day",
      "independence-day",
      "armed-forces-day"
    ],
    "howToCelebrate": "Visit national cemeteries or memorials to honor fallen service members. Participate in Memorial Day parades and ceremonies. Place flags or flowers on veterans' graves. Support military families and veteran organizations. Take a moment of silence at 3 PM for the National Moment of Remembrance.",
    "funFacts": [
      "Memorial Day was originally called Decoration Day",
      "It originated after the Civil War to honor Union soldiers",
      "The holiday was moved to the last Monday in May in 1971",
      "Wearing red poppies on Memorial Day honors fallen soldiers",
      "The National Moment of Remembrance occurs at 3 PM local time"
    ]
  },
  {
    "title": "Independence Day",
    "slug": "independence-day",
    "date": "2026-07-04",
    "category": "Holiday",
    "description": "Celebrate America's birthday on Independence Day! This patriotic federal holiday commemorates the adoption of the Declaration of Independence on July 4, 1776, marking the birth of the United States of America. From fireworks and parades to barbecues and family gatherings, join in celebrating freedom, democracy, and the American spirit.",
    "tags": [
      "independence-day",
      "america",
      "July",
      "patriotic",
      "freedom",
      "fireworks",
      "celebration"
    ],
    "image": "fourth-of-july-fireworks.jpg",
    "relatedDays": [
      "flag-day",
      "constitution-day",
      "memorial-day"
    ],
    "howToCelebrate": "Watch fireworks displays and attend local parades. Host or attend a patriotic barbecue with friends and family. Display the American flag and wear red, white, and blue. Learn about American history and the founding fathers. Participate in community Independence Day events and festivals.",
    "funFacts": [
      "The Declaration of Independence was actually signed on August 2, 1776",
      "Americans consume 150 million hot dogs on July 4th",
      "Three U.S. presidents died on July 4th: Adams, Jefferson, and Monroe",
      "The first Fourth of July celebration at the White House was in 1801",
      "Americans spend over $1 billion on fireworks each year"
    ]
  },
  {
    "title": "Earth Day",
    "slug": "earth-day",
    "date": "2026-04-22",
    "category": "Holiday",
    "description": "Show love for our planet on Earth Day! This global environmental movement encourages people to take action to protect the environment and address climate change. From tree planting to beach cleanups, Earth Day is about making positive changes for our planet and inspiring others to join the fight for a cleaner, healthier world.",
    "tags": [
      "earth-day",
      "environment",
      "April",
      "sustainability",
      "conservation",
      "climate",
      "planet"
    ],
    "image": "earth-day-environmental-action.jpg",
    "relatedDays": [
      "world-environment-day",
      "national-recycling-day",
      "arbor-day"
    ],
    "howToCelebrate": "Participate in local environmental cleanup activities. Plant trees or start a garden with native plants. Reduce energy consumption and adopt eco-friendly practices. Learn about climate change and environmental issues. Support environmental organizations and green initiatives.",
    "funFacts": [
      "The first Earth Day was celebrated on April 22, 1970",
      "Over 1 billion people participate in Earth Day activities worldwide",
      "Earth Day led to the creation of the EPA and major environmental laws",
      "The Earth Day flag features a photo of Earth from space",
      "Earth Day is now celebrated in more than 190 countries"
    ]
  },
  {
    "title": "Flag Day",
    "slug": "flag-day",
    "date": "2026-06-14",
    "category": "Holiday",
    "description": "Honor the Stars and Stripes on Flag Day! This patriotic observance commemorates the adoption of the American flag on June 14, 1777. Learn about flag history, proper flag etiquette, and the symbolism behind the red, white, and blue. Display your flag proudly and reflect on what it represents - freedom, unity, and the American spirit.",
    "tags": [
      "flag-day",
      "patriotic",
      "June",
      "american-flag",
      "history",
      "symbols",
      "pride"
    ],
    "image": "american-flag-display.jpg",
    "relatedDays": [
      "independence-day",
      "memorial-day",
      "veterans-day"
    ],
    "howToCelebrate": "Display the American flag at your home or business. Learn about proper flag etiquette and care. Attend Flag Day ceremonies or parades in your community. Teach children about the flag's history and symbolism. Share patriotic messages and flag facts on social media.",
    "funFacts": [
      "The current 50-star flag was designed by a 17-year-old high school student",
      "The flag has been modified 27 times since 1777",
      "Flag Day became a national observance in 1916",
      "The flag should never touch the ground",
      "Betsy Ross is often credited with sewing the first American flag"
    ]
  },
  {
    "title": "Arbor Day",
    "slug": "arbor-day",
    "date": "2026-04-25",
    "category": "Holiday",
    "description": "Plant trees and celebrate nature on Arbor Day! This environmental holiday encourages tree planting and forest conservation. Trees provide oxygen, clean air and water, prevent erosion, and create habitats for wildlife. Join community tree-planting events and learn about the vital role trees play in maintaining a healthy environment.",
    "tags": [
      "arbor-day",
      "trees",
      "April",
      "environment",
      "planting",
      "conservation",
      "nature"
    ],
    "image": "tree-planting-arbor-day.jpg",
    "relatedDays": [
      "earth-day",
      "world-environment-day",
      "national-forest-week"
    ],
    "howToCelebrate": "Plant a tree in your yard or participate in community tree-planting events. Learn about different tree species and their benefits. Support forest conservation organizations. Teach children about the importance of trees and forests. Share tree facts and environmental tips on social media.",
    "funFacts": [
      "Arbor Day was first celebrated in Nebraska in 1872",
      "Over 1 million trees were planted on the first Arbor Day",
      "A single tree can absorb 48 pounds of CO2 per year",
      "Trees can increase property values by up to 15%",
      "The world loses about 18.7 million acres of forest annually"
    ]
  },
  {
    "title": "Juneteenth",
    "slug": "juneteenth",
    "date": "2026-06-19",
    "category": "Holiday",
    "description": "Celebrate freedom and African American culture on Juneteenth! This federal holiday commemorates the end of slavery in the United States, marking when news of emancipation reached Texas on June 19, 1865. Learn about this important moment in American history, celebrate African American achievements, and reflect on the ongoing journey toward equality and justice.",
    "tags": [
      "juneteenth",
      "freedom",
      "June",
      "emancipation",
      "african-american",
      "history",
      "celebration"
    ],
    "image": "juneteenth-celebration.jpg",
    "relatedDays": [
      "martin-luther-king-jr-day",
      "black-history-month",
      "emancipation-proclamation-day"
    ],
    "howToCelebrate": "Attend Juneteenth festivals and celebrations in your community. Learn about African American history and the end of slavery. Support Black-owned businesses and organizations. Read books by African American authors. Share the history and significance of Juneteenth on social media.",
    "funFacts": [
      "Juneteenth became a federal holiday in 2021",
      "Texas was the first state to make Juneteenth an official holiday in 1980",
      "The Emancipation Proclamation was signed in 1863, but news didn't reach Texas until 1865",
      "Juneteenth is also known as Freedom Day or Emancipation Day",
      "Traditional Juneteenth foods include red drinks and foods symbolizing resilience"
    ]
  },
  {
    "title": "Valentine's Day",
    "slug": "valentines-day",
    "date": "2026-02-14",
    "category": "Holiday",
    "description": "Celebrate love and romance on Valentine's Day! This beloved holiday is all about expressing affection for the special people in your life. From romantic dinners to heartfelt gifts, Valentine's Day reminds us to cherish our relationships and show appreciation for those we love most.",
    "tags": [
      "valentines",
      "love",
      "February",
      "romance",
      "hearts",
      "relationships",
      "celebration"
    ],
    "image": "valentines-day-romance.jpg",
    "relatedDays": [
      "national-chocolate-day",
      "national-roses-day",
      "national-kiss-day"
    ],
    "howToCelebrate": "Plan a special date or romantic evening with your partner. Send Valentine's cards to friends and family. Give thoughtful gifts that show you care. Cook a special meal or order from a favorite restaurant. Express your love and appreciation for the important people in your life.",
    "funFacts": [
      "Valentine's Day is named after Saint Valentine, a Roman priest",
      "Americans spend about $20 billion on Valentine's Day gifts each year",
      "The first Valentine's Day card was sent in 1415",
      "Teachers receive the most Valentine's Day cards",
      "The heart shape was first used as a symbol of love in the 13th century"
    ]
  },
  {
    "title": "New Year's Day",
    "slug": "new-years-day",
    "date": "2026-01-01",
    "category": "Holiday",
    "description": "Ring in the new year with hope and celebration on New Year's Day! This global holiday marks the beginning of a fresh year and symbolizes new beginnings, resolutions, and opportunities. Whether you're making resolutions or simply celebrating with loved ones, embrace the promise of a new year ahead.",
    "tags": [
      "new-year",
      "celebration",
      "January",
      "fresh-start",
      "resolutions",
      "hope",
      "global"
    ],
    "image": "new-years-day-celebration.jpg",
    "relatedDays": [
      "new-years-eve",
      "national-resolution-day",
      "national-hangover-day"
    ],
    "howToCelebrate": "Make New Year's resolutions and set goals for the year ahead. Spend time with family and friends. Watch the Rose Parade or other New Year's celebrations. Reflect on the past year and plan for the future. Start new traditions or continue beloved ones.",
    "funFacts": [
      "New Year's Day is celebrated on January 1st in most countries",
      "The Times Square ball drop tradition started in 1907",
      "About 45% of Americans make New Year's resolutions",
      "The most popular resolution is to exercise more",
      "New Year's Day is a federal holiday in the United States"
    ]
  },
  {
    "title": "St. Patrick's Day",
    "slug": "st-patricks-day",
    "date": "2026-03-17",
    "category": "Holiday",
    "description": "Wear green and celebrate Irish culture on St. Patrick's Day! This festive holiday honors Saint Patrick, the patron saint of Ireland, and has become a global celebration of Irish heritage. From parades and traditional music to green beer and shamrocks, join in the fun and embrace the luck of the Irish!",
    "tags": [
      "st-patricks",
      "irish",
      "March",
      "green",
      "celebration",
      "heritage",
      "festive"
    ],
    "image": "st-patricks-day-parade.jpg",
    "relatedDays": [
      "national-irish-coffee-day",
      "national-green-day",
      "irish-heritage-month"
    ],
    "howToCelebrate": "Wear green clothing and accessories. Attend St. Patrick's Day parades and festivals. Enjoy traditional Irish food and drinks. Learn about Irish culture and history. Share St. Patrick's Day photos and celebrations on social media.",
    "funFacts": [
      "St. Patrick's Day was originally a religious holiday in Ireland",
      "The first St. Patrick's Day parade was held in New York City in 1762",
      "The Chicago River is dyed green every St. Patrick's Day",
      "St. Patrick is said to have driven snakes out of Ireland",
      "The shamrock is a symbol of Ireland and the Holy Trinity"
    ]
  },
  {
    "title": "Easter",
    "slug": "easter",
    "date": "2026-04-20",
    "category": "Holiday",
    "description": "Celebrate renewal and new beginnings on Easter! This important Christian holiday commemorates the resurrection of Jesus Christ and is also celebrated as a spring festival of rebirth and renewal. From Easter eggs and bunnies to church services and family gatherings, embrace the joy and hope of this special season.",
    "tags": [
      "easter",
      "spring",
      "April",
      "renewal",
      "family",
      "celebration",
      "hope"
    ],
    "image": "easter-celebration-spring.jpg",
    "relatedDays": [
      "good-friday",
      "easter-monday",
      "national-egg-day"
    ],
    "howToCelebrate": "Attend Easter services or spend time in reflection. Participate in Easter egg hunts with family and children. Prepare traditional Easter meals and treats. Decorate Easter eggs and create spring crafts. Share Easter joy and spring photos on social media.",
    "funFacts": [
      "Easter is celebrated on the first Sunday after the first full moon of spring",
      "The Easter Bunny tradition originated in Germany",
      "Americans consume over 16 billion jelly beans at Easter",
      "The largest Easter egg hunt had over 500,000 eggs",
      "Easter is the most important Christian holiday"
    ]
  },
  {
    "title": "Groundhog Day",
    "slug": "groundhog-day",
    "date": "2026-02-02",
    "category": "Holiday",
    "description": "Will he see his shadow? Celebrate Groundhog Day, America's quirky weather-predicting tradition! This beloved American holiday centers around Punxsutawney Phil and his annual weather forecast. From Pennsylvania to your local celebrations, join in the fun of this unique American tradition that brings communities together each February.",
    "tags": [
      "groundhog-day",
      "weather",
      "February",
      "american-tradition",
      "punxsutawney-phil",
      "winter",
      "spring"
    ],
    "image": "groundhog-day-punxsutawney-phil.jpg",
    "relatedDays": [
      "national-hedgehog-day",
      "spring-equinox",
      "winter-solstice"
    ],
    "howToCelebrate": "Watch the live Groundhog Day ceremony from Punxsutawney, Pennsylvania. Host a Groundhog Day party with weather-themed activities. Learn about the history and folklore of Groundhog Day. Visit local Groundhog Day celebrations in your area. Share Groundhog Day predictions and fun facts on social media.",
    "funFacts": [
      "Groundhog Day has been celebrated in Punxsutawney since 1887",
      "Punxsutawney Phil has been predicting weather for over 130 years",
      "The tradition comes from German immigrants who brought Candlemas Day customs",
      "If the groundhog sees his shadow, there will be 6 more weeks of winter",
      "The movie 'Groundhog Day' made this holiday famous worldwide"
    ]
  },
  {
    "title": "Super Bowl Sunday",
    "slug": "super-bowl-sunday",
    "date": "2026-02-09",
    "category": "Holiday",
    "description": "Get ready for the biggest sports event in America on Super Bowl Sunday! This unofficial American holiday brings families and friends together for football, food, and commercials. From the big game to the halftime show, Super Bowl Sunday is about more than just football - it's about community, tradition, and the American spirit of competition.",
    "tags": [
      "super-bowl",
      "football",
      "February",
      "american-sports",
      "party",
      "tradition",
      "competition"
    ],
    "image": "super-bowl-celebration-party.jpg",
    "relatedDays": [
      "national-football-day",
      "national-wings-day",
      "national-beer-day"
    ],
    "howToCelebrate": "Host or attend a Super Bowl party with friends and family. Prepare traditional Super Bowl foods like wings, nachos, and chili. Watch the game, halftime show, and commercials. Participate in Super Bowl squares or other betting pools. Share your Super Bowl predictions and party photos on social media.",
    "funFacts": [
      "Super Bowl Sunday is the second-largest food consumption day in America after Thanksgiving",
      "Americans consume over 1.25 billion chicken wings on Super Bowl Sunday",
      "The first Super Bowl was played in 1967 between the Packers and Chiefs",
      "Super Bowl commercials cost millions of dollars for just 30 seconds",
      "The halftime show has featured some of the biggest names in music"
    ]
  },
  {
    "title": "Mother's Day",
    "slug": "mothers-day",
    "date": "2026-05-11",
    "category": "Holiday",
    "description": "Honor the amazing women who raised us on Mother's Day! This beloved American holiday celebrates mothers, grandmothers, and mother figures who have shaped our lives. From breakfast in bed to heartfelt cards, show your appreciation for the unconditional love, sacrifice, and guidance that mothers provide every day.",
    "tags": [
      "mothers-day",
      "family",
      "May",
      "appreciation",
      "love",
      "celebration",
      "gratitude"
    ],
    "image": "mothers-day-celebration.jpg",
    "relatedDays": [
      "fathers-day",
      "grandparents-day",
      "national-family-day"
    ],
    "howToCelebrate": "Spend quality time with your mother or mother figure. Give thoughtful gifts, cards, or flowers. Prepare a special meal or take her out to dinner. Call or video chat with your mom if you can't be together. Share memories and photos of your mother on social media.",
    "funFacts": [
      "Mother's Day was officially established in 1914 by President Woodrow Wilson",
      "Anna Jarvis created Mother's Day to honor her own mother",
      "Americans spend over $25 billion on Mother's Day gifts each year",
      "Mother's Day is celebrated in over 50 countries worldwide",
      "The most popular Mother's Day gift is flowers, followed by greeting cards"
    ]
  },
  {
    "title": "Father's Day",
    "slug": "fathers-day",
    "date": "2026-06-15",
    "category": "Holiday",
    "description": "Celebrate the dads who make a difference on Father's Day! This special American holiday honors fathers, grandfathers, and father figures who have guided, supported, and loved us. From grilling together to sharing stories, show your appreciation for the wisdom, strength, and love that fathers bring to our lives.",
    "tags": [
      "fathers-day",
      "family",
      "June",
      "appreciation",
      "dads",
      "celebration",
      "gratitude"
    ],
    "image": "fathers-day-celebration.jpg",
    "relatedDays": [
      "mothers-day",
      "grandparents-day",
      "national-family-day"
    ],
    "howToCelebrate": "Spend time with your father doing activities he enjoys. Give thoughtful gifts like tools, books, or experiences. Cook a meal together or take him out to his favorite restaurant. Share stories and memories about your dad. Call or visit your father to show your appreciation.",
    "funFacts": [
      "Father's Day was officially recognized as a national holiday in 1972",
      "Sonora Smart Dodd created Father's Day to honor her Civil War veteran father",
      "Americans spend about $16 billion on Father's Day gifts annually",
      "The most popular Father's Day gifts are greeting cards and clothing",
      "Father's Day is celebrated on different dates in different countries"
    ]
  },
  {
    "title": "Cinco de Mayo",
    "slug": "cinco-de-mayo",
    "date": "2026-05-05",
    "category": "Holiday",
    "description": "¡Viva México! Celebrate Cinco de Mayo, the vibrant American-Mexican cultural celebration! While it commemorates Mexico's victory at the Battle of Puebla, in the US it has become a celebration of Mexican culture, heritage, and community. From tacos and margaritas to music and dancing, embrace the festive spirit of this beloved American holiday.",
    "tags": [
      "cinco-de-mayo",
      "mexican-culture",
      "May",
      "celebration",
      "heritage",
      "festive",
      "community"
    ],
    "image": "cinco-de-mayo-celebration.jpg",
    "relatedDays": [
      "national-taco-day",
      "national-mexican-food-day",
      "hispanic-heritage-month"
    ],
    "howToCelebrate": "Enjoy Mexican food and drinks at local restaurants or make them at home. Attend Cinco de Mayo festivals and parades in your community. Learn about Mexican history and culture. Wear traditional Mexican colors and decorations. Share your Cinco de Mayo celebrations on social media.",
    "funFacts": [
      "Cinco de Mayo commemorates Mexico's victory over France in 1862",
      "It's more widely celebrated in the US than in Mexico",
      "Americans consume over 80 million pounds of avocados on Cinco de Mayo",
      "The largest Cinco de Mayo celebration is in Los Angeles",
      "Cinco de Mayo is not Mexico's Independence Day (that's September 16)"
    ]
  },
  {
    "title": "National Constitution Day",
    "slug": "national-constitution-day-america",
    "date": "2026-09-17",
    "category": "Holiday",
    "description": "Celebrate the foundation of American democracy on National Constitution Day! Commemorating the signing of the US Constitution on September 17, 1787, this day honors the document that established our government and protects our rights. Learn about constitutional principles and civic responsibility.",
    "tags": [
      "constitution",
      "civics",
      "September",
      "history",
      "government",
      "democracy",
      "education"
    ],
    "image": "us-constitution-document.jpg",
    "relatedDays": [
      "independence-day",
      "presidents-day",
      "citizenship-day"
    ],
    "howToCelebrate": "Read the Constitution and Bill of Rights. Visit historical sites like Independence Hall. Participate in citizenship ceremonies. Attend educational programs about constitutional rights. Discuss civic duties with family. Share constitutional knowledge on social media.",
    "funFacts": [
      "The Constitution has only 27 amendments in over 230 years",
      "It's the oldest written national constitution still in use",
      "The Constitution was written in just 100 working days",
      "The original document is four pages long",
      "All federal employees and military personnel must take an oath to uphold it"
    ]
  },
  {
    "title": "National Native American Heritage Day",
    "slug": "national-native-american-heritage-day",
    "date": "2026-11-28",
    "category": "Holiday",
    "description": "Honor the rich history and contributions of Native Americans on National Native American Heritage Day. The day after Thanksgiving, this observance celebrates Indigenous cultures, traditions, and the important role Native Americans have played in shaping America.",
    "tags": [
      "Native-American",
      "heritage",
      "November",
      "culture",
      "history",
      "indigenous",
      "respect"
    ],
    "image": "native-american-heritage.jpg",
    "relatedDays": [
      "indigenous-peoples-day",
      "native-american-heritage-month",
      "thanksgiving-day"
    ],
    "howToCelebrate": "Learn about Native American history and cultures. Support Native American businesses and artists. Visit Native American museums and cultural centers. Read books by Native American authors. Attend cultural events and powwows. Share educational content on social media.",
    "funFacts": [
      "There are 574 federally recognized Native American tribes in the US",
      "Native Americans have lived in North America for over 15,000 years",
      "Many US place names come from Native American languages",
      "Native Americans serve in the US military at higher rates than other groups",
      "November is Native American Heritage Month"
    ]
  },
  {
    "title": "National Gold Star Mother's Day",
    "slug": "national-gold-star-mothers-day",
    "date": "2026-09-28",
    "category": "Holiday",
    "description": "Honor the mothers who have lost children serving in the US military on National Gold Star Mother's Day. This solemn observance recognizes their sacrifice and provides support to families who have given so much for our country.",
    "tags": [
      "military",
      "memorial",
      "September",
      "mothers",
      "sacrifice",
      "honor",
      "families"
    ],
    "image": "gold-star-family-memorial.jpg",
    "relatedDays": [
      "memorial-day",
      "veterans-day",
      "armed-forces-day"
    ],
    "howToCelebrate": "Thank Gold Star families in your community. Support Gold Star family organizations. Display a service flag or gold star banner. Attend memorial services. Donate to military family support charities. Share messages of gratitude on social media.",
    "funFacts": [
      "Gold Star Mother's Day was established in 1936",
      "The gold star tradition dates back to World War I",
      "Gold Star families receive special recognition and support",
      "The American Gold Star Mothers organization was founded in 1928",
      "Gold Star Mother's Day is observed the last Sunday of September"
    ]
  },
  {
    "title": "National Freedom Day",
    "slug": "national-freedom-day-america",
    "date": "2026-02-01",
    "category": "Holiday",
    "description": "Celebrate liberty and the signing of the 13th Amendment on National Freedom Day! Observed on February 1st, this day commemorates the abolition of slavery and promotes freedom and equality for all Americans. Reflect on civil rights progress and ongoing work for justice.",
    "tags": [
      "freedom",
      "civil-rights",
      "February",
      "history",
      "equality",
      "justice",
      "commemoration"
    ],
    "image": "freedom-bell-liberty.jpg",
    "relatedDays": [
      "martin-luther-king-jr-day",
      "juneteenth",
      "emancipation-day"
    ],
    "howToCelebrate": "Learn about the 13th Amendment and its significance. Visit civil rights museums and historical sites. Participate in community discussions about freedom and equality. Support civil rights organizations. Educate others about this important day. Share messages of freedom on social media.",
    "funFacts": [
      "National Freedom Day was established by President Truman in 1948",
      "The 13th Amendment was signed by President Lincoln on February 1, 1865",
      "Major Richard Robert Wright Sr., a former slave, championed this observance",
      "The Liberty Bell is rung on National Freedom Day",
      "This day celebrates freedom for all Americans, regardless of race"
    ]
  },
  {
    "title": "National Day of Prayer",
    "slug": "national-day-of-prayer-america",
    "date": "2026-05-01",
    "category": "Holiday",
    "description": "Join millions of Americans in prayer and reflection on the National Day of Prayer. Observed on the first Thursday in May, this day invites people of all faiths to pray for the nation, its leaders, and fellow citizens. Celebrate America's spiritual heritage and religious freedom.",
    "tags": [
      "prayer",
      "faith",
      "May",
      "spiritual",
      "reflection",
      "community",
      "tradition"
    ],
    "image": "prayer-hands-reflection.jpg",
    "relatedDays": [
      "national-religious-freedom-day",
      "thanksgiving-day",
      "national-unity-day"
    ],
    "howToCelebrate": "Attend local prayer gatherings or services. Pray for national leaders and unity. Participate in interfaith prayer events. Reflect on blessings and challenges. Volunteer in your community. Share messages of hope and prayer on social media.",
    "funFacts": [
      "The National Day of Prayer was established by Congress in 1952",
      "President Reagan designated the first Thursday in May in 1988",
      "Every US president since 1952 has issued a Day of Prayer proclamation",
      "Thousands of prayer gatherings occur across America",
      "The day promotes unity while respecting diverse faith traditions"
    ]
  },
  {
    "title": "National Public Lands Day",
    "slug": "national-public-lands-day-conservation",
    "date": "2026-09-27",
    "category": "Holiday",
    "description": "Celebrate America's natural treasures on National Public Lands Day! This day encourages volunteering to help maintain and improve public lands including national parks, forests, and wildlife refuges. Connect with nature and preserve these spaces for future generations.",
    "tags": [
      "public-lands",
      "conservation",
      "September",
      "nature",
      "volunteering",
      "parks",
      "environment"
    ],
    "image": "national-park-landscape.jpg",
    "relatedDays": [
      "national-parks-week",
      "earth-day",
      "arbor-day"
    ],
    "howToCelebrate": "Volunteer at local parks or public lands. Participate in cleanup or restoration projects. Visit a national park (many offer free admission). Learn about public land conservation. Support park foundations. Share your public lands experiences on social media.",
    "funFacts": [
      "The US has over 640 million acres of public lands",
      "Public lands contribute over $600 billion to the economy annually",
      "National Public Lands Day is the largest single-day volunteer effort",
      "Many federal sites offer free admission on this day",
      "Over 170,000 volunteers participate annually"
    ]
  },
  {
    "title": "National Vietnam War Veterans Day",
    "slug": "national-vietnam-war-veterans-day",
    "date": "2026-03-29",
    "category": "Holiday",
    "description": "Honor the courage and sacrifice of Vietnam War veterans on National Vietnam War Veterans Day. Observed on March 29th, this day recognizes the nearly 3 million Americans who served in Vietnam and thanks them for their service to our nation.",
    "tags": [
      "veterans",
      "military",
      "March",
      "Vietnam",
      "honor",
      "service",
      "remembrance"
    ],
    "image": "vietnam-veterans-memorial.jpg",
    "relatedDays": [
      "veterans-day",
      "memorial-day",
      "armed-forces-day"
    ],
    "howToCelebrate": "Thank Vietnam War veterans for their service. Visit the Vietnam Veterans Memorial. Attend local recognition ceremonies. Learn about the Vietnam War and its impact. Support veterans' organizations. Display the American flag. Share gratitude on social media.",
    "funFacts": [
      "March 29th marks the date US combat troops withdrew from Vietnam in 1973",
      "Over 58,000 Americans died in the Vietnam War",
      "The Vietnam Veterans Memorial has over 58,000 names inscribed",
      "National Vietnam War Veterans Day was established in 2017",
      "Many Vietnam veterans never received proper recognition until recent decades"
    ]
  },
  {
    "title": "Presidents' Day",
    "slug": "presidents-day-washington-lincoln",
    "date": "2026-02-17",
    "category": "Holiday",
    "description": "Honor America's leaders on Presidents' Day! This federal holiday celebrates George Washington, Abraham Lincoln, and all US presidents. It's a day to reflect on presidential leadership and American history.",
    "tags": [
      "presidents-day",
      "washington",
      "February",
      "lincoln",
      "federal-holiday",
      "american-history",
      "patriotic"
    ],
    "image": "presidents-day-america.jpg",
    "relatedDays": [
      "independence-day",
      "constitution-day",
      "flag-day"
    ],
    "howToCelebrate": "Visit presidential museums or historic sites. Learn about presidential history. Watch documentaries about presidents. Discuss presidential leadership. Take advantage of Presidents' Day sales.",
    "funFacts": [
      "Originally celebrated only Washington's birthday",
      "It's officially 'Washington's Birthday' but commonly called Presidents' Day",
      "It's always the third Monday in February",
      "Major retail sales event",
      "Some states celebrate it differently"
    ]
  },
  {
    "title": "Pearl Harbor Remembrance Day",
    "slug": "pearl-harbor-remembrance-day-ww2",
    "date": "2026-12-07",
    "category": "Holiday",
    "description": "Remember December 7, 1941 - a date which will live in infamy. Pearl Harbor Remembrance Day honors those who died in the surprise attack that brought America into World War II. Pay tribute to the heroes and victims.",
    "tags": [
      "pearl-harbor",
      "remembrance",
      "December",
      "ww2",
      "military",
      "history",
      "heroes"
    ],
    "image": "pearl-harbor-memorial.jpg",
    "relatedDays": [
      "veterans-day",
      "memorial-day",
      "d-day"
    ],
    "howToCelebrate": "Observe a moment of silence. Visit the Pearl Harbor Memorial (or online). Learn about the attack and its impact. Honor survivors and victims. Watch historical documentaries. Fly flags at half-staff.",
    "funFacts": [
      "2,403 Americans died in the attack",
      "The attack lasted less than two hours",
      "Eight battleships were damaged or destroyed",
      "The USS Arizona Memorial marks where the ship sank",
      "President Roosevelt's speech called it 'a date which will live in infamy'"
    ]
  },
  {
    "title": "Kwanzaa",
    "slug": "kwanzaa-african-american-celebration",
    "date": "2026-12-26",
    "category": "Holiday",
    "description": "Celebrate African heritage with Kwanzaa! This week-long celebration (Dec 26-Jan 1) honors African-American culture, family, and community. Based on African harvest festivals, Kwanzaa features seven principles (Nguzo Saba) promoting unity and self-determination.",
    "tags": [
      "kwanzaa",
      "african-american",
      "December",
      "culture",
      "heritage",
      "celebration",
      "tradition"
    ],
    "image": "kwanzaa-celebration.jpg",
    "relatedDays": [
      "black-history-month",
      "juneteenth",
      "african-heritage-day"
    ],
    "howToCelebrate": "Light the kinara (candle holder) for seven nights. Learn about the seven principles. Share African and African-American heritage. Exchange gifts (zawadi). Feast together (karamu). Reflect on culture and community.",
    "funFacts": [
      "Created in 1966 by Dr. Maulana Karenga",
      "Name means 'first fruits' in Swahili",
      "Celebrated by millions of African Americans",
      "Uses seven symbols including corn, crops, and a unity cup",
      "Colors are black, red, and green representing heritage"
    ]
  },
  {
    "title": "Passover",
    "slug": "passover-jewish-holiday",
    "date": "2026-04-13",
    "category": "Holiday",
    "description": "Observe Passover, the Jewish celebration of freedom! This eight-day festival commemorates the Exodus from Egypt. Families gather for Seder meals, retelling the liberation story and sharing symbolic foods that represent the journey to freedom.",
    "tags": [
      "passover",
      "jewish",
      "April",
      "freedom",
      "tradition",
      "seder",
      "religious"
    ],
    "image": "passover-seder-table.jpg",
    "relatedDays": [
      "hanukkah",
      "rosh-hashanah",
      "yom-kippur"
    ],
    "howToCelebrate": "Attend or host a Seder. Learn the Passover story. Eat matzah and symbolic foods. Clean your home of leavened products. Discuss themes of freedom and liberation. Support Jewish community events.",
    "funFacts": [
      "Passover lasts 7-8 days depending on tradition",
      "The Seder includes four cups of wine and symbolic foods",
      "Matzah represents bread that didn't have time to rise during the Exodus",
      "Children search for the hidden afikomen",
      "One of the most widely observed Jewish holidays"
    ]
  },
  {
    "title": "Ramadan",
    "slug": "ramadan-islamic-holy-month",
    "date": "2026-03-01",
    "category": "Holiday",
    "description": "Observe the holy month of Ramadan! Muslims worldwide fast from dawn to sunset, focusing on prayer, reflection, and community. Ramadan celebrates the first revelation of the Quran and emphasizes compassion, charity, and spiritual growth.",
    "tags": [
      "ramadan",
      "islamic",
      "March",
      "fasting",
      "prayer",
      "holy-month",
      "religious"
    ],
    "image": "ramadan-iftar-breaking-fast.jpg",
    "relatedDays": [
      "eid-al-fitr",
      "eid-al-adha",
      "islamic-new-year"
    ],
    "howToCelebrate": "If Muslim, observe fasting and increased prayer. Break fast (iftar) with family. Give to charity (zakat). Read the Quran. Support Muslim communities. Learn about Islamic traditions respectfully. Wish Muslims 'Ramadan Mubarak'.",
    "funFacts": [
      "Ramadan is the ninth month of the Islamic calendar",
      "Muslims fast from dawn to sunset for 29-30 days",
      "It's one of the Five Pillars of Islam",
      "Laylat al-Qadr (Night of Power) is the holiest night",
      "Ends with Eid al-Fitr, a joyous celebration"
    ]
  },
  {
    "title": "Diwali",
    "slug": "diwali-festival-of-lights",
    "date": "2026-10-20",
    "category": "Holiday",
    "description": "Celebrate the Festival of Lights! Diwali is one of India's biggest holidays, celebrated by Hindus, Sikhs, and Jains worldwide. Light oil lamps (diyas), enjoy sweets, exchange gifts, and celebrate the victory of light over darkness, good over evil.",
    "tags": [
      "diwali",
      "indian",
      "October",
      "festival",
      "lights",
      "hindu",
      "celebration"
    ],
    "image": "diwali-lights-celebration.jpg",
    "relatedDays": [
      "holi",
      "lunar-new-year",
      "lantern-festival"
    ],
    "howToCelebrate": "Light diyas or candles. Enjoy Indian sweets and food. Watch fireworks. Wear new clothes. Exchange gifts. Clean and decorate your home. Learn about Diwali traditions. Visit Hindu temples or cultural events.",
    "funFacts": [
      "Diwali means 'row of lights' in Sanskrit",
      "Celebrated over five days",
      "Commemorates Lord Rama's return in Hindu tradition",
      "Indians clean homes thoroughly before Diwali",
      "It's a national holiday in India, Nepal, and other countries"
    ]
  },
  {
    "title": "Rosh Hashanah",
    "slug": "rosh-hashanah-jewish-new-year",
    "date": "2026-09-23",
    "category": "Holiday",
    "description": "L'Shanah Tovah! Rosh Hashanah is the Jewish New Year, beginning the High Holy Days. It's a time of reflection, prayer, and eating symbolic foods like apples and honey for a sweet new year.",
    "tags": [
      "rosh-hashanah",
      "jewish",
      "September",
      "new-year",
      "religious",
      "holy-days",
      "tradition"
    ],
    "image": "rosh-hashanah-shofar.jpg",
    "relatedDays": [
      "yom-kippur",
      "passover",
      "hanukkah"
    ],
    "howToCelebrate": "Attend synagogue services. Hear the shofar (ram's horn). Eat apples dipped in honey. Reflect on the past year. Set intentions for the new year. Wish others 'L'Shanah Tovah' (Happy New Year).",
    "funFacts": [
      "Rosh Hashanah means 'head of the year' in Hebrew",
      "It's celebrated for two days",
      "The shofar is blown 100 times during services",
      "Round challah symbolizes the cycle of the year",
      "It begins the Ten Days of Repentance leading to Yom Kippur"
    ]
  },
  {
    "title": "Yom Kippur",
    "slug": "yom-kippur-day-of-atonement",
    "date": "2026-10-02",
    "category": "Holiday",
    "description": "The Day of Atonement. Yom Kippur is the holiest day in Judaism, a day of fasting, prayer, and repentance. Jews seek forgiveness and spiritual renewal.",
    "tags": [
      "yom-kippur",
      "jewish",
      "October",
      "fasting",
      "atonement",
      "holy-day",
      "religious"
    ],
    "image": "yom-kippur-prayer.jpg",
    "relatedDays": [
      "rosh-hashanah",
      "high-holy-days",
      "jewish-holidays"
    ],
    "howToCelebrate": "Observe a 25-hour fast. Attend Kol Nidre and Yom Kippur services. Seek forgiveness from others. Engage in self-reflection. Wear white as a symbol of purity. Break fast with loved ones.",
    "funFacts": [
      "Yom Kippur means 'Day of Atonement'",
      "It's the holiest day of the Jewish year",
      "Observant Jews fast for 25 hours",
      "The holiday concludes with a final shofar blast",
      "Many non-religious Jews observe Yom Kippur"
    ]
  },
  {
    "title": "Dia de los Muertos",
    "slug": "dia-de-los-muertos-day-of-the-dead",
    "date": "2026-11-01",
    "category": "Holiday",
    "description": "Celebrate life and death! Dia de los Muertos (Day of the Dead) is a Mexican tradition honoring deceased loved ones. Create altars, share favorite foods, and celebrate the memories of those who've passed.",
    "tags": [
      "dia-de-los-muertos",
      "mexican",
      "November",
      "tradition",
      "ancestors",
      "celebration",
      "culture"
    ],
    "image": "dia-de-los-muertos-altar.jpg",
    "relatedDays": [
      "halloween",
      "all-saints-day",
      "memorial-day"
    ],
    "howToCelebrate": "Create an ofrenda (altar) with photos and favorite foods of deceased loved ones. Make sugar skulls. Decorate with marigolds. Visit cemeteries. Celebrate with music and stories. Learn about Mexican culture.",
    "funFacts": [
      "It's a joyful celebration, not a sad occasion",
      "Marigolds guide spirits home",
      "Sugar skulls represent departed souls",
      "Celebrated November 1-2 (All Saints and All Souls Days)",
      "UNESCO recognizes it as cultural heritage"
    ]
  },
  {
    "title": "Lunar New Year",
    "slug": "lunar-new-year-spring-festival",
    "date": "2026-01-29",
    "category": "Holiday",
    "description": "Welcome the Year of the Snake! Lunar New Year is the most important celebration in Chinese culture, also celebrated across Asia. Enjoy family reunions, special foods, red envelopes, and festivities!",
    "tags": [
      "lunar-new-year",
      "chinese",
      "January",
      "spring-festival",
      "asian",
      "celebration",
      "tradition"
    ],
    "image": "lunar-new-year-celebration.jpg",
    "relatedDays": [
      "lantern-festival",
      "mid-autumn-festival",
      "dragon-boat-festival"
    ],
    "howToCelebrate": "Enjoy traditional foods like dumplings. Give red envelopes (hongbao). Clean your home. Watch lion and dragon dances. Attend cultural celebrations. Learn about your Chinese zodiac animal.",
    "funFacts": [
      "Also called Spring Festival",
      "Based on the lunar calendar, dates change annually",
      "Celebrated by over 2 billion people worldwide",
      "Each year is associated with one of 12 zodiac animals",
      "Celebrations last 15 days, ending with the Lantern Festival"
    ]
  },
  {
    "title": "Mardi Gras",
    "slug": "mardi-gras-fat-tuesday-celebration",
    "date": "2026-03-04",
    "category": "Holiday",
    "description": "Laissez les bons temps rouler! Mardi Gras (Fat Tuesday) is a day of celebration before Lent begins. From New Orleans parades to king cake, celebrate with purple, green, and gold!",
    "tags": [
      "mardi-gras",
      "fat-tuesday",
      "March",
      "celebration",
      "new-orleans",
      "carnival",
      "tradition"
    ],
    "image": "mardi-gras-celebration.jpg",
    "relatedDays": [
      "carnival",
      "ash-wednesday",
      "king-cake-day"
    ],
    "howToCelebrate": "Attend Mardi Gras parades. Eat king cake. Wear purple, green, and gold. Listen to New Orleans music. Learn Mardi Gras history. Enjoy festive celebrations.",
    "funFacts": [
      "Mardi Gras means 'Fat Tuesday' in French",
      "New Orleans hosts the biggest celebration",
      "Purple represents justice, green faith, and gold power",
      "King cakes contain a hidden baby figurine",
      "Mardi Gras dates change based on Easter"
    ]
  },
  {
    "title": "Bastille Day",
    "slug": "bastille-day-july",
    "date": "2026-07-14",
    "category": "Holiday",
    "description": "Celebrate French culture and history on Bastille Day! This French national holiday commemorates the storming of the Bastille prison in 1789, a pivotal event in the French Revolution. Enjoy French cuisine, learn about French history, and celebrate the values of liberty, equality, and fraternity.",
    "tags": [
      "france",
      "french",
      "July",
      "revolution",
      "history",
      "culture",
      "celebration"
    ],
    "relatedDays": [
      "independence-day",
      "french-heritage-day",
      "international-day"
    ],
    "howToCelebrate": "Enjoy French cuisine and wine. Learn about French history and the French Revolution. Attend Bastille Day celebrations in your area. Watch French films or listen to French music. Learn some French phrases. Share French culture and history with others.",
    "funFacts": [
      "Bastille Day is France's national holiday, similar to Independence Day in the US",
      "The storming of the Bastille marked the beginning of the French Revolution",
      "Bastille Day is celebrated with parades, fireworks, and parties in France",
      "The French flag's colors represent liberty (blue), equality (white), and fraternity (red)",
      "Bastille Day celebrations occur in many cities around the world with French communities"
    ]
  }
]