[
  {
    "title": "National Back to School Day",
    "slug": "national-back-to-school-day",
    "date": "2025-08-15",
    "category": "National",
    "description": "Get ready for a new academic year on National Back to School Day! This important day marks the transition from summer break to the classroom, bringing excitement for new learning opportunities, friendships, and experiences. Whether you're a student, parent, or educator, embrace the fresh start and possibilities that a new school year brings.",
    "tags": [
      "education",
      "school",
      "August",
      "learning",
      "students",
      "teachers",
      "academic"
    ],
    "image": "back-to-school-preparation.jpg",
    "relatedDays": [
      "world-teachers-day",
      "national-education-week",
      "national-student-day"
    ],
    "howToCelebrate": "Prepare for the school year by organizing supplies and setting up study spaces. Attend back-to-school events and meet teachers and classmates. Set academic and personal goals for the new year. Support local schools by donating supplies or volunteering. Share back-to-school tips and encouragement on social media.",
    "funFacts": [
      "The average American family spends $697 on back-to-school supplies",
      "Back-to-school shopping is the second largest shopping season after the holidays",
      "The first day of school varies by state, typically between mid-August and early September",
      "Over 50 million students attend public elementary and secondary schools in the US",
      "Teachers spend an average of $500 of their own money on classroom supplies each year"
    ]
  },
  {
    "title": "National Technology Day",
    "slug": "national-technology-day",
    "date": "2025-01-06",
    "category": "National",
    "description": "Celebrate innovation and the digital age on National Technology Day! This day recognizes the incredible impact technology has on our daily lives, from smartphones to artificial intelligence. Explore new tech trends, learn about emerging technologies, and appreciate how technology connects us, improves our lives, and shapes the future.",
    "tags": [
      "technology",
      "innovation",
      "January",
      "digital",
      "future",
      "computers",
      "smartphones"
    ],
    "image": "modern-technology-display.jpg",
    "relatedDays": [
      "national-internet-day",
      "national-cybersecurity-awareness-month",
      "national-ai-day"
    ],
    "howToCelebrate": "Learn about a new technology or app you've never used before. Attend a tech meetup or virtual conference. Explore coding or digital skills through online tutorials. Share your favorite tech tools and tips on social media. Support organizations that provide technology education and access to underserved communities.",
    "funFacts": [
      "The first computer weighed 30 tons and filled an entire room",
      "Smartphones have more computing power than the computers that sent humans to the moon",
      "The internet processes over 3.5 billion searches per day",
      "Artificial intelligence is being used in over 50 industries",
      "The first email was sent in 1971 between two computers sitting next to each other"
    ]
  },
  {
    "title": "National Reading Day",
    "slug": "national-reading-day",
    "date": "2025-01-23",
    "category": "National",
    "description": "Turn the page and celebrate the magic of reading on National Reading Day! This special day encourages people of all ages to pick up a book and discover new worlds, ideas, and perspectives. Whether you prefer fiction, non-fiction, or poetry, reading opens doors to knowledge, imagination, and personal growth that lasts a lifetime.",
    "tags": [
      "reading",
      "books",
      "January",
      "education",
      "literature",
      "learning",
      "knowledge"
    ],
    "image": "person-reading-book.jpg",
    "relatedDays": [
      "world-book-day",
      "national-library-week",
      "national-poetry-month"
    ],
    "howToCelebrate": "Start a new book or revisit an old favorite. Visit your local library or bookstore to discover new titles. Join or start a book club with friends. Read to children or encourage young readers in your life. Share book recommendations on social media and engage in literary discussions.",
    "funFacts": [
      "Reading for just 6 minutes can reduce stress by 68%",
      "The average person reads about 12 books per year",
      "Reading can increase vocabulary by 50%",
      "The longest novel ever written has over 1.2 million words",
      "Regular reading can delay the onset of Alzheimer's disease"
    ]
  },
  {
    "title": "National Volunteer Day",
    "slug": "national-volunteer-day",
    "date": "2025-12-05",
    "category": "National",
    "description": "Give back to your community and make a difference on National Volunteer Day! This special day celebrates the spirit of volunteerism and encourages people to dedicate their time and skills to helping others. From local charities to international causes, volunteering creates positive change and strengthens communities while providing personal fulfillment.",
    "tags": [
      "volunteer",
      "service",
      "December",
      "community",
      "helping",
      "charity",
      "giving"
    ],
    "image": "people-volunteering-together.jpg",
    "relatedDays": [
      "national-good-samaritan-day",
      "world-kindness-day",
      "national-giving-tuesday"
    ],
    "howToCelebrate": "Volunteer at a local charity, food bank, or community organization. Organize a volunteer project with friends, family, or colleagues. Donate your professional skills to help nonprofits. Participate in community clean-up events or environmental projects. Share your volunteer experiences on social media to inspire others.",
    "funFacts": [
      "Over 62 million Americans volunteer each year",
      "Volunteers contribute over 8 billion hours of service annually",
      "Volunteering can improve mental health and reduce depression",
      "People who volunteer live longer than those who don't",
      "The economic value of volunteer work is estimated at $184 billion per year"
    ]
  },
  {
    "title": "National Astronomy Day",
    "slug": "national-astronomy-day",
    "date": "2025-05-10",
    "category": "National",
    "description": "Look up and explore the wonders of the universe on National Astronomy Day! This special day celebrates the science of astronomy and encourages people to discover the beauty and mysteries of the night sky. From stargazing to learning about planets and galaxies, astronomy opens our minds to the vastness of space and our place in the cosmos.",
    "tags": [
      "astronomy",
      "space",
      "May",
      "stars",
      "planets",
      "science",
      "universe"
    ],
    "image": "starry-night-sky.jpg",
    "relatedDays": [
      "national-space-day",
      "world-space-week",
      "national-planetarium-day"
    ],
    "howToCelebrate": "Go stargazing in a dark location away from city lights. Visit a planetarium or observatory for educational programs. Learn about constellations and how to identify them. Use a telescope or binoculars to observe the moon and planets. Join astronomy clubs or attend stargazing events in your community.",
    "funFacts": [
      "There are more stars in the universe than grains of sand on Earth",
      "The sun is 93 million miles away from Earth",
      "Light from the sun takes 8 minutes to reach Earth",
      "There are over 100 billion galaxies in the observable universe",
      "Astronomy is one of the oldest sciences, dating back thousands of years"
    ]
  },
  {
    "title": "National Family Day",
    "slug": "national-family-day",
    "date": "2025-09-22",
    "category": "National",
    "description": "Cherish the bonds that matter most on National Family Day! This special day celebrates the importance of family connections and encourages quality time together. Whether you're spending time with blood relatives or chosen family, appreciate the love, support, and memories that families create together.",
    "tags": [
      "family",
      "bonds",
      "September",
      "love",
      "togetherness",
      "memories",
      "relationships"
    ],
    "image": "happy-family-together.jpg",
    "relatedDays": [
      "national-siblings-day",
      "national-parents-day",
      "national-grandparents-day"
    ],
    "howToCelebrate": "Plan a special family activity or meal together. Share old family photos and stories. Call or visit family members you haven't seen in a while. Create new family traditions or continue old ones. Share family memories and photos on social media.",
    "funFacts": [
      "The average family size in the US is 3.14 people",
      "Family meals improve children's academic performance",
      "Strong family bonds can reduce stress and improve mental health",
      "Family traditions help create lasting memories",
      "Quality family time is more important than quantity"
    ]
  },
  {
    "title": "National Music Day",
    "slug": "national-music-day",
    "date": "2025-06-21",
    "category": "National",
    "description": "Turn up the volume and celebrate the universal language of music on National Music Day! Music has the power to bring people together, evoke emotions, and create lasting memories. From classical symphonies to modern hits, discover new genres, attend concerts, or pick up an instrument and make your own musical magic.",
    "tags": [
      "music",
      "art",
      "June",
      "creativity",
      "entertainment",
      "culture",
      "expression"
    ],
    "image": "musical-instruments-display.jpg",
    "relatedDays": [
      "national-piano-day",
      "national-guitar-day",
      "world-music-day"
    ],
    "howToCelebrate": "Attend a live concert or music performance. Learn to play a new instrument or practice one you already know. Discover new artists and genres of music. Share your favorite songs and playlists on social media. Support local musicians and music venues.",
    "funFacts": [
      "Music can reduce anxiety and improve mood",
      "Playing music uses both sides of the brain simultaneously",
      "The oldest known musical instrument is 40,000 years old",
      "Music therapy is used to treat various medical conditions",
      "Listening to music can improve workout performance by 15%"
    ]
  },
  {
    "title": "National Friendship Day",
    "slug": "national-friendship-day",
    "date": "2025-08-02",
    "category": "National",
    "description": "Celebrate the bonds of friendship on National Friendship Day! This special day honors the meaningful relationships that enrich our lives and provide support, laughter, and companionship. Whether you have lifelong friends or new connections, take time to appreciate the people who make your life brighter and create lasting memories together.",
    "tags": [
      "friendship",
      "relationships",
      "August",
      "bonds",
      "companionship",
      "support",
      "memories"
    ],
    "image": "friends-celebrating-together.jpg",
    "relatedDays": [
      "international-day-of-friendship",
      "national-best-friends-day",
      "world-kindness-day"
    ],
    "howToCelebrate": "Reach out to friends you haven't spoken to in a while. Plan a fun activity or outing with your closest friends. Send thoughtful messages or small gifts to show your appreciation. Share photos and memories with friends on social media. Make an effort to befriend someone new in your community.",
    "funFacts": [
      "Strong friendships can increase life expectancy by up to 50%",
      "The average person has 3-5 close friends",
      "Friendship can reduce stress and improve mental health",
      "Quality friendships are more important than quantity",
      "Friends share similar brain wave patterns when together"
    ]
  },
  {
    "title": "National Art Day",
    "slug": "national-art-day",
    "date": "2025-10-25",
    "category": "National",
    "description": "Express your creativity and celebrate the power of art on National Art Day! Art has the ability to inspire, heal, and connect people across cultures and generations. Whether you're creating art, appreciating it, or learning about different art forms, embrace the beauty and meaning that art brings to our lives and communities.",
    "tags": [
      "art",
      "creativity",
      "October",
      "expression",
      "beauty",
      "culture",
      "inspiration"
    ],
    "image": "artist-creating-painting.jpg",
    "relatedDays": [
      "national-music-day",
      "national-poetry-month",
      "national-craft-month"
    ],
    "howToCelebrate": "Create your own artwork using any medium you enjoy. Visit art galleries, museums, or local art shows. Take an art class to learn new techniques. Support local artists by purchasing their work. Share your art or favorite artworks on social media.",
    "funFacts": [
      "Art therapy can help treat depression and anxiety",
      "Creating art can increase dopamine levels in the brain",
      "The oldest known cave paintings are 40,000 years old",
      "Art can improve cognitive function and memory",
      "Participating in art activities can reduce stress by 75%"
    ]
  },
  {
    "title": "National Internet Day",
    "slug": "national-internet-day",
    "date": "2025-10-29",
    "category": "National",
    "description": "Celebrate the revolutionary technology that connects the world on National Internet Day! The internet has transformed how we communicate, learn, work, and access information. From social media to online shopping, streaming to remote work, appreciate this incredible tool that has changed our daily lives and created endless possibilities for connection and innovation.",
    "tags": [
      "internet",
      "technology",
      "October",
      "connectivity",
      "digital",
      "innovation",
      "communication"
    ],
    "image": "global-internet-connectivity.jpg",
    "relatedDays": [
      "national-technology-day",
      "national-cybersecurity-awareness-month",
      "world-wide-web-day"
    ],
    "howToCelebrate": "Learn about the history of the internet and how it has evolved. Explore new websites, apps, or online resources you've never used. Share your favorite internet discoveries and tools on social media. Support digital literacy programs in your community. Reflect on how the internet has impacted your life.",
    "funFacts": [
      "The internet was invented in 1969 as ARPANET",
      "Over 4.9 billion people worldwide use the internet",
      "The first website went live in 1991",
      "The internet processes over 3.5 billion searches per day",
      "Email was the first major internet application"
    ]
  },
  {
    "title": "National Photography Day",
    "slug": "national-photography-day",
    "date": "2025-08-19",
    "category": "National",
    "description": "Capture the moment and celebrate the art of photography on National Photography Day! Photography allows us to preserve memories, tell stories, and see the world from different perspectives. Whether you're using a smartphone or professional camera, explore your creativity through the lens and share your unique view of the world.",
    "tags": [
      "photography",
      "art",
      "August",
      "creativity",
      "memories",
      "visual",
      "capture"
    ],
    "image": "photographer-taking-photos.jpg",
    "relatedDays": [
      "national-art-day",
      "national-creativity-day",
      "national-memories-day"
    ],
    "howToCelebrate": "Take photos of interesting subjects in your community. Learn new photography techniques or editing skills. Share your favorite photos on social media. Visit photography exhibitions or galleries. Teach someone else about photography basics.",
    "funFacts": [
      "The first photograph was taken in 1826",
      "Over 1.8 billion photos are taken daily worldwide",
      "Photography can improve memory and attention to detail",
      "The word 'photography' means 'drawing with light'",
      "Digital photography revolutionized how we capture and share images"
    ]
  },
  {
    "title": "National Creativity Day",
    "slug": "national-creativity-day",
    "date": "2025-05-30",
    "category": "National",
    "description": "Unleash your imagination and celebrate the power of creativity on National Creativity Day! Creativity is essential for innovation, problem-solving, and personal expression. Whether you're an artist, writer, musician, or simply enjoy creative activities, embrace your creative side and explore new ways to express yourself and bring ideas to life.",
    "tags": [
      "creativity",
      "imagination",
      "May",
      "innovation",
      "art",
      "expression",
      "originality"
    ],
    "image": "creative-workspace-setup.jpg",
    "relatedDays": [
      "national-art-day",
      "national-music-day",
      "national-photography-day"
    ],
    "howToCelebrate": "Engage in a creative activity you enjoy. Try a new creative hobby or craft. Brainstorm solutions to problems in creative ways. Share your creative work on social media. Encourage others to explore their creativity.",
    "funFacts": [
      "Creativity can reduce stress and improve mental health",
      "Children are naturally more creative than adults",
      "Creativity involves both divergent and convergent thinking",
      "Regular creative practice can increase overall creativity",
      "Creativity is essential for innovation and problem-solving"
    ]
  },
  {
    "title": "National Gratitude Day",
    "slug": "national-gratitude-day",
    "date": "2025-09-21",
    "category": "National",
    "description": "Count your blessings and celebrate the power of gratitude on National Gratitude Day! Gratitude is one of the most powerful emotions, improving mental health, relationships, and overall life satisfaction. Take time to appreciate the good things in your life, express thanks to others, and cultivate a grateful mindset that can transform your perspective on life.",
    "tags": [
      "gratitude",
      "thanksgiving",
      "September",
      "appreciation",
      "positive",
      "blessings",
      "mindfulness"
    ],
    "image": "person-writing-gratitude-list.jpg",
    "relatedDays": [
      "thanksgiving-day",
      "national-happiness-day",
      "national-kindness-day"
    ],
    "howToCelebrate": "Write down 3-5 things you're grateful for each day. Thank someone who has made a positive impact on your life. Practice gratitude meditation or journaling. Share what you're grateful for on social media. Volunteer or help others to express gratitude through action.",
    "funFacts": [
      "Practicing gratitude can increase happiness by 25%",
      "Grateful people have stronger immune systems",
      "Gratitude can improve sleep quality",
      "Writing gratitude letters can boost well-being for months",
      "Gratitude can strengthen relationships and social connections"
    ]
  },
  {
    "title": "National Science Day",
    "slug": "national-science-day",
    "date": "2025-03-14",
    "category": "National",
    "description": "Celebrate the wonders of scientific discovery on National Science Day! Science shapes our understanding of the world and drives innovation that improves our lives. From physics and chemistry to biology and astronomy, explore the fascinating world of science, encourage STEM education, and appreciate the scientists who push the boundaries of human knowledge.",
    "tags": [
      "science",
      "discovery",
      "March",
      "STEM",
      "innovation",
      "research",
      "knowledge"
    ],
    "image": "science-laboratory-discovery.jpg",
    "relatedDays": [
      "national-technology-day",
      "national-stem-day",
      "national-innovation-day"
    ],
    "howToCelebrate": "Visit science museums, planetariums, or research facilities. Conduct simple science experiments at home or school. Read about recent scientific discoveries and breakthroughs. Support STEM education programs and science literacy initiatives. Share interesting science facts and discoveries on social media.",
    "funFacts": [
      "The word 'science' comes from the Latin 'scientia', meaning knowledge",
      "The scientific method was developed in the 17th century",
      "There are over 8 million scientists worldwide",
      "Scientific knowledge doubles approximately every 12 years",
      "Many everyday items we use were invented through scientific research"
    ]
  },
  {
    "title": "National Innovation Day",
    "slug": "national-innovation-day",
    "date": "2025-02-16",
    "category": "National",
    "description": "Celebrate the power of innovation and creative problem-solving on National Innovation Day! Innovation drives progress and helps solve the world's most challenging problems. From groundbreaking inventions to simple improvements in daily life, discover how innovative thinking shapes our future and learn how you can contribute to positive change.",
    "tags": [
      "innovation",
      "invention",
      "February",
      "creativity",
      "problem-solving",
      "progress",
      "future"
    ],
    "image": "innovation-technology-future.jpg",
    "relatedDays": [
      "national-creativity-day",
      "national-technology-day",
      "national-inventors-day"
    ],
    "howToCelebrate": "Learn about famous inventors and their groundbreaking innovations. Try to solve a problem in your daily life with a creative solution. Visit innovation centers, maker spaces, or technology museums. Support innovative startups and businesses in your community. Share stories of innovation and inventors on social media.",
    "funFacts": [
      "The word 'innovation' comes from the Latin 'innovare', meaning to renew",
      "Most innovations are improvements on existing ideas, not completely new inventions",
      "Companies that prioritize innovation are 3.5 times more likely to outperform their peers",
      "The average person has 3-5 ideas per day that could be innovations",
      "Many successful innovations started as solutions to personal problems"
    ]
  },
  {
    "title": "National Entrepreneurship Day",
    "slug": "national-entrepreneurship-day",
    "date": "2025-11-15",
    "category": "National",
    "description": "Celebrate innovation and business creation on National Entrepreneurship Day! Entrepreneurs drive economic growth, create jobs, and solve problems through innovative products and services. Whether you're starting your own business or supporting local entrepreneurs, recognize the courage and creativity it takes to turn ideas into reality.",
    "tags": [
      "entrepreneurship",
      "business",
      "November",
      "innovation",
      "startups",
      "economy",
      "creativity"
    ],
    "image": "entrepreneurs-business-innovation.jpg",
    "relatedDays": [
      "small-business-saturday",
      "national-innovation-day",
      "world-entrepreneurship-day"
    ],
    "howToCelebrate": "Support local small businesses and entrepreneurs. Learn about entrepreneurship and business development. Attend startup events and networking opportunities. Share entrepreneur success stories on social media. Consider starting your own side business or creative project.",
    "funFacts": [
      "Small businesses create about 70% of new jobs in the United States",
      "The average entrepreneur starts their first business at age 40",
      "About 20% of small businesses fail within the first year",
      "Entrepreneurship contributes significantly to economic growth worldwide",
      "Many successful entrepreneurs failed multiple times before succeeding"
    ]
  },
  {
    "title": "National Mentorship Day",
    "slug": "national-mentorship-day",
    "date": "2025-10-27",
    "category": "National",
    "description": "Celebrate the power of guidance and learning on National Mentorship Day! Mentorship relationships provide invaluable support, wisdom, and career development opportunities. Whether you're a mentor sharing your experience or a mentee seeking guidance, these relationships create lasting impacts and help people reach their full potential.",
    "tags": [
      "mentorship",
      "guidance",
      "October",
      "learning",
      "development",
      "wisdom",
      "growth"
    ],
    "image": "mentorship-guidance-support.jpg",
    "relatedDays": [
      "world-teachers-day",
      "national-career-development-month",
      "national-leadership-day"
    ],
    "howToCelebrate": "Thank mentors who have helped you in your career or personal growth. Consider becoming a mentor to someone in your field or community. Join mentorship programs or professional organizations. Share mentorship success stories and advice on social media. Connect with others who could benefit from your experience.",
    "funFacts": [
      "People with mentors are 5 times more likely to get promoted",
      "89% of mentees go on to mentor others",
      "Mentoring relationships can last decades",
      "Both mentors and mentees benefit from the relationship",
      "Formal mentorship programs increase employee retention by 50%"
    ]
  },
  {
    "title": "National Library Day",
    "slug": "national-library-day",
    "date": "2025-04-04",
    "category": "National",
    "description": "Celebrate the treasure troves of knowledge on National Library Day! Libraries are more than just buildings with books - they're community centers, learning hubs, and gateways to endless possibilities. From digital resources to community programs, discover all that your local library has to offer and support these vital institutions.",
    "tags": [
      "libraries",
      "books",
      "April",
      "education",
      "community",
      "knowledge",
      "learning"
    ],
    "image": "modern-library-interior.jpg",
    "relatedDays": [
      "national-library-week",
      "world-book-day",
      "national-reading-day"
    ],
    "howToCelebrate": "Visit your local library and explore their resources and programs. Get a library card if you don't have one. Attend library events, workshops, or story times. Donate books or volunteer at your library. Share your favorite library memories and resources on social media.",
    "funFacts": [
      "There are over 116,000 libraries in the United States",
      "Libraries offer free access to computers, internet, and digital resources",
      "The Library of Congress is the world's largest library",
      "Libraries provide services beyond books, including job search help and tax assistance",
      "Public libraries serve over 95% of Americans"
    ]
  },
  {
    "title": "National Education Day",
    "slug": "national-education-day",
    "date": "2025-01-24",
    "category": "National",
    "description": "Celebrate the power of learning on National Education Day! Education is the foundation of personal growth, career success, and informed citizenship. From early childhood learning to adult education, recognize the importance of accessible, quality education for all and the teachers who make it possible.",
    "tags": [
      "education",
      "learning",
      "January",
      "teachers",
      "schools",
      "knowledge",
      "growth"
    ],
    "image": "education-learning-classroom.jpg",
    "relatedDays": [
      "world-teachers-day",
      "national-back-to-school-day",
      "national-literacy-awareness-day"
    ],
    "howToCelebrate": "Thank teachers and educators in your community. Support local schools and educational programs. Learn something new or take an online course. Donate books or educational materials to schools. Share the importance of education on social media.",
    "funFacts": [
      "Education reduces poverty and improves health outcomes",
      "The average teacher affects over 3,000 students in their career",
      "Lifelong learning keeps the brain active and healthy",
      "Access to education is a fundamental human right",
      "Quality education is essential for economic development"
    ]
  },
  {
    "title": "National Leadership Day",
    "slug": "national-leadership-day",
    "date": "2025-10-16",
    "category": "National",
    "description": "Inspire and develop leadership skills on National Leadership Day! Great leaders inspire others, make tough decisions, and create positive change in their communities. Whether you're leading a team, a family, or yourself, discover the qualities of effective leadership and how to develop them.",
    "tags": [
      "leadership",
      "inspiration",
      "October",
      "management",
      "development",
      "influence",
      "growth"
    ],
    "image": "leadership-team-meeting.jpg",
    "relatedDays": [
      "national-mentorship-day",
      "national-boss-day",
      "national-employee-appreciation-day"
    ],
    "howToCelebrate": "Read books about leadership and personal development. Mentor someone or seek mentorship opportunities. Practice leadership skills in your daily life. Attend leadership workshops or conferences. Share leadership tips and inspiring stories on social media.",
    "funFacts": [
      "Good leaders are made, not born - leadership can be learned",
      "Effective leaders listen more than they speak",
      "Leadership is about serving others, not being served",
      "Great leaders admit mistakes and learn from them",
      "Leadership skills are valuable in all areas of life"
    ]
  },
  {
    "title": "National Veterans Day",
    "slug": "national-veterans-day",
    "date": "2025-11-11",
    "category": "National",
    "description": "Honor those who served our nation on National Veterans Day! This solemn day pays tribute to all American veterans who have served in the armed forces, defending our freedom and way of life. From World War II heroes to modern-day service members, recognize their sacrifice, courage, and dedication to our country.",
    "tags": [
      "veterans",
      "military",
      "November",
      "service",
      "sacrifice",
      "patriotic",
      "honor"
    ],
    "image": "veterans-day-memorial.jpg",
    "relatedDays": [
      "memorial-day",
      "armed-forces-day",
      "independence-day"
    ],
    "howToCelebrate": "Thank veterans in your community for their service. Attend Veterans Day ceremonies and parades. Visit veterans' memorials and cemeteries. Support veteran organizations and charities. Share stories of veterans you know on social media.",
    "funFacts": [
      "Veterans Day was originally called Armistice Day, marking the end of World War I",
      "It became Veterans Day in 1954 to honor all American veterans",
      "There are about 18 million veterans living in the United States",
      "The Tomb of the Unknown Soldier is guarded 24/7 by the US Army",
      "Veterans Day is observed on November 11th regardless of the day of the week"
    ]
  },
  {
    "title": "National American History Day",
    "slug": "national-american-history-day",
    "date": "2025-04-14",
    "category": "National",
    "description": "Explore the rich tapestry of American history on National American History Day! From the founding of our nation to the present day, America's story is one of courage, innovation, and progress. Learn about the people, events, and ideas that shaped our country and continue to inspire us today.",
    "tags": [
      "american-history",
      "education",
      "April",
      "patriotic",
      "learning",
      "heritage",
      "culture"
    ],
    "image": "american-history-education.jpg",
    "relatedDays": [
      "independence-day",
      "constitution-day",
      "presidents-day"
    ],
    "howToCelebrate": "Visit historical sites, museums, or monuments in your area. Read books about American history or watch documentaries. Learn about your family's history and connection to America. Attend historical reenactments or living history events. Share interesting American history facts on social media.",
    "funFacts": [
      "The Declaration of Independence was written by Thomas Jefferson in 1776",
      "The American Revolution lasted from 1775 to 1783",
      "The Constitution is the oldest written constitution still in use",
      "America has had 46 presidents since George Washington",
      "The Civil War was the deadliest conflict in American history"
    ]
  },
  {
    "title": "National Small Business Day",
    "slug": "national-small-business-day",
    "date": "2025-05-12",
    "category": "National",
    "description": "Support the backbone of the American economy on National Small Business Day! Small businesses are the heart of American communities, providing jobs, innovation, and personalized service. From mom-and-pop shops to family restaurants, celebrate the entrepreneurs who make our neighborhoods vibrant and our economy strong.",
    "tags": [
      "small-business",
      "entrepreneurship",
      "May",
      "american-economy",
      "community",
      "local",
      "support"
    ],
    "image": "small-business-community.jpg",
    "relatedDays": [
      "small-business-saturday",
      "national-entrepreneurship-day",
      "national-shop-local-day"
    ],
    "howToCelebrate": "Shop at local small businesses in your community. Leave positive reviews for small businesses you love. Support small business owners on social media. Consider starting your own small business. Share stories of successful small businesses in your area.",
    "funFacts": [
      "Small businesses employ nearly half of all American workers",
      "Small businesses create 2 out of every 3 new jobs in America",
      "For every $100 spent at a local business, $68 stays in the community",
      "There are over 30 million small businesses in the United States",
      "Small businesses are often more innovative than large corporations"
    ]
  },
  {
    "title": "National Armed Forces Day",
    "slug": "national-armed-forces-day",
    "date": "2025-05-17",
    "category": "National",
    "description": "Salute our military on National Armed Forces Day! This important American observance honors all branches of the US military - Army, Navy, Air Force, Marines, and Coast Guard. From active duty to reserves, recognize the brave men and women who protect our freedom and serve our nation with honor and dedication.",
    "tags": [
      "armed-forces",
      "military",
      "May",
      "american-patriotic",
      "service",
      "honor",
      "freedom"
    ],
    "image": "armed-forces-day-parade.jpg",
    "relatedDays": [
      "memorial-day",
      "veterans-day",
      "independence-day"
    ],
    "howToCelebrate": "Attend Armed Forces Day parades and ceremonies in your community. Thank active duty military members for their service. Visit military museums or bases for tours and events. Support military families and organizations. Share messages of appreciation for our armed forces on social media.",
    "funFacts": [
      "Armed Forces Day was established in 1949 by President Harry Truman",
      "It's celebrated on the third Saturday in May",
      "The US military has over 1.3 million active duty personnel",
      "All five branches of the military are honored on this day",
      "Armed Forces Day is celebrated with parades, air shows, and military demonstrations"
    ]
  },
  {
    "title": "National 4th of July Weekend",
    "slug": "national-4th-of-july-weekend",
    "date": "2025-07-05",
    "category": "National",
    "description": "Extend your Independence Day celebration into the weekend on National 4th of July Weekend! This patriotic American observance gives you extra time to enjoy fireworks, barbecues, parades, and family gatherings. From backyard parties to community events, make the most of this special American holiday weekend.",
    "tags": [
      "4th-of-july-weekend",
      "patriotic",
      "July",
      "american-holiday",
      "weekend",
      "celebration",
      "family"
    ],
    "image": "4th-of-july-weekend-celebration.jpg",
    "relatedDays": [
      "independence-day",
      "flag-day",
      "memorial-day"
    ],
    "howToCelebrate": "Continue your Independence Day celebrations with weekend activities. Attend community fireworks displays and parades. Host a weekend barbecue with friends and family. Visit patriotic landmarks and historical sites. Share your weekend celebration photos on social media.",
    "funFacts": [
      "Many Americans take a long weekend for 4th of July celebrations",
      "The 4th of July weekend is one of the busiest travel periods in America",
      "Fireworks displays are held throughout the weekend in many communities",
      "The weekend often includes multiple patriotic events and activities",
      "4th of July weekend is a time for family reunions and gatherings"
    ]
  },
  {
    "title": "National American Dream Day",
    "slug": "national-american-dream-day",
    "date": "2025-07-30",
    "category": "National",
    "description": "Celebrate the American Dream on National American Dream Day! This inspiring observance honors the belief that anyone can achieve success through hard work, determination, and opportunity. From immigrants seeking a better life to entrepreneurs building businesses, recognize the dreams that drive America forward.",
    "tags": [
      "american-dream",
      "opportunity",
      "July",
      "american-values",
      "success",
      "hope",
      "inspiration"
    ],
    "image": "american-dream-inspiration.jpg",
    "relatedDays": [
      "independence-day",
      "national-entrepreneurship-day",
      "immigration-day"
    ],
    "howToCelebrate": "Reflect on your own American Dream and goals. Share stories of people who achieved their American Dream. Support organizations that help others pursue their dreams. Learn about the history of immigration and opportunity in America. Share your dreams and aspirations on social media.",
    "funFacts": [
      "The American Dream concept dates back to the 1930s",
      "It represents the belief in upward mobility and opportunity",
      "The American Dream has inspired millions of immigrants",
      "It encompasses both material success and personal fulfillment",
      "The American Dream continues to evolve with changing times"
    ]
  },
  {
    "title": "National Space Exploration Day",
    "slug": "national-space-exploration-day-usa",
    "date": "2025-02-01",
    "category": "National",
    "description": "Reach for the stars and celebrate America's leadership in space exploration! From the Apollo moon landings to Mars rovers, American space programs have inspired generations and expanded human knowledge. Discover the achievements of NASA, learn about future missions, and dream about humanity's cosmic future.",
    "tags": [
      "space",
      "exploration",
      "February",
      "NASA",
      "science",
      "astronomy",
      "innovation"
    ],
    "image": "nasa-space-exploration.jpg",
    "relatedDays": [
      "national-astronaut-day",
      "moon-landing-anniversary",
      "national-stem-day"
    ],
    "howToCelebrate": "Visit a planetarium or space center. Watch documentaries about space missions. Learn about current NASA projects. Stargaze and identify constellations. Share space facts and images on social media.",
    "funFacts": [
      "The US was the first country to land humans on the Moon in 1969",
      "NASA has launched over 200 crewed missions",
      "American rovers have explored Mars for decades",
      "The International Space Station has been continuously occupied since 2000",
      "NASA's budget has contributed to countless everyday technologies"
    ]
  },
  {
    "title": "National Dentist Day",
    "slug": "national-dentist-day-health",
    "date": "2025-03-06",
    "category": "National",
    "description": "Smile bright and thank the dental professionals who keep America healthy! National Dentist Day honors the dentists, hygienists, and staff who provide essential oral healthcare. Learn about the importance of dental health and appreciate the professionals dedicated to keeping our smiles bright and healthy.",
    "tags": [
      "dentist",
      "health",
      "March",
      "dental-care",
      "healthcare",
      "oral-health",
      "prevention"
    ],
    "image": "dental-health-care.jpg",
    "relatedDays": [
      "national-childrens-dental-health-month",
      "national-flossing-day",
      "national-tooth-fairy-day"
    ],
    "howToCelebrate": "Schedule a dental checkup. Thank your dentist and dental team. Learn about proper oral hygiene techniques. Teach children about dental health. Share dental health tips on social media.",
    "funFacts": [
      "The first dental school in America opened in Baltimore in 1840",
      "Americans spend over $124 billion on dental care annually",
      "Tooth enamel is the hardest substance in the human body",
      "The average American visits the dentist twice a year",
      "George Washington never had wooden teeth - they were made of ivory and gold"
    ]
  },
  {
    "title": "National Agriculture Day",
    "slug": "national-agriculture-day-farming",
    "date": "2025-03-18",
    "category": "National",
    "description": "Celebrate the backbone of America on National Agriculture Day! American farmers and ranchers feed the nation and the world, working tirelessly to provide food, fiber, and fuel. Learn about modern farming, support local agriculture, and appreciate the vital role farming plays in American life.",
    "tags": [
      "agriculture",
      "farming",
      "March",
      "food-production",
      "rural-america",
      "sustainability",
      "farmers"
    ],
    "image": "american-farm-agriculture.jpg",
    "relatedDays": [
      "national-farmers-day",
      "national-food-day",
      "farm-to-table-month"
    ],
    "howToCelebrate": "Visit a local farm or farmers market. Learn about where your food comes from. Support American farmers by buying local. Teach children about agriculture. Share appreciation for farmers on social media.",
    "funFacts": [
      "American farms feed over 2 billion people worldwide",
      "The US is the world's largest producer of corn and soybeans",
      "Only 2% of Americans are farmers, down from 90% in 1790",
      "American agriculture contributes over $1 trillion to the economy",
      "US farms are 70% more productive than they were 50 years ago"
    ]
  },
  {
    "title": "National School Librarian Day",
    "slug": "national-school-librarian-day-education",
    "date": "2025-04-07",
    "category": "National",
    "description": "Honor the unsung heroes of education on National School Librarian Day! School librarians foster a love of reading, teach research skills, and create welcoming spaces for learning. These dedicated professionals play a crucial role in student success and literacy across America.",
    "tags": [
      "librarian",
      "education",
      "April",
      "reading",
      "schools",
      "literacy",
      "books"
    ],
    "image": "school-library-books.jpg",
    "relatedDays": [
      "national-library-week",
      "world-book-day",
      "national-reading-day"
    ],
    "howToCelebrate": "Thank your school librarian. Donate books to school libraries. Volunteer at your local school library. Promote the importance of librarians. Share favorite library memories on social media.",
    "funFacts": [
      "There are over 80,000 school librarians in the US",
      "Students with access to school librarians score higher on reading tests",
      "School libraries provide equal access to information for all students",
      "Many librarians also teach digital literacy and research skills",
      "School librarians help bridge the digital divide"
    ]
  },
  {
    "title": "National High Five Day",
    "slug": "national-high-five-day-celebration",
    "date": "2025-04-17",
    "category": "National",
    "description": "Raise your hand for National High Five Day! This uniquely American gesture of celebration, encouragement, and camaraderie brings people together. Whether at sporting events, in schools, or on the street, the high five represents American enthusiasm and positive energy.",
    "tags": [
      "high-five",
      "celebration",
      "April",
      "fun",
      "positivity",
      "sports",
      "encouragement"
    ],
    "image": "friends-high-five-celebration.jpg",
    "relatedDays": [
      "national-fist-bump-day",
      "national-hugging-day",
      "national-smile-day"
    ],
    "howToCelebrate": "Give high fives to everyone you meet. Organize a high five station in your community. Share high five moments on social media. Teach the history of the high five. Spread positivity with enthusiastic high fives.",
    "funFacts": [
      "The high five was invented in 1977 by baseball players",
      "It originated between Dusty Baker and Glenn Burke of the LA Dodgers",
      "High fives release endorphins and create social bonds",
      "The gesture has become recognized worldwide",
      "National High Five Day falls on the third Thursday of April"
    ]
  },
  {
    "title": "National Teacher Appreciation Day",
    "slug": "national-teacher-appreciation-day-education",
    "date": "2025-05-06",
    "category": "National",
    "description": "Thank the educators who shape America's future on National Teacher Appreciation Day! Teachers dedicate their lives to nurturing young minds, inspiring curiosity, and building the next generation of leaders. Show gratitude for these professionals who make a lasting impact on students and communities.",
    "tags": [
      "teachers",
      "education",
      "May",
      "appreciation",
      "schools",
      "learning",
      "gratitude"
    ],
    "image": "teacher-appreciation-classroom.jpg",
    "relatedDays": [
      "teacher-appreciation-week",
      "national-pta-teacher-appreciation-week",
      "world-teachers-day"
    ],
    "howToCelebrate": "Write a thank you note to a teacher. Give teachers gifts or cards. Share teacher appreciation posts on social media. Donate classroom supplies. Volunteer to help teachers and schools.",
    "funFacts": [
      "There are over 3.7 million teachers in American public schools",
      "The average teacher impacts over 3,000 students in their career",
      "Teachers spend an average of $500 of their own money on supplies",
      "Teacher Appreciation Week was established in 1984",
      "Studies show teacher quality is the most important school factor for student success"
    ]
  },
  {
    "title": "National Astronaut Day",
    "slug": "national-astronaut-day-space",
    "date": "2025-05-05",
    "category": "National",
    "description": "Honor America's space heroes on National Astronaut Day! From Alan Shepard's first American spaceflight to today's International Space Station crew, American astronauts have pushed the boundaries of human achievement. Celebrate their courage, dedication, and contributions to science and exploration.",
    "tags": [
      "astronauts",
      "space",
      "May",
      "NASA",
      "exploration",
      "heroes",
      "science"
    ],
    "image": "american-astronaut-space.jpg",
    "relatedDays": [
      "national-space-exploration-day",
      "moon-landing-anniversary",
      "international-day-of-human-space-flight"
    ],
    "howToCelebrate": "Learn about famous American astronauts. Visit a space center or museum. Watch space documentaries. Study STEM subjects. Share astronaut stories and achievements on social media.",
    "funFacts": [
      "Alan Shepard became the first American in space on May 5, 1961",
      "Over 350 Americans have traveled to space",
      "12 Americans have walked on the Moon",
      "The first American woman in space was Sally Ride in 1983",
      "American astronauts have spent over 16,000 days in space"
    ]
  },
  {
    "title": "National Inventors' Day",
    "slug": "national-inventors-day-innovation",
    "date": "2025-02-11",
    "category": "National",
    "description": "Celebrate American ingenuity on National Inventors' Day! Observed on Thomas Edison's birthday, this day honors the inventors whose creativity and innovation have changed the world. From the light bulb to the iPhone, American inventors lead the way.",
    "tags": [
      "inventors",
      "innovation",
      "February",
      "technology",
      "patents",
      "creativity",
      "Edison"
    ],
    "image": "american-inventors-innovation.jpg",
    "relatedDays": [
      "national-technology-day",
      "national-stem-day",
      "national-patent-day"
    ],
    "howToCelebrate": "Learn about famous American inventors. Visit science and technology museums. Work on your own inventions or ideas. Apply for a patent if you have an invention. Encourage kids to be creative and innovative. Share inventor stories on social media.",
    "funFacts": [
      "The US Patent Office has issued over 11 million patents",
      "Thomas Edison held 1,093 US patents",
      "American inventors created the telephone, airplane, and internet",
      "The US leads the world in innovation and patents",
      "Many everyday items were invented in America"
    ]
  },
  {
    "title": "National Book Lovers Day",
    "slug": "national-book-lovers-day-reading",
    "date": "2025-08-09",
    "category": "National",
    "description": "Get lost in a good book on National Book Lovers Day! Celebrate the joy of reading and America's rich literary tradition. From classic American literature to contemporary bestsellers, books transport us, educate us, and inspire us.",
    "tags": [
      "books",
      "reading",
      "August",
      "literature",
      "education",
      "authors",
      "libraries"
    ],
    "image": "book-lovers-reading.jpg",
    "relatedDays": [
      "world-book-day",
      "national-library-week",
      "national-reading-day"
    ],
    "howToCelebrate": "Read your favorite book or discover a new one. Visit your local library or bookstore. Join a book club or start one. Share book recommendations with friends. Donate books to schools or charities. Post about your favorite books on social media.",
    "funFacts": [
      "Americans buy over 2.7 billion books annually",
      "The US publishes over 300,000 new titles each year",
      "America has over 116,000 libraries",
      "Many of the world's bestselling authors are American",
      "Reading regularly improves vocabulary, focus, and empathy"
    ]
  },
  {
    "title": "National Parks Week",
    "slug": "national-parks-week-conservation",
    "date": "2025-04-19",
    "category": "National",
    "description": "Explore America's natural treasures during National Parks Week! Celebrate the 63 national parks and over 400 National Park Service sites that preserve America's most spectacular landscapes, wildlife, and history for future generations.",
    "tags": [
      "national-parks",
      "conservation",
      "April",
      "nature",
      "outdoors",
      "heritage",
      "recreation"
    ],
    "image": "national-parks-landscape-scenic.jpg",
    "relatedDays": [
      "earth-day",
      "national-public-lands-day",
      "arbor-day"
    ],
    "howToCelebrate": "Visit a national park (many offer free admission during this week). Volunteer for park clean-up or maintenance. Learn about park history and conservation. Support park foundations. Plan future park visits. Share park photos and experiences on social media.",
    "funFacts": [
      "America's first national park was Yellowstone, established in 1872",
      "National parks protect over 84 million acres",
      "Over 300 million people visit national parks annually",
      "The National Park Service was created in 1916",
      "Parks preserve both natural wonders and historical sites"
    ]
  },
  {
    "title": "National First Responders Day",
    "slug": "national-first-responders-day-heroes",
    "date": "2025-10-28",
    "category": "National",
    "description": "Thank the heroes who run toward danger on National First Responders Day! Honor police officers, firefighters, paramedics, and EMTs who risk their lives daily to protect and serve American communities. Their courage and dedication save countless lives.",
    "tags": [
      "first-responders",
      "heroes",
      "October",
      "public-safety",
      "emergency",
      "service",
      "gratitude"
    ],
    "image": "first-responders-heroes.jpg",
    "relatedDays": [
      "national-firefighters-day",
      "police-officers-memorial-day",
      "ems-week"
    ],
    "howToCelebrate": "Thank first responders you encounter. Donate to first responder organizations. Learn CPR and first aid. Visit local fire and police stations. Support families of fallen first responders. Share gratitude on social media.",
    "funFacts": [
      "Over 4.6 million Americans work as first responders",
      "First responders risk their lives every day for strangers",
      "Many first responders are volunteers, especially firefighters",
      "First responders face physical and mental health challenges",
      "Communities depend on first responders 24/7/365"
    ]
  },
  {
    "title": "National Nurses Day",
    "slug": "national-nurses-day-healthcare",
    "date": "2025-05-06",
    "category": "National",
    "description": "Honor the compassionate caregivers on National Nurses Day! Nurses are the backbone of American healthcare, providing expert care with kindness and dedication. This day begins National Nurses Week, celebrating these essential healthcare professionals.",
    "tags": [
      "nurses",
      "healthcare",
      "May",
      "medical",
      "caregivers",
      "appreciation",
      "heroes"
    ],
    "image": "nurses-healthcare-heroes.jpg",
    "relatedDays": [
      "national-nurses-week",
      "doctors-day",
      "national-hospital-week"
    ],
    "howToCelebrate": "Thank nurses you know or encounter. Give cards or small gifts to nursing staff. Support nursing scholarships. Learn about the nursing profession. Share nurse appreciation posts on social media. Donate to nursing organizations.",
    "funFacts": [
      "Over 4.2 million registered nurses work in the US",
      "Nursing is one of the most trusted professions",
      "Nurses provide direct patient care in all healthcare settings",
      "Florence Nightingale founded modern nursing",
      "The nursing shortage affects healthcare nationwide"
    ]
  },
  {
    "title": "National Police Week",
    "slug": "national-police-week-law-enforcement",
    "date": "2025-05-11",
    "category": "National",
    "description": "Honor fallen officers and support law enforcement during National Police Week! This week pays tribute to police officers who died in the line of duty and recognizes all officers who serve and protect American communities with courage and dedication.",
    "tags": [
      "police",
      "law-enforcement",
      "May",
      "memorial",
      "service",
      "heroes",
      "safety"
    ],
    "image": "police-officers-memorial.jpg",
    "relatedDays": [
      "peace-officers-memorial-day",
      "national-first-responders-day",
      "memorial-day"
    ],
    "howToCelebrate": "Thank police officers for their service. Attend memorial ceremonies for fallen officers. Support police families and survivors. Learn about law enforcement challenges. Display blue lights or ribbons. Share appreciation on social media.",
    "funFacts": [
      "Over 800,000 sworn officers serve in US law enforcement",
      "National Police Week has been observed since 1962",
      "May 15th is Peace Officers Memorial Day",
      "The National Law Enforcement Memorial honors fallen officers",
      "Police work is physically and emotionally demanding"
    ]
  },
  {
    "title": "National Disability Employment Awareness Month",
    "slug": "national-disability-employment-awareness-month",
    "date": "2025-10-01",
    "category": "National",
    "description": "Promote inclusion and opportunity during National Disability Employment Awareness Month! October celebrates the contributions of workers with disabilities and promotes inclusive employment practices. Every American deserves the opportunity to work and contribute their talents.",
    "tags": [
      "disability",
      "employment",
      "October",
      "inclusion",
      "accessibility",
      "awareness",
      "workplace"
    ],
    "image": "disability-employment-inclusion.jpg",
    "relatedDays": [
      "international-day-of-persons-with-disabilities",
      "ada-anniversary",
      "inclusive-employment-day"
    ],
    "howToCelebrate": "Promote inclusive hiring practices. Learn about disability accommodations. Support businesses that employ people with disabilities. Advocate for workplace accessibility. Share success stories of employees with disabilities. Educate others about disability employment.",
    "funFacts": [
      "1 in 4 American adults lives with a disability",
      "The Americans with Disabilities Act passed in 1990",
      "People with disabilities have high unemployment rates despite abilities",
      "Workplace accommodations are often simple and low-cost",
      "Inclusive workplaces benefit everyone"
    ]
  },
  {
    "title": "National STEM Day",
    "slug": "national-stem-day-science",
    "date": "2025-11-08",
    "category": "National",
    "description": "Ignite curiosity and innovation on National STEM Day! Science, Technology, Engineering, and Mathematics drive American innovation and economic growth. Encourage students to pursue STEM careers and celebrate the scientists and engineers shaping our future.",
    "tags": [
      "STEM",
      "science",
      "November",
      "technology",
      "education",
      "innovation",
      "careers"
    ],
    "image": "stem-science-technology.jpg",
    "relatedDays": [
      "national-science-day",
      "national-engineers-week",
      "national-inventors-day"
    ],
    "howToCelebrate": "Participate in STEM activities or experiments. Visit science museums or research facilities. Encourage kids to explore STEM subjects. Support STEM education programs. Learn about STEM careers. Share STEM achievements and opportunities on social media.",
    "funFacts": [
      "STEM jobs are projected to grow 10.5% by 2030",
      "The US needs more STEM professionals to remain competitive",
      "Women and minorities are underrepresented in STEM",
      "STEM careers offer high salaries and job security",
      "Early STEM exposure increases likelihood of STEM careers"
    ]
  },
  {
    "title": "National Doughnut Day",
    "slug": "national-doughnut-day-free-donuts",
    "date": "2025-06-06",
    "category": "National",
    "description": "Get free doughnuts on National Doughnut Day! The first Friday in June, major chains like Krispy Kreme and Dunkin' offer free donuts. Originally honoring Salvation Army volunteers, it's now a beloved commercial celebration with millions of free donuts given away.",
    "tags": [
      "donuts",
      "doughnuts",
      "June",
      "free-food",
      "deals",
      "American",
      "dessert"
    ],
    "image": "national-doughnut-day-free.jpg",
    "relatedDays": [
      "national-donut-day",
      "national-dessert-day",
      "free-slurpee-day"
    ],
    "howToCelebrate": "Get free donuts from participating chains. Try different donut flavors. Make homemade donuts. Visit local donut shops. Share donut photos on social media.",
    "funFacts": [
      "National Doughnut Day started in 1938",
      "Americans eat 10 billion donuts annually",
      "Krispy Kreme and Dunkin' give away millions of free donuts",
      "The donut industry is worth over $7 billion in the US",
      "Originally honored Salvation Army Lassies who served donuts in WWI"
    ]
  },
  {
    "title": "National Cinema Day",
    "slug": "national-cinema-day-movies",
    "date": "2025-08-31",
    "category": "National",
    "description": "Hit the big screen on National Cinema Day! Movie theaters across America offer discounted tickets, typically $3-4. This annual event revitalizes movie-going culture and celebrates the theatrical experience with millions of attendees.",
    "tags": [
      "cinema",
      "movies",
      "August",
      "deals",
      "entertainment",
      "theaters",
      "discounts"
    ],
    "image": "national-cinema-day-theater.jpg",
    "relatedDays": [
      "oscar-night",
      "national-movie-night",
      "popcorn-day"
    ],
    "howToCelebrate": "Watch movies at discounted prices. See multiple films. Try different genres. Visit different theater formats (IMAX, Dolby). Share movie experiences on social media.",
    "funFacts": [
      "Millions of tickets are sold on National Cinema Day",
      "Tickets are typically under $4 on this day",
      "Started to revive theater attendance post-pandemic",
      "Theaters see record attendance on this day",
      "Celebrates the communal movie-watching experience"
    ]
  },
  {
    "title": "National Streaming Day",
    "slug": "national-streaming-day-entertainment",
    "date": "2025-05-20",
    "category": "National",
    "description": "Binge-watch on National Streaming Day! Celebrate the streaming revolution that transformed entertainment. Netflix, Hulu, Disney+, and others have changed how Americans consume content, with streaming now surpassing cable TV.",
    "tags": [
      "streaming",
      "entertainment",
      "May",
      "Netflix",
      "TV",
      "movies",
      "technology"
    ],
    "image": "national-streaming-day-services.jpg",
    "relatedDays": [
      "national-binge-day",
      "world-television-day",
      "netflix-anniversary"
    ],
    "howToCelebrate": "Start a new series. Binge your favorite shows. Try a new streaming service. Watch movies you've been meaning to see. Share streaming recommendations.",
    "funFacts": [
      "Over 80% of Americans have at least one streaming subscription",
      "Streaming has surpassed cable TV viewership",
      "Americans spend 3+ hours daily watching streaming content",
      "Netflix has over 230 million subscribers globally",
      "Streaming services generate billions in revenue"
    ]
  },
  {
    "title": "National Grilling Month",
    "slug": "national-grilling-month-summer",
    "date": "2025-07-04",
    "category": "National",
    "description": "Fire up the BBQ for National Grilling Month! July is peak grilling season in America. From Independence Day to weekend cookouts, grilling is a beloved American tradition with billions spent on grills and BBQ supplies.",
    "tags": [
      "grilling",
      "BBQ",
      "July",
      "summer",
      "cooking",
      "American",
      "outdoors"
    ],
    "image": "national-grilling-month-bbq.jpg",
    "relatedDays": [
      "independence-day",
      "national-barbecue-day",
      "memorial-day"
    ],
    "howToCelebrate": "Grill your favorite foods. Try new grilling recipes and techniques. Host BBQ parties. Clean and maintain your grill. Share grilling tips and photos.",
    "funFacts": [
      "75% of American households own a grill",
      "Americans grill year-round, but July is peak season",
      "Grill and BBQ industry worth over $5 billion annually",
      "Independence Day is the biggest grilling day",
      "Men do 70% of the grilling in American households"
    ]
  },
  {
    "title": "National Candy Corn Day",
    "slug": "national-candy-corn-day-halloween",
    "date": "2025-10-30",
    "category": "National",
    "description": "Love it or hate it on National Candy Corn Day! This polarizing Halloween candy generates passionate debates. Despite critics, 35 million pounds are produced annually, making it an American Halloween tradition.",
    "tags": [
      "candy-corn",
      "candy",
      "October",
      "Halloween",
      "sweets",
      "American",
      "controversial"
    ],
    "image": "national-candy-corn-day.jpg",
    "relatedDays": [
      "halloween",
      "national-candy-day",
      "trick-or-treat-day"
    ],
    "howToCelebrate": "Eat candy corn. Try candy corn recipes. Debate whether candy corn is good. Make candy corn crafts. Share candy corn opinions on social media.",
    "funFacts": [
      "35 million pounds of candy corn produced annually",
      "Candy corn was created in the 1880s",
      "It's one of the most divisive candies",
      "October 30th is the day before Halloween",
      "Brach's produces 85% of candy corn in America"
    ]
  },
  {
    "title": "National Pumpkin Day",
    "slug": "national-pumpkin-day-fall",
    "date": "2025-10-26",
    "category": "National",
    "description": "Fall for pumpkins on National Pumpkin Day! From jack-o'-lanterns to pumpkin spice, pumpkins are synonymous with American autumn. The pumpkin industry generates billions with Americans buying millions of pumpkins each fall.",
    "tags": [
      "pumpkin",
      "fall",
      "October",
      "autumn",
      "Halloween",
      "American",
      "seasonal"
    ],
    "image": "national-pumpkin-day-patch.jpg",
    "relatedDays": [
      "halloween",
      "pumpkin-spice-season",
      "thanksgiving"
    ],
    "howToCelebrate": "Carve pumpkins. Make pumpkin recipes. Visit pumpkin patches. Try pumpkin-flavored foods. Share pumpkin photos and creations.",
    "funFacts": [
      "Americans spend over $700 million on pumpkins annually",
      "Illinois produces the most pumpkins in America",
      "80% of pumpkins are available in October",
      "Pumpkin spice is a billion-dollar flavor trend",
      "Pumpkin pie is a Thanksgiving tradition"
    ]
  },
  {
    "title": "National Watermelon Day",
    "slug": "national-watermelon-day-summer",
    "date": "2025-08-03",
    "category": "National",
    "description": "Cool down on National Watermelon Day! This summer essential is perfect for hot days. Americans consume billions of pounds of watermelon annually, making it the ultimate summer fruit and picnic staple.",
    "tags": [
      "watermelon",
      "fruit",
      "August",
      "summer",
      "healthy",
      "American",
      "refreshing"
    ],
    "image": "national-watermelon-day-slices.jpg",
    "relatedDays": [
      "national-picnic-day",
      "independence-day",
      "summer-solstice"
    ],
    "howToCelebrate": "Eat watermelon. Have watermelon seed-spitting contests. Make watermelon recipes. Visit farmers markets. Share watermelon moments online.",
    "funFacts": [
      "Americans eat 4 billion pounds of watermelon yearly",
      "Watermelon is 92% water",
      "China produces 70% of the world's watermelons",
      "Watermelon is both a fruit and vegetable",
      "Peak season is May through September"
    ]
  },
  {
    "title": "National Bicarbonate of Soda Day",
    "slug": "national-baking-soda-day",
    "date": "2025-12-30",
    "category": "National",
    "description": "Celebrate the power of baking soda! This versatile household staple has countless uses from baking to cleaning. Nearly every American household has baking soda, making it a true American pantry essential.",
    "tags": [
      "baking-soda",
      "household",
      "December",
      "baking",
      "cleaning",
      "versatile",
      "American"
    ],
    "image": "national-baking-soda-day.jpg",
    "relatedDays": [
      "national-baking-day",
      "spring-cleaning-day",
      "household-tips-day"
    ],
    "howToCelebrate": "Use baking soda in recipes. Try baking soda cleaning hacks. Learn new baking soda uses. Stock up on baking soda. Share baking soda tips online.",
    "funFacts": [
      "95% of American households have baking soda",
      "Baking soda has over 100 uses",
      "Arm & Hammer has sold baking soda since 1846",
      "It's used in baking, cleaning, and personal care",
      "Annual baking soda sales exceed hundreds of millions"
    ]
  },
  {
    "title": "National Iced Tea Day",
    "slug": "national-iced-tea-day-summer",
    "date": "2025-06-10",
    "category": "National",
    "description": "Sip sweetly on National Iced Tea Day! Iced tea is the unofficial drink of summer in America. From sweet tea in the South to unsweetened varieties, Americans drink billions of gallons of iced tea annually.",
    "tags": [
      "iced-tea",
      "beverages",
      "June",
      "summer",
      "refreshing",
      "American",
      "drinks"
    ],
    "image": "national-iced-tea-day-glass.jpg",
    "relatedDays": [
      "national-sweet-tea-day",
      "national-tea-day",
      "summer-beverage-day"
    ],
    "howToCelebrate": "Drink iced tea. Try different iced tea flavors. Make homemade iced tea. Visit tea shops. Share iced tea recipes and photos.",
    "funFacts": [
      "Americans drink over 3.8 billion gallons of iced tea yearly",
      "80% of tea consumed in America is iced",
      "Sweet tea is the official beverage of the South",
      "Iced tea was popularized at the 1904 World's Fair",
      "The iced tea industry is worth billions"
    ]
  },
  {
    "title": "National Lemonade Day",
    "slug": "national-lemonade-day-summer",
    "date": "2025-08-20",
    "category": "National",
    "description": "Pucker up on National Lemonade Day! This classic American summer drink brings back childhood memories of lemonade stands. From homemade to store-bought, lemonade is a refreshing billion-dollar industry.",
    "tags": [
      "lemonade",
      "beverages",
      "August",
      "summer",
      "childhood",
      "American",
      "refreshing"
    ],
    "image": "national-lemonade-day-pitcher.jpg",
    "relatedDays": [
      "lemonade-stand-day",
      "national-summer-day",
      "national-picnic-day"
    ],
    "howToCelebrate": "Make homemade lemonade. Try flavored lemonade varieties. Set up a lemonade stand. Support kids' lemonade stands. Share lemonade recipes online.",
    "funFacts": [
      "Americans drink billions of gallons of lemonade annually",
      "Lemonade stands teach kids entrepreneurship",
      "Pink lemonade was created by accident in the 1800s",
      "Lemonade is the most popular summer beverage",
      "The lemonade industry generates hundreds of millions"
    ]
  },
  {
    "title": "National Root Beer Float Day",
    "slug": "national-root-beer-float-day",
    "date": "2025-08-06",
    "category": "National",
    "description": "Float away on National Root Beer Float Day! This classic American treat combines root beer and vanilla ice cream perfectly. A&W and other chains celebrate with deals on this nostalgic summer dessert.",
    "tags": [
      "root-beer-float",
      "dessert",
      "August",
      "summer",
      "nostalgic",
      "American",
      "classic"
    ],
    "image": "national-root-beer-float-day.jpg",
    "relatedDays": [
      "national-ice-cream-day",
      "national-soda-day",
      "national-diner-day"
    ],
    "howToCelebrate": "Make root beer floats at home. Visit A&W or other chains for deals. Try different soda float combinations. Host a float party. Share float photos online.",
    "funFacts": [
      "The root beer float was invented in 1893",
      "Also called a 'Black Cow' in some regions",
      "A&W popularized root beer floats nationally",
      "Root beer is uniquely American",
      "Perfect combination of creamy and fizzy"
    ]
  },
  {
    "title": "National Cupcake Day",
    "slug": "national-cupcake-day-dessert",
    "date": "2025-12-15",
    "category": "National",
    "description": "Sweeten up on National Cupcake Day! These individual-sized cakes became a cultural phenomenon. From basic vanilla to gourmet flavors, cupcake bakeries and home bakers create millions of these treats daily.",
    "tags": [
      "cupcakes",
      "dessert",
      "December",
      "baking",
      "sweets",
      "American",
      "trendy"
    ],
    "image": "national-cupcake-day-frosted.jpg",
    "relatedDays": [
      "national-baking-day",
      "national-dessert-day",
      "national-cake-day"
    ],
    "howToCelebrate": "Bake cupcakes. Visit cupcake bakeries. Try unique cupcake flavors. Decorate cupcakes creatively. Share cupcake photos on social media.",
    "funFacts": [
      "Cupcake bakeries became a trend in the 2000s",
      "Americans spend hundreds of millions on cupcakes",
      "Cupcakes date back to the 1700s",
      "Reality TV shows popularized gourmet cupcakes",
      "Red velvet is the most popular cupcake flavor"
    ]
  },
  {
    "title": "National Ice Cream Sundae Day",
    "slug": "national-ice-cream-sundae-day",
    "date": "2025-07-11",
    "category": "National",
    "description": "Top it off on National Ice Cream Sundae Day! This American dessert classic features ice cream with toppings galore. From hot fudge to whipped cream, sundaes are a customizable treat beloved by millions.",
    "tags": [
      "ice-cream",
      "sundae",
      "July",
      "dessert",
      "summer",
      "American",
      "classic"
    ],
    "image": "national-sundae-day-toppings.jpg",
    "relatedDays": [
      "national-ice-cream-day",
      "national-hot-fudge-day",
      "national-whipped-cream-day"
    ],
    "howToCelebrate": "Make ice cream sundaes with your favorite toppings. Visit ice cream parlors. Try creative sundae combinations. Host a sundae bar party. Share sundae creations online.",
    "funFacts": [
      "The sundae was invented in America in the 1880s",
      "Named 'sundae' to avoid selling ice cream on Sundays",
      "Americans eat billions of dollars worth of ice cream yearly",
      "Hot fudge is the most popular topping",
      "Sundaes allow endless customization"
    ]
  },
  {
    "title": "National Peanut Day",
    "slug": "national-peanut-day-american",
    "date": "2025-09-13",
    "category": "National",
    "description": "Go nuts for National Peanut Day! Peanuts are a multi-billion dollar American crop. From peanut butter to boiled peanuts, baseball games to trail mix, peanuts are deeply embedded in American culture.",
    "tags": [
      "peanuts",
      "food",
      "September",
      "American",
      "farming",
      "snacks",
      "healthy"
    ],
    "image": "national-peanut-day-harvest.jpg",
    "relatedDays": [
      "national-peanut-butter-day",
      "peanut-butter-lovers-day",
      "national-nut-day"
    ],
    "howToCelebrate": "Eat peanuts and peanut products. Learn about peanut farming. Try different peanut varieties. Make peanut recipes. Share peanut facts online.",
    "funFacts": [
      "Americans eat 6 pounds of peanuts per person yearly",
      "The peanut industry is worth over $4 billion",
      "George Washington Carver invented 300 peanut products",
      "Peanuts are legumes, not nuts",
      "Two peanut farmers became US presidents"
    ]
  },
  {
    "title": "National Eat Outside Day",
    "slug": "national-eat-outside-day-picnic",
    "date": "2025-08-31",
    "category": "National",
    "description": "Dine al fresco on National Eat Outside Day! Enjoy meals in the great outdoors. From picnics to patio dining, eating outside is a beloved summer activity that Americans embrace whenever weather permits.",
    "tags": [
      "outdoor-dining",
      "picnic",
      "August",
      "summer",
      "nature",
      "American",
      "leisure"
    ],
    "image": "national-eat-outside-day-picnic.jpg",
    "relatedDays": [
      "national-picnic-day",
      "national-parks-week",
      "summer-solstice"
    ],
    "howToCelebrate": "Have a picnic in the park. Eat on your patio or balcony. Visit outdoor restaurants. Pack a lunch for outdoor eating. Share outdoor dining photos.",
    "funFacts": [
      "Outdoor dining increased dramatically post-pandemic",
      "Americans spend billions at outdoor dining establishments",
      "Eating outside improves mood and wellbeing",
      "Parks see millions of picnickers annually",
      "Patio dining is a restaurant revenue driver"
    ]
  },
  {
    "title": "National Farmers Market Week",
    "slug": "national-farmers-market-week",
    "date": "2025-08-03",
    "category": "National",
    "description": "Support local on National Farmers Market Week! Over 8,000 farmers markets operate in America, connecting consumers with local farmers. Fresh produce, artisan goods, and community vibes make farmers markets beloved American institutions.",
    "tags": [
      "farmers-market",
      "local",
      "August",
      "agriculture",
      "community",
      "American",
      "fresh-food"
    ],
    "image": "national-farmers-market-week.jpg",
    "relatedDays": [
      "farm-to-table-week",
      "national-agriculture-day",
      "buy-local-day"
    ],
    "howToCelebrate": "Visit your local farmers market. Buy local produce and products. Meet local farmers. Try new seasonal foods. Share farmers market finds online.",
    "funFacts": [
      "Over 8,600 farmers markets operate in the US",
      "Farmers markets generate billions in sales",
      "Markets support local economies and farmers",
      "Farmers markets have grown 300% since the 1990s",
      "Fresh, local food is healthier and tastier"
    ]
  },
  {
    "title": "National Roller Coaster Day",
    "slug": "national-roller-coaster-day-thrills",
    "date": "2025-08-16",
    "category": "National",
    "description": "Scream on National Roller Coaster Day! America has the most roller coasters in the world. Theme parks across the nation offer discounted tickets, celebrating these engineering marvels that thrill millions yearly.",
    "tags": [
      "roller-coasters",
      "amusement-parks",
      "August",
      "summer",
      "American",
      "entertainment",
      "thrills"
    ],
    "image": "national-roller-coaster-day.jpg",
    "relatedDays": [
      "theme-park-day",
      "six-flags-day",
      "disney-parks-day"
    ],
    "howToCelebrate": "Visit amusement parks. Ride roller coasters. Try new coasters you've never ridden. Share roller coaster videos. Take advantage of park deals.",
    "funFacts": [
      "America has over 800 roller coasters",
      "Theme park industry worth billions annually",
      "Six Flags, Cedar Fair, and Disney dominate",
      "Americans ride millions of roller coaster rides yearly",
      "August 16 celebrates roller coaster invention in 1878"
    ]
  },
  {
    "title": "National Waterpark Day",
    "slug": "national-waterpark-day-summer",
    "date": "2025-07-28",
    "category": "National",
    "description": "Splash into fun on National Waterpark Day! Water parks offer summer relief and entertainment for millions. From wave pools to water slides, the American waterpark industry generates billions in revenue annually.",
    "tags": [
      "waterparks",
      "summer",
      "July",
      "family-fun",
      "American",
      "entertainment",
      "aquatic"
    ],
    "image": "national-waterpark-day-slides.jpg",
    "relatedDays": [
      "national-swimming-day",
      "summer-fun-day",
      "theme-park-day"
    ],
    "howToCelebrate": "Visit waterparks. Ride water slides. Enjoy wave pools and lazy rivers. Pack waterpark essentials. Share waterpark fun on social media.",
    "funFacts": [
      "Over 85 million Americans visit waterparks annually",
      "The waterpark industry is worth billions",
      "America has over 1,000 waterparks",
      "Wisconsin Dells is the 'Waterpark Capital of the World'",
      "Waterparks provide summer jobs for thousands"
    ]
  },
  {
    "title": "National Fantasy Football Draft Day",
    "slug": "national-fantasy-football-draft-day",
    "date": "2025-09-01",
    "category": "National",
    "description": "Draft your team on National Fantasy Football Draft Day! Over 60 million Americans play fantasy football, making it a cultural phenomenon. Draft day kicks off months of competition, trash talk, and football obsession.",
    "tags": [
      "fantasy-football",
      "football",
      "September",
      "sports",
      "American",
      "gaming",
      "competition"
    ],
    "image": "national-fantasy-football-draft.jpg",
    "relatedDays": [
      "nfl-opening-day",
      "super-bowl-sunday",
      "national-sports-day"
    ],
    "howToCelebrate": "Draft your fantasy team. Host draft parties. Research player rankings. Join fantasy leagues. Share draft results online.",
    "funFacts": [
      "Over 60 million Americans play fantasy football",
      "Fantasy football generates billions in economic impact",
      "Draft prep consumes hours of research time",
      "Fantasy has changed how people watch football",
      "Workplace productivity drops during fantasy season"
    ]
  },
  {
    "title": "National Donut Day Deals",
    "slug": "national-donut-day-free-deals",
    "date": "2025-06-06",
    "category": "National",
    "description": "Double-dip on National Donut Day! Major chains compete with the best free donut offers. Krispy Kreme, Dunkin', Tim Hortons, and local shops give away millions of donuts, making this a sweet commercial holiday.",
    "tags": [
      "donuts",
      "deals",
      "June",
      "free-food",
      "commercial",
      "American",
      "dessert"
    ],
    "image": "national-donut-day-chains.jpg",
    "relatedDays": [
      "national-doughnut-day",
      "free-breakfast-day",
      "national-dessert-day"
    ],
    "howToCelebrate": "Get free donuts from all participating chains. Visit multiple locations. Try specialty donuts. Take advantage of all deals. Share donut haul photos.",
    "funFacts": [
      "Millions of free donuts given away on this day",
      "Donut chains compete for biggest giveaways",
      "Lines can be hours long at popular locations",
      "Great marketing day for donut companies",
      "American donut consumption spikes dramatically"
    ]
  },
  {
    "title": "National Military Appreciation Month",
    "slug": "national-military-appreciation-month-may",
    "date": "2025-05-01",
    "category": "National",
    "description": "Honor all who serve! May is dedicated to recognizing the men and women of the United States Armed Forces. From active duty to veterans, celebrate their service, sacrifice, and dedication to protecting our freedom.",
    "tags": [
      "military",
      "appreciation",
      "May",
      "veterans",
      "armed-forces",
      "service",
      "honor"
    ],
    "image": "military-appreciation.jpg",
    "relatedDays": [
      "memorial-day",
      "veterans-day",
      "armed-forces-day"
    ],
    "howToCelebrate": "Thank service members and veterans. Attend military ceremonies. Support military families. Volunteer at VA hospitals. Display the flag. Learn about military history. Donate to veteran organizations.",
    "funFacts": [
      "May includes several military observances",
      "VE Day (May 8), Armed Forces Day (3rd Saturday), Memorial Day (last Monday)",
      "Over 1.3 million Americans serve on active duty",
      "Military service runs in many American families",
      "The US has the world's largest military budget"
    ]
  },
  {
    "title": "National Native American Heritage Month",
    "slug": "national-native-american-heritage-month-november",
    "date": "2025-11-01",
    "category": "National",
    "description": "Celebrate Indigenous peoples and cultures! November honors Native American heritage, history, and contributions to America. Learn about tribal nations, support Native artists and businesses, and recognize the rich cultural diversity of Indigenous peoples.",
    "tags": [
      "native-american",
      "indigenous",
      "November",
      "heritage",
      "culture",
      "history",
      "awareness"
    ],
    "image": "native-american-heritage.jpg",
    "relatedDays": [
      "indigenous-peoples-day",
      "native-american-day",
      "tribal-culture-day"
    ],
    "howToCelebrate": "Learn about Native American history and cultures. Support Native-owned businesses. Visit cultural museums and heritage sites. Read Native American authors. Attend powwows and cultural events. Acknowledge whose land you're on.",
    "funFacts": [
      "574 federally recognized Native American tribes in the US",
      "Each tribe has its own unique culture and language",
      "Many English words come from Native American languages",
      "Native Americans have served in the US military at high rates",
      "Tribal sovereignty gives tribes self-governance rights"
    ]
  },
  {
    "title": "National Teacher Appreciation Week",
    "slug": "national-teacher-appreciation-week-may",
    "date": "2025-05-05",
    "category": "National",
    "description": "Thank America's teachers! The first full week of May celebrates educators who shape young minds. Teachers work tirelessly, often with their own money, to give students the best education. Show appreciation for these dedicated professionals!",
    "tags": [
      "teachers",
      "education",
      "May",
      "appreciation",
      "schools",
      "educators",
      "gratitude"
    ],
    "image": "teacher-appreciation.jpg",
    "relatedDays": [
      "world-teachers-day",
      "back-to-school-day",
      "education-week"
    ],
    "howToCelebrate": "Thank your child's teachers. Give thoughtful gifts or notes. Volunteer in classrooms. Advocate for teacher pay and resources. Share positive teacher stories. Support education funding.",
    "funFacts": [
      "US teachers spend an average of $500 of their own money on supplies",
      "Over 3.7 million teachers work in public schools",
      "Tuesday of the week is National Teacher Day",
      "Many teachers work second jobs to make ends meet",
      "Teachers impact hundreds of students over their careers"
    ]
  },
  {
    "title": "National School Lunch Week",
    "slug": "national-school-lunch-week-nutrition",
    "date": "2025-10-13",
    "category": "National",
    "description": "Fuel growing minds! National School Lunch Week celebrates the school nutrition professionals who feed millions of students daily. Recognize the importance of healthy school meals and the people who prepare them.",
    "tags": [
      "school-lunch",
      "nutrition",
      "October",
      "children",
      "health",
      "education",
      "food"
    ],
    "image": "school-lunch-healthy.jpg",
    "relatedDays": [
      "school-breakfast-week",
      "nutrition-month",
      "food-service-workers-day"
    ],
    "howToCelebrate": "Thank school cafeteria workers. Learn about school nutrition programs. Volunteer with school meal programs. Advocate for healthy school food. Support free lunch programs for low-income students.",
    "funFacts": [
      "The National School Lunch Program serves 30 million children daily",
      "Started in 1946 to improve child nutrition",
      "Many children rely on school meals as their primary nutrition",
      "School nutrition standards have improved significantly",
      "Cafeteria workers often know hundreds of students by name"
    ]
  },
  {
    "title": "National Drive-Thru Day",
    "slug": "national-drive-thru-day-fast-food",
    "date": "2025-07-24",
    "category": "National",
    "description": "Celebrate American convenience! National Drive-Thru Day honors the uniquely American innovation that changed how we eat. From fast food to coffee, drive-thrus offer quick service without leaving your car. Many chains offer special deals!",
    "tags": [
      "drive-thru",
      "fast-food",
      "July",
      "convenience",
      "american",
      "restaurants",
      "deals"
    ],
    "image": "drive-thru-service.jpg",
    "relatedDays": [
      "fast-food-day",
      "customer-service-week",
      "national-french-fry-day"
    ],
    "howToCelebrate": "Use drive-thrus for meals today. Thank drive-thru workers. Take advantage of special deals. Try a new drive-thru restaurant. Share your drive-thru experiences. Appreciate the convenience.",
    "funFacts": [
      "The first drive-thru was Red's Giant Hamburg in 1947",
      "Drive-thrus account for 70% of fast-food sales",
      "The average drive-thru wait is 4-5 minutes",
      "Some banks and pharmacies offer drive-thru service",
      "Drive-thrus became essential during the pandemic"
    ]
  },
  {
    "title": "National Family Week",
    "slug": "national-family-week-thanksgiving",
    "date": "2025-11-23",
    "category": "National",
    "description": "Family comes first! The week of Thanksgiving celebrates the importance of family bonds and togetherness. Spend quality time with loved ones, create memories, and appreciate the people who matter most.",
    "tags": [
      "family",
      "thanksgiving",
      "November",
      "togetherness",
      "gratitude",
      "love",
      "bonds"
    ],
    "image": "family-togetherness.jpg",
    "relatedDays": [
      "thanksgiving-day",
      "family-day",
      "parent-appreciation-day"
    ],
    "howToCelebrate": "Spend quality time with family. Share meals together. Create family traditions. Express gratitude for loved ones. Take family photos. Share family stories and memories. Disconnect from devices and connect with each other.",
    "funFacts": [
      "Proclaimed annually by the President since 1989",
      "Always includes Thanksgiving Day",
      "Family meals improve child development and mental health",
      "American families are increasingly diverse",
      "Quality family time strengthens relationships"
    ]
  },
  {
    "title": "National Grandparents Day",
    "slug": "national-grandparents-day-family",
    "date": "2025-09-07",
    "category": "National",
    "description": "Honor grandparents! The first Sunday after Labor Day celebrates grandparents and the special role they play in families. Show appreciation for their wisdom, love, and the memories they create with grandchildren.",
    "tags": [
      "grandparents",
      "family",
      "September",
      "elderly",
      "appreciation",
      "generations",
      "love"
    ],
    "image": "grandparents-grandchildren.jpg",
    "relatedDays": [
      "family-day",
      "elderly-appreciation",
      "grandparent-appreciation-month"
    ],
    "howToCelebrate": "Visit or call grandparents. Share meals or activities together. Ask them about family history. Help with tasks or errands. Create intergenerational memories. Express love and gratitude.",
    "funFacts": [
      "Established as a national holiday in 1978",
      "Over 70 million grandparents in the US",
      "Many grandparents help raise grandchildren",
      "The official flower is the forget-me-not",
      "Grandparents pass down family stories and traditions"
    ]
  },
  {
    "title": "National Law Enforcement Appreciation Day",
    "slug": "national-law-enforcement-appreciation-day-january",
    "date": "2025-01-09",
    "category": "National",
    "description": "Thank our officers! L.E.A.D. (Law Enforcement Appreciation Day) honors police officers who protect and serve communities. Show appreciation for these brave men and women who risk their lives daily.",
    "tags": [
      "law-enforcement",
      "police",
      "January",
      "appreciation",
      "officers",
      "safety",
      "heroes"
    ],
    "image": "law-enforcement-appreciation.jpg",
    "relatedDays": [
      "police-week",
      "first-responders-day",
      "peace-officers-memorial-day"
    ],
    "howToCelebrate": "Thank police officers you meet. Show support for law enforcement. Learn about police work. Donate to police charities. Display blue lights. Share appreciation on social media.",
    "funFacts": [
      "Over 800,000 law enforcement officers serve in the US",
      "Police work is one of the most dangerous professions",
      "Officers face physical and mental health challenges",
      "Community policing builds trust",
      "January 9th is always L.E.A.D."
    ]
  },
  {
    "title": "National Take a Hike Day",
    "slug": "national-take-a-hike-day-november-17-outdoors",
    "date": "2025-11-17",
    "category": "National",
    "description": "Hit the trails! Take a Hike Day encourages Americans to explore nature through hiking. From easy walks to challenging climbs, hiking offers exercise, fresh air, and beautiful views.",
    "tags": [
      "hiking",
      "outdoors",
      "November",
      "nature",
      "trails",
      "exercise",
      "recreation"
    ],
    "image": "hiking-trails-nature.jpg",
    "relatedDays": [
      "national-parks-week",
      "get-outdoors-day",
      "trail-running-day"
    ],
    "howToCelebrate": "Go for a hike on local trails. Explore state or national parks. Try a new hiking route. Bring friends or family. Practice Leave No Trace. Share hiking photos and trail recommendations.",
    "funFacts": [
      "America has over 200,000 miles of trails",
      "Hiking improves physical and mental health",
      "November is a great time for fall foliage hikes",
      "Always tell someone your hiking plans",
      "Proper footwear prevents injuries"
    ]
  }
]